//Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
//	Запрос.Текст = ТекстЗапросаИнициализироватьДанныеДокумента(); // (обратно через "Ctrl"+"-")
//	
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСборкаЗапасов);
//	Запрос.УстановитьПараметр("ГраницаСреза", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Исключая));
//	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
//	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
//	Запрос.УстановитьПараметр("ИспользоватьПартии",  СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
//	Запрос.УстановитьПараметр("УчетПоЯчейкам",  СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
//	Запрос.УстановитьПараметр("ИспользоватьТехоперации",  СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьТехоперации);
//	Запрос.УстановитьПараметр("ИспользоватьЭтапыПроизводства",  СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьЭтапыПроизводства);
//	Запрос.УстановитьПараметр("ИспользоватьРезервирование",  СтруктураДополнительныеСвойства.УчетнаяПолитика.РезервированиеЗапасов);
//	
//	Запрос.УстановитьПараметр("ИспользоватьСерииНоменклатуры", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерииНоменклатуры);
//	Запрос.УстановитьПараметр("ОстаткиСерийНоменклатуры", СтруктураДополнительныеСвойства.УчетнаяПолитика.ОстаткиСерийНоменклатуры);
//	
//	// Прослеживаемость
//	Запрос.УстановитьПараметр("ВестиУчетПрослеживаемыхТоваров", СтруктураДополнительныеСвойства.УчетнаяПолитика.ВестиУчетПрослеживаемыхТоваров);
//	
//	// Временно: изменение движений по ордерному складу.
//	ДатаОбновленияНаРелиз_1_2_1 = Константы.ДатаОбновленияНаРелиз_1_2_1.Получить();
//	Запрос.УстановитьПараметр("ДатаОбновленияНаРелиз_1_2_1", ДатаОбновленияНаРелиз_1_2_1);
//	
//	Запрос.УстановитьПараметр("СборкаЗапасов", НСтр("ru = 'Сборка запасов'"));//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

//	РезультатыЗапроса = Запрос.ВыполнитьПакет();
//	
//	КонтрольОстатковУНФ.КонтрольПересчетаКоличества(Запрос.МенеджерВременныхТаблиц, СтруктураДополнительныеСвойства.Отказ,"ЗапасыПроверкаПересчета");
//	КонтрольОстатковУНФ.КонтрольПересчетаКоличества(Запрос.МенеджерВременныхТаблиц, СтруктураДополнительныеСвойства.Отказ, "ВременнаяТаблицаПродукция");
//	Если СтруктураДополнительныеСвойства.Отказ Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТаблицаЭтапыПроизводства = РезультатыЗапроса[9].Выгрузить();
//	Для Каждого ЭтапБрак из РезультатыЗапроса[17].Выгрузить() Цикл
//		СтрокаТаблицы = ТаблицаЭтапыПроизводства.Добавить();
//	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЭтапБрак);	
//	КонецЦикла;
//	
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатыЗапроса[2].Выгрузить().СкопироватьКолонки());
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатыЗапроса[3].Выгрузить());
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыпускПродукции", РезультатыЗапроса[4].Выгрузить());
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЭтапыПроизводства",ТаблицаЭтапыПроизводства);
//	
//	Отбор = Новый Структура;
//	ЗавершениеПроизводстваНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
//		Справочники.ЭтапыПроизводства.ЗавершениеПроизводства, "Наименование");
//	Отбор.Вставить("Этап", ЗавершениеПроизводстваНаименование);
//	
//	// Сформируем таблицу по размещению заказов.
//	СформироватьТаблицаРазмещениеЗаказовСборка(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);  
//	
//	// Автоперемещение продукции (дополним таблицу ТаблицаЗапасыНаСкладах).
//	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладах.Количество() - 1 Цикл
//		
//		СтрокаТаблицаЗапасыНаСкладах = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладах[н];
//		
//		Если (СтрокаТаблицаЗапасыНаСкладах.СтруктурнаяЕдиницаПродукции = СтрокаТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница
//			И СтрокаТаблицаЗапасыНаСкладах.ЯчейкаПродукции <> СтрокаТаблицаЗапасыНаСкладах.Ячейка)
//			ИЛИ СтрокаТаблицаЗапасыНаСкладах.СтруктурнаяЕдиницаПродукции <> СтрокаТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница Тогда
//			
//			// Расход.
//			Если (СтрокаТаблицаЗапасыНаСкладах.Период < ДатаОбновленияНаРелиз_1_2_1)
//				ИЛИ (СтрокаТаблицаЗапасыНаСкладах.Период >= ДатаОбновленияНаРелиз_1_2_1
//				И НЕ СтрокаТаблицаЗапасыНаСкладах.ОрдерныйСклад) Тогда
//				
//				СтрокаТаблицыРасход = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладах.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасыНаСкладах);
//				
//				СтрокаТаблицыРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
//				
//			КонецЕсли;
//			
//			// Приход.
//			Если (СтрокаТаблицаЗапасыНаСкладах.Период < ДатаОбновленияНаРелиз_1_2_1)
//				ИЛИ (СтрокаТаблицаЗапасыНаСкладах.Период >= ДатаОбновленияНаРелиз_1_2_1
//				И НЕ (СтрокаТаблицаЗапасыНаСкладах.ОрдерныйСкладПродукции И СтрокаТаблицаЗапасыНаСкладах.ОрдерныйСкладКПоступлению) 
//				И НЕ СтрокаТаблицаЗапасыНаСкладах.ОрдерныйСклад) Тогда
//				
//				СтрокаТаблицыПриход = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладах.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасыНаСкладах);
//				
//				СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасыНаСкладах.СтруктурнаяЕдиницаПродукции;
//				СтрокаТаблицыПриход.Ячейка = СтрокаТаблицаЗапасыНаСкладах.ЯчейкаПродукции;
//				
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	// Автоперемещение продукции (сформируем таблицу ТаблицаЗапасыКПоступлениюНаСклады).
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКПоступлениюНаСклады", РезультатыЗапроса[6].Выгрузить());
//	
//	// Автоперемещение продукции (сформируем таблицу ТаблицаЗапасыКРасходуСоСкладов).
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКРасходуСоСкладов", РезультатыЗапроса[7].Выгрузить());
//	
//	// Формирование структуры таблицы проводок документа.
//	ПроведениеДокументовУНФ.СформироватьТаблицуПроводок(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);
//	
//КонецПроцедуры // ИнициализироватьДанныеДокументаСборка()

//Функция ТекстЗапросаИнициализироватьДанныеДокумента() 
//	
//	Возврат
//	"ВЫБРАТЬ
//	|	СборкаЗапасовВыполненныеЭтапы.КлючСвязи КАК КлючСвязи,
//	|	СборкаЗапасовВыполненныеЭтапы.Этап КАК Этап
//	|ПОМЕСТИТЬ ВременнаяТаблицаВыполненныеЭтапы
//	|ИЗ
//	|	Документ.СборкаЗапасов.ВыполненныеЭтапы КАК СборкаЗапасовВыполненныеЭтапы
//	|ГДЕ
//	|	&ИспользоватьЭтапыПроизводства
//	|	И СборкаЗапасовВыполненныеЭтапы.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СборкаЗапасовПродукция.НомерСтроки КАК НомерСтроки,
//	|	СборкаЗапасовПродукция.Ссылка.Дата КАК Период,
//	|	СборкаЗапасовПродукция.КлючСвязи КАК КлючСвязи,
//	|	СборкаЗапасовПродукция.Ссылка КАК Ссылка,
//	|	&Организация КАК Организация,
//	|	СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ВЫБОР
//	|		КОГДА &УчетПоЯчейкам
//	|			ТОГДА СборкаЗапасовПродукция.Ссылка.Ячейка
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
//	|	КОНЕЦ КАК Ячейка,
//	|	СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад КАК ОрдерныйСклад,
//	|	СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиницаПродукции,
//	|	СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ОрдерныйСклад КАК ОрдерныйСкладПродукции,
//	|	ВЫБОР
//	|		КОГДА &УчетПоЯчейкам
//	|			ТОГДА СборкаЗапасовПродукция.Ссылка.ЯчейкаПродукции
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
//	|	КОНЕЦ КАК ЯчейкаПродукции,
//	|	ВЫБОР
//	|		КОГДА СборкаЗапасовПродукция.Ссылка.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
//	|			ТОГДА ВЫРАЗИТЬ(СборкаЗапасовПродукция.Ссылка.ЗаказНаПроизводство КАК
//	|				Документ.ЗаказНаПроизводство).УчетПотребностиПоСкладам
//	|		КОГДА СборкаЗапасовПродукция.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|			ТОГДА ВЫРАЗИТЬ(СборкаЗапасовПродукция.ЗаказПокупателя КАК Документ.ЗаказПокупателя).УчетПотребностиПоСкладам
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК УчетПотребностиПоСкладам,
//	|	СборкаЗапасовПродукция.Номенклатура КАК Номенклатура,
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьХарактеристики
//	|			ТОГДА СборкаЗапасовПродукция.Характеристика
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	|	КОНЕЦ КАК Характеристика,
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьПартии
//	|			ТОГДА СборкаЗапасовПродукция.Партия
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
//	|	КОНЕЦ КАК Партия,
//	|	СборкаЗапасовПродукция.Спецификация КАК Спецификация,
//	|	ВЫБОР
//	|		КОГДА
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
//	|		ИЛИ
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
//	|			ТОГДА СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗапасов
//	|		ИНАЧЕ СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗатрат
//	|	КОНЕЦ КАК СчетУчета,
//	|	ВЫБОР
//	|		КОГДА
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
//	|		ИЛИ
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
//	|			ТОГДА СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗапасов
//	|		ИНАЧЕ СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗатрат
//	|	КОНЕЦ КАК СчетУчетаПродукции,
//	|	ВЫБОР
//	|		КОГДА
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
//	|		ИЛИ
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
//	|			ТОГДА СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗапасов
//	|		ИНАЧЕ СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗатрат
//	|	КОНЕЦ КАК СчетДт,
//	|	ВЫБОР
//	|		КОГДА
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
//	|		ИЛИ
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
//	|			ТОГДА СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗапасов
//	|		ИНАЧЕ СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗатрат
//	|	КОНЕЦ КАК СчетДтПродукции,
//	|	ВЫБОР
//	|		КОГДА СборкаЗапасовПродукция.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
//	|		ИЛИ СборкаЗапасовПродукция.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
//	|		ИЛИ СборкаЗапасовПродукция.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
//	|			ТОГДА СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗапасов
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА
//	|				СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
//	|			ИЛИ
//	|				СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
//	|				ТОГДА СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗапасов
//	|			ИНАЧЕ СборкаЗапасовПродукция.Номенклатура.СчетУчетаЗатрат
//	|		КОНЕЦ
//	|	КОНЕЦ КАК СчетКтПродукции,
//	|	СборкаЗапасовПродукция.ЗаказПокупателя КАК ЗаказПокупателя,
//	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК КоррЗаказПокупателя,
//	|	СборкаЗапасовПродукция.Ссылка.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
//	|	ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка) КАК КоррЗаказНаПроизводство,
//	|	ВЫБОР
//	|		КОГДА СборкаЗапасовПродукция.Ссылка.ЗаказНаПроизводство = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
//	|			ТОГДА НЕОПРЕДЕЛЕНО
//	|		ИНАЧЕ СборкаЗапасовПродукция.Ссылка.ЗаказНаПроизводство
//	|	КОНЕЦ КАК ИсточникОбеспечения,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(СборкаЗапасовПродукция.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
//	|			ТОГДА СборкаЗапасовПродукция.Количество * СборкаЗапасовПродукция.ЕдиницаИзмерения.Коэффициент
//	|		ИНАЧЕ СборкаЗапасовПродукция.Количество
//	|	КОНЕЦ КАК ЧИСЛО(15, 3)) КАК Количество,
//	|	СборкаЗапасовПродукция.Количество КАК КоличествоДокумент,
//	|	СборкаЗапасовПродукция.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДокумент,
//	|	0 КАК СуммаБезНДС,
//	|	0 КАК Сумма,
//	|	ВЫРАЗИТЬ(&СборкаЗапасов КАК СТРОКА(100)) КАК СодержаниеПроводки,
//	|	ВЫРАЗИТЬ(&СборкаЗапасов КАК СТРОКА(100)) КАК Содержание,
//	|	&ДатаОбновленияНаРелиз_1_2_1 КАК ДатаОбновленияНаРелиз_1_2_1,
//	|	СборкаЗапасовПродукция.ПодразделениеЗавершающегоЭтапа КАК ПодразделениеЗавершающегоЭтапа,
//	|	ВЫБОР
//	|		КОГДА ВыполнениеПоЭтапам.КлючСвязи ЕСТЬ NULL
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК ИспользуютсяЭтапы,
//	|	ВЫБОР
//	|		КОГДА НЕ ЗавершенныеЭтапы.Этап ЕСТЬ NULL
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ЗавершающийЭтап,
//	|	СборкаЗапасовПродукция.СтранаПроисхождения КАК СтранаПроисхождения,
//	|	СборкаЗапасовПродукция.НомерГТД КАК НомерГТД,
//	|	ЕСТЬNULL(ПолитикиУчетаСерий.ПолитикаУчетаСерий, ВЫБОР
//	|		КОГДА СборкаЗапасовПродукция.Номенклатура.ИспользоватьСерииИзКатегории
//	|			ТОГДА СборкаЗапасовПродукция.Номенклатура.КатегорияНоменклатуры.ПолитикаУчетаСерий
//	|		ИНАЧЕ СборкаЗапасовПродукция.Номенклатура.ПолитикаУчетаСерий
//	|	КОНЕЦ) КАК ПолитикаУчетаСерий,
//	|	ВЫБОР
//	|		КОГДА
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам)
//	|			ТОГДА СборкаЗапасовПродукция.Ссылка
//	|		КОГДА
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоСкладскимОрдерам)
//	|			ТОГДА СборкаЗапасовПродукция.Ссылка.СкладскойОрдерПродукция
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК ДокументОснование,
//	|	ВЫБОР
//	|		КОГДА СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ОрдерныйСклад
//	|		И СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ИспользоватьОрдернуюСхемуПриПоступлении
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ОрдерныйСкладКПоступлению,
//	|	ВЫБОР
//	|		КОГДА СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ОрдерныйСклад
//	|		И СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ИспользоватьОрдернуюСхемуПриОтгрузке
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ОрдерныйСкладКОтгрузке,
//	|	ВЫБОР
//	|		КОГДА СборкаЗапасовПродукция.СтруктурнаяЕдиница.УчетОстатковПоЯчейкам
//	|			ТОГДА СборкаЗапасовПродукция.Ячейка
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК ЯчейкаКПоступлению,
//	|	ВЫБОР
//	|		КОГДА
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам)
//	|			ТОГДА СборкаЗапасовПродукция.Ссылка
//	|		КОГДА
//	|			СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоСкладскимОрдерам)
//	|			ТОГДА СборкаЗапасовПродукция.Ссылка.СкладскойОрдерЗапасы
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК ДокументОснованиеЗапасы
//	|ПОМЕСТИТЬ ВременнаяТаблицаПродукция
//	|ИЗ
//	|	Документ.СборкаЗапасов.Продукция КАК СборкаЗапасовПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			ВыполненныеЭтапы.КлючСвязи КАК КлючСвязи
//	|		ИЗ
//	|			ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		СГРУППИРОВАТЬ ПО
//	|			ВыполненныеЭтапы.КлючСвязи) КАК ВыполнениеПоЭтапам
//	|		ПО СборкаЗапасовПродукция.КлючСвязи = ВыполнениеПоЭтапам.КлючСвязи
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			СборкаЗапасовПродукция.КлючСвязи КАК КлючСвязи,
//	|			ЕСТЬNULL(ВременнаяТаблицаВыполненныеЭтапы.Этап, ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства)) КАК
//	|				Этап
//	|		ИЗ
//	|			Документ.СборкаЗапасов.Продукция КАК СборкаЗапасовПродукция
//	|				ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВременнаяТаблицаВыполненныеЭтапы
//	|				ПО СборкаЗапасовПродукция.КлючСвязи = ВременнаяТаблицаВыполненныеЭтапы.КлючСвязи
//	|		ГДЕ
//	|			СборкаЗапасовПродукция.Ссылка = &Ссылка
//	|			И ЕСТЬNULL(ВременнаяТаблицаВыполненныеЭтапы.Этап,
//	|				ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства)) = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства)) КАК
//	|			ЗавершенныеЭтапы
//	|		ПО СборкаЗапасовПродукция.КлючСвязи = ЗавершенныеЭтапы.КлючСвязи
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
//	|		ПО ВЫБОР
//	|			КОГДА СборкаЗапасовПродукция.Номенклатура.ИспользоватьСерииИзКатегории
//	|				ТОГДА СборкаЗапасовПродукция.Номенклатура.КатегорияНоменклатуры = ПолитикиУчетаСерий.Владелец
//	|			ИНАЧЕ СборкаЗапасовПродукция.Номенклатура = ПолитикиУчетаСерий.Владелец
//	|		КОНЕЦ
//	|		И СборкаЗапасовПродукция.СтруктурнаяЕдиница = ПолитикиУчетаСерий.СтруктурнаяЕдиница
//	|		И &Организация = ПолитикиУчетаСерий.Организация
//	|ГДЕ
//	|	СборкаЗапасовПродукция.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	МИНИМУМ(ТаблицаПродукция.НомерСтроки) КАК НомерСтроки,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
//	|	ТаблицаПродукция.Период КАК Период,
//	|	ТаблицаПродукция.Организация КАК Организация,
//	|	НЕОПРЕДЕЛЕНО КАК СценарийПланирования,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	НЕОПРЕДЕЛЕНО КАК КоррСтруктурнаяЕдиница,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.СчетУчета КАК СчетУчета,
//	|	ТаблицаПродукция.СчетУчетаПродукции КАК СчетУчетаПродукции,
//	|	НЕОПРЕДЕЛЕНО КАК КоррСчетУчета,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	НЕОПРЕДЕЛЕНО КАК КоррНоменклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	НЕОПРЕДЕЛЕНО КАК КоррХарактеристика,
//	|	ТаблицаПродукция.Партия КАК Партия,
//	|	НЕОПРЕДЕЛЕНО КАК КоррПартия,
//	|	ТаблицаПродукция.Спецификация КАК Спецификация,
//	|	НЕОПРЕДЕЛЕНО КАК КоррСпецификация,
//	|	ТаблицаПродукция.ЗаказПокупателя КАК ЗаказПокупателя,
//	|	ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка) КАК ЗаказНаПроизводство,
//	|	ТаблицаПродукция.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
//	|	ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка) КАК КоррЗаказНаПроизводство,
//	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
//	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
//	|	НЕОПРЕДЕЛЕНО КАК Содержание,
//	|	ТаблицаПродукция.СодержаниеПроводки КАК СодержаниеПроводки,
//	|	ЛОЖЬ КАК ЗатратыНаВыпуск,
//	|	СУММА(ТаблицаПродукция.Количество) КАК Количество,
//	|	СУММА(ТаблицаПродукция.СуммаБезНДС) КАК СуммаБезНДС,
//	|	СУММА(ТаблицаПродукция.Сумма) КАК Сумма,
//	|	ЛОЖЬ КАК ФиксированнаяСтоимость,
//	|	ТаблицаПродукция.ЗавершающийЭтап КАК ЗавершающийЭтап,
//	|	ТаблицаПродукция.ИспользуютсяЭтапы КАК ИспользуютсяЭтапы,
//	|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК ИдентификаторСтроки,
//	|	ЛОЖЬ КАК ПрослеживаемыйТовар
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.Организация,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.СчетУчета,
//	|	ТаблицаПродукция.СчетУчетаПродукции,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	ТаблицаПродукция.Спецификация,
//	|	ТаблицаПродукция.ЗаказПокупателя,
//	|	ТаблицаПродукция.КоррЗаказПокупателя,
//	|	ТаблицаПродукция.СодержаниеПроводки,
//	|	ТаблицаПродукция.ЗавершающийЭтап,
//	|	ТаблицаПродукция.ИспользуютсяЭтапы,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//	|	ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
//	|	ТаблицаПродукция.Период КАК Период,
//	|	&Организация КАК Организация,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.Ячейка КАК Ячейка,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.ОрдерныйСклад КАК ОрдерныйСклад,
//	|	ТаблицаПродукция.ОрдерныйСкладПродукции КАК ОрдерныйСкладПродукции,
//	|	ТаблицаПродукция.ЯчейкаПродукции КАК ЯчейкаПродукции,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	ТаблицаПродукция.Партия КАК Партия,
//	|	СУММА(ТаблицаПродукция.Количество) КАК Количество,
//	|	ТаблицаПродукция.ОрдерныйСкладКПоступлению КАК ОрдерныйСкладКПоступлению,
//	|	ТаблицаПродукция.ОрдерныйСкладКОтгрузке КАК ОрдерныйСкладКОтгрузке,
//	|	ТаблицаПродукция.ЯчейкаКПоступлению КАК ЯчейкаКПоступлению,
//	|	ТаблицаПродукция.ДокументОснование КАК ДокументОснование
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|ГДЕ
//	|	ТаблицаПродукция.Период < ТаблицаПродукция.ДатаОбновленияНаРелиз_1_2_1
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.Ячейка,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.ОрдерныйСклад,
//	|	ТаблицаПродукция.ОрдерныйСкладПродукции,
//	|	ТаблицаПродукция.ЯчейкаПродукции,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	ТаблицаПродукция.ОрдерныйСкладКПоступлению,
//	|	ТаблицаПродукция.ОрдерныйСкладКОтгрузке,
//	|	ТаблицаПродукция.ЯчейкаКПоступлению,
//	|	ТаблицаПродукция.ДокументОснование,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//	|	ТаблицаПродукция.Период,
//	|	&Организация,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.Ячейка,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.ОрдерныйСклад,
//	|	ТаблицаПродукция.ОрдерныйСкладПродукции,
//	|	ТаблицаПродукция.ЯчейкаПродукции,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	СУММА(ТаблицаПродукция.Количество),
//	|	ТаблицаПродукция.ОрдерныйСкладКПоступлению,
//	|	ТаблицаПродукция.ОрдерныйСкладКОтгрузке,
//	|	NULL,
//	|	NULL
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|ГДЕ
//	|	НЕ ТаблицаПродукция.ОрдерныйСклад
//	|	И ТаблицаПродукция.Период >= ТаблицаПродукция.ДатаОбновленияНаРелиз_1_2_1
//	|	И (ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	ИЛИ ВыполненныеЭтапы.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства))
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.Ячейка,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.ОрдерныйСклад,
//	|	ТаблицаПродукция.ОрдерныйСкладПродукции,
//	|	ТаблицаПродукция.ЯчейкаПродукции,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	ТаблицаПродукция.ОрдерныйСкладКПоступлению,
//	|	ТаблицаПродукция.ОрдерныйСкладКОтгрузке,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//	|	ТаблицаПродукция.Период,
//	|	&Организация,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.ЯчейкаПродукции,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.ОрдерныйСклад,
//	|	ТаблицаПродукция.ОрдерныйСкладПродукции,
//	|	ТаблицаПродукция.Ячейка,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	СУММА(ТаблицаПродукция.Количество),
//	|	ТаблицаПродукция.ОрдерныйСкладКПоступлению,
//	|	ТаблицаПродукция.ОрдерныйСкладКОтгрузке,
//	|	NULL,
//	|	NULL
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|ГДЕ
//	|	ТаблицаПродукция.ОрдерныйСклад
//	|	И НЕ (ТаблицаПродукция.ОрдерныйСкладПродукции
//	|	И ТаблицаПродукция.ОрдерныйСкладКПоступлению)
//	|	И ТаблицаПродукция.Период >= ТаблицаПродукция.ДатаОбновленияНаРелиз_1_2_1
//	|	И (ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	ИЛИ ВыполненныеЭтапы.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства))
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.ЯчейкаПродукции,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.ОрдерныйСклад,
//	|	ТаблицаПродукция.ОрдерныйСкладПродукции,
//	|	ТаблицаПродукция.Ячейка,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	ТаблицаПродукция.ОрдерныйСкладКПоступлению,
//	|	ТаблицаПродукция.ОрдерныйСкладКОтгрузке,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаПродукция.Период КАК Период,
//	|	&Организация КАК Организация,
//	|	ТаблицаПродукция.ЗаказПокупателя КАК ЗаказПокупателя,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	ТаблицаПродукция.Партия КАК Партия,
//	|	ТаблицаПродукция.Спецификация КАК Спецификация,
//	|	СУММА(ТаблицаПродукция.Количество) КАК Количество
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|ГДЕ
//	|	ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	ИЛИ ВыполненныеЭтапы.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства)
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.ЗаказПокупателя,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	ТаблицаПродукция.Спецификация
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	|	ТаблицаПродукция.Период КАК Период,
//	|	&Организация КАК Организация,
//	|	ВЫБОР
//	|		КОГДА ТаблицаПродукция.УчетПотребностиПоСкладам
//	|			ТОГДА ТаблицаПродукция.СтруктурнаяЕдиницаПродукции
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
//	|	КОНЕЦ КАК Склад,
//	|	ТаблицаПродукция.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	СУММА(ТаблицаПродукция.Количество) КАК Количество
//	|ПОМЕСТИТЬ ВременнаяТаблицаЗаказыНаПроизводство
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|ГДЕ
//	|	ТаблицаПродукция.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
//	|	И (ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	ИЛИ ВыполненныеЭтапы.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства))
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Период,
//	|	ВЫБОР
//	|		КОГДА ТаблицаПродукция.УчетПотребностиПоСкладам
//	|			ТОГДА ТаблицаПродукция.СтруктурнаяЕдиницаПродукции
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
//	|	КОНЕЦ,
//	|	ТаблицаПродукция.ЗаказНаПроизводство,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	|	ТаблицаПродукция.Период КАК Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.Организация КАК Организация,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	ТаблицаПродукция.Партия КАК Партия,
//	|	СУММА(ТаблицаПродукция.Количество) КАК Количество,
//	|	ТаблицаПродукция.ДокументОснование КАК ДокументОснование,
//	|	ТаблицаПродукция.ЯчейкаКПоступлению КАК Ячейка
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|ГДЕ
//	|	ТаблицаПродукция.ОрдерныйСклад
//	|	И ТаблицаПродукция.Период >= ТаблицаПродукция.ДатаОбновленияНаРелиз_1_2_1
//	|	И (ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	ИЛИ ВыполненныеЭтапы.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства))
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.Организация,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	ТаблицаПродукция.ДокументОснование,
//	|	ТаблицаПродукция.ЯчейкаКПоступлению,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.Организация,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	СУММА(ТаблицаПродукция.Количество),
//	|	ТаблицаПродукция.ДокументОснование,
//	|	ТаблицаПродукция.ЯчейкаКПоступлению
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|ГДЕ
//	|	ТаблицаПродукция.ОрдерныйСкладПродукции
//	|	И ТаблицаПродукция.СтруктурнаяЕдиницаПродукции <> ТаблицаПродукция.СтруктурнаяЕдиница
//	|	И (ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	ИЛИ ВыполненныеЭтапы.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства))
//	|	И ТаблицаПродукция.ОрдерныйСкладКПоступлению
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.Организация,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	ТаблицаПродукция.ДокументОснование,
//	|	ТаблицаПродукция.ЯчейкаКПоступлению,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.Организация,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	СУММА(ТаблицаПродукция.Количество),
//	|	ТаблицаПродукция.ДокументОснование,
//	|	ТаблицаПродукция.ЯчейкаКПоступлению
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|ГДЕ
//	|	ТаблицаПродукция.ОрдерныйСкладПродукции
//	|	И ТаблицаПродукция.ОрдерныйСкладКПоступлению
//	|	И ТаблицаПродукция.Период < ТаблицаПродукция.ДатаОбновленияНаРелиз_1_2_1
//	|	И ТаблицаПродукция.СтруктурнаяЕдиницаПродукции <> ТаблицаПродукция.СтруктурнаяЕдиница
//	|	И (ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	ИЛИ ВыполненныеЭтапы.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства))
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции,
//	|	ТаблицаПродукция.Организация,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	ТаблицаПродукция.ДокументОснование,
//	|	ТаблицаПродукция.ЯчейкаКПоступлению,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
//	|	ТаблицаПродукция.Период КАК Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.Организация КАК Организация,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	ТаблицаПродукция.Партия КАК Партия,
//	|	СУММА(ТаблицаПродукция.Количество) КАК Количество,
//	|	ТаблицаПродукция.ДокументОснованиеЗапасы КАК ДокументОснование,
//	|	ТаблицаПродукция.ЯчейкаКПоступлению КАК Ячейка
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|ГДЕ
//	|	ТаблицаПродукция.ОрдерныйСклад
//	|	И ТаблицаПродукция.Период >= ТаблицаПродукция.ДатаОбновленияНаРелиз_1_2_1
//	|	И ТаблицаПродукция.СтруктурнаяЕдиницаПродукции <> ТаблицаПродукция.СтруктурнаяЕдиница
//	|	И (ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	ИЛИ ВыполненныеЭтапы.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства))
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Период,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.Организация,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Партия,
//	|	ТаблицаПродукция.ЯчейкаКПоступлению,
//	|	ТаблицаПродукция.ДокументОснованиеЗапасы,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаПродукция.Период КАК Период,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
//	|	ТаблицаПродукция.Период КАК ДатаСобытия,
//	|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийНоменклатуры.Приход) КАК Операция,
//	|	ТаблицаСерииНоменклатурыПродукция.Серия КАК Серия,
//	|	&Организация КАК Организация,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	ТаблицаПродукция.Партия КАК Партия,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.ЯчейкаПродукции КАК Ячейка,
//	|	ВЫБОР
//	|		КОГДА ТаблицаСерииНоменклатурыПродукция.Количество = 0
//	|			ТОГДА 1
//	|		ИНАЧЕ ТаблицаСерииНоменклатурыПродукция.Количество
//	|	КОНЕЦ КАК Количество,
//	|	ВЫБОР
//	|		КОГДА ТаблицаПродукция.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикаУчетаСерий.ПустаяСсылка)
//	|			ТОГДА &ОстаткиСерийНоменклатуры
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА
//	|				ТаблицаПродукция.ПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
//	|				ТОГДА ИСТИНА
//	|			ИНАЧЕ ЛОЖЬ
//	|		КОНЕЦ
//	|	КОНЕЦ КАК ОстаткиСерийНоменклатуры
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаЗапасов.СерииНоменклатурыПродукция КАК ТаблицаСерииНоменклатурыПродукция
//	|		ПО ТаблицаПродукция.Ссылка = ТаблицаСерииНоменклатурыПродукция.Ссылка
//	|		И ТаблицаПродукция.КлючСвязи = ТаблицаСерииНоменклатурыПродукция.КлючСвязи
//	|ГДЕ
//	|	&ИспользоватьСерииНоменклатуры
//	|	И ТаблицаСерииНоменклатурыПродукция.Ссылка = &Ссылка
//	|	И НЕ (ТаблицаПродукция.ОрдерныйСкладПродукции
//	|	И ТаблицаПродукция.ОрдерныйСкладКПоступлению
//	|	И
//	|		(ТаблицаПродукция.СтруктурнаяЕдиницаПродукции.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.ПоСкладуВЦелом)
//	|	ИЛИ
//	|		ТаблицаПродукция.СтруктурнаяЕдиницаПродукции.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам)))
//	|	И (ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	ИЛИ ВыполненныеЭтапы.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаЗапасы.Ссылка.Дата,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
//	|	ТаблицаЗапасы.Ссылка.Дата,
//	|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийНоменклатуры.Расход),
//	|	ТаблицаСерииНоменклатуры.Серия,
//	|	&Организация,
//	|	ТаблицаЗапасы.Номенклатура,
//	|	ТаблицаЗапасы.Характеристика,
//	|	ТаблицаЗапасы.Партия,
//	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
//	|	ТаблицаЗапасы.Ячейка,
//	|	ВЫБОР
//	|		КОГДА ТаблицаСерииНоменклатуры.Количество = 0
//	|			ТОГДА 1
//	|		ИНАЧЕ ТаблицаСерииНоменклатуры.Количество
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL
//	|			ТОГДА ВЫБОР
//	|				КОГДА ТаблицаЗапасы.Номенклатура.ИспользоватьСерииИзКатегории
//	|				И
//	|					ТаблицаЗапасы.Номенклатура.КатегорияНоменклатуры.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикаУчетаСерий.ПустаяСсылка)
//	|					ТОГДА &ОстаткиСерийНоменклатуры
//	|				КОГДА ТаблицаЗапасы.Номенклатура.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикаУчетаСерий.ПустаяСсылка)
//	|					ТОГДА &ОстаткиСерийНоменклатуры
//	|				ИНАЧЕ ВЫБОР
//	|					КОГДА ТаблицаЗапасы.Номенклатура.ИспользоватьСерииИзКатегории
//	|					И
//	|						ТаблицаЗапасы.Номенклатура.КатегорияНоменклатуры.ПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
//	|						ТОГДА ИСТИНА
//	|					КОГДА
//	|						ТаблицаЗапасы.Номенклатура.ПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
//	|						ТОГДА ИСТИНА
//	|					ИНАЧЕ ЛОЖЬ
//	|				КОНЕЦ
//	|			КОНЕЦ
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикаУчетаСерий.ПустаяСсылка)
//	|				ТОГДА &ОстаткиСерийНоменклатуры
//	|			ИНАЧЕ ВЫБОР
//	|				КОГДА
//	|					ПолитикиУчетаСерий.ПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
//	|					ТОГДА ИСТИНА
//	|				ИНАЧЕ ЛОЖЬ
//	|			КОНЕЦ
//	|		КОНЕЦ
//	|	КОНЕЦ
//	|ИЗ
//	|	Документ.СборкаЗапасов.Запасы КАК ТаблицаЗапасы
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаЗапасов.СерииНоменклатуры КАК ТаблицаСерииНоменклатуры
//	|		ПО ТаблицаЗапасы.Ссылка = ТаблицаСерииНоменклатуры.Ссылка
//	|		И ТаблицаЗапасы.КлючСвязи = ТаблицаСерииНоменклатуры.КлючСвязи
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
//	|		ПО ВЫБОР
//	|			КОГДА ТаблицаЗапасы.Номенклатура.ИспользоватьСерииИзКатегории
//	|				ТОГДА ТаблицаЗапасы.Номенклатура.КатегорияНоменклатуры = ПолитикиУчетаСерий.Владелец
//	|			ИНАЧЕ ТаблицаЗапасы.Номенклатура = ПолитикиУчетаСерий.Владелец
//	|		КОНЕЦ
//	|		И ТаблицаЗапасы.СтруктурнаяЕдиница = ПолитикиУчетаСерий.СтруктурнаяЕдиница
//	|		И &Организация = ПолитикиУчетаСерий.Организация
//	|ГДЕ
//	|	&ИспользоватьСерииНоменклатуры
//	|	И ТаблицаСерииНоменклатуры.Ссылка = &Ссылка
//	|	И НЕ (ТаблицаЗапасы.СтруктурнаяЕдиница.ОрдерныйСклад
//	|	И ТаблицаЗапасы.СтруктурнаяЕдиница.ИспользоватьОрдернуюСхемуПриОтгрузке
//	|	И
//	|		(ТаблицаЗапасы.СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.ПоСкладуВЦелом)
//	|	ИЛИ
//	|		ТаблицаЗапасы.СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам)))
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаПродукция.Период КАК Период,
//	|	&Организация КАК Организация,
//	|	ВЫБОР
//	|		КОГДА ТаблицаПродукция.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|			ТОГДА ТаблицаПродукция.ЗаказНаПроизводство
//	|		ИНАЧЕ ТаблицаПродукция.ЗаказПокупателя
//	|	КОНЕЦ КАК Заказ,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	ТаблицаПродукция.Спецификация КАК Спецификация,
//	|	ТаблицаПродукция.Партия КАК Партия,
//	|	ВыполненныеЭтапы.Этап КАК Этап,
//	|	0 КАК КоличествоПлан,
//	|	ТаблицаПродукция.Количество КАК КоличествоФакт,
//	|	ТаблицаПродукция.ПодразделениеЗавершающегоЭтапа КАК СтруктурнаяЕдиница
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|ГДЕ
//	|	&ИспользоватьЭтапыПроизводства
//	|	И &ИспользоватьРезервирование
//	|	И ТаблицаПродукция.Спецификация <> ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка)
//	|	И ТаблицаПродукция.ИспользуютсяЭтапы
//	|	И НЕ ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	И (ТаблицаПродукция.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|	ИЛИ ТаблицаПродукция.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаПродукция.Период,
//	|	&Организация,
//	|	ВЫБОР
//	|		КОГДА ТаблицаПродукция.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|			ТОГДА ТаблицаПродукция.ЗаказНаПроизводство
//	|		ИНАЧЕ ТаблицаПродукция.ЗаказПокупателя
//	|	КОНЕЦ,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Спецификация,
//	|	ТаблицаПродукция.Партия,
//	|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства),
//	|	0,
//	|	ТаблицаПродукция.Количество,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|ГДЕ
//	|	&ИспользоватьЭтапыПроизводства
//	|	И &ИспользоватьРезервирование
//	|	И ТаблицаПродукция.Спецификация <> ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка)
//	|	И НЕ ТаблицаПродукция.ИспользуютсяЭтапы
//	|	И (ТаблицаПродукция.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|	ИЛИ ТаблицаПродукция.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка))
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Шапка.Дата КАК Дата,
//	|	Шапка.Ссылка КАК Ссылка,
//	|	НЕОПРЕДЕЛЕНО КАК КорректируемыйДокумент
//	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
//	|ИЗ
//	|	Документ.СборкаЗапасов КАК Шапка
//	|ГДЕ
//	|	Шапка.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СборкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
//	|	СборкаЗапасовЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
//	|	СборкаЗапасовЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьХарактеристики
//	|			ТОГДА СборкаЗапасовЗапасы.Характеристика
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	|	КОНЕЦ КАК Характеристика,
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьПартии
//	|			ТОГДА СборкаЗапасовЗапасы.Партия
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
//	|	КОНЕЦ КАК Партия,
//	|	NULL КАК КорректируемыйДокумент,
//	|	СборкаЗапасовЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
//	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПрослеживаемость
//	|ИЗ
//	|	Документ.СборкаЗапасов.Запасы КАК СборкаЗапасовЗапасы
//	|ГДЕ
//	|	СборкаЗапасовЗапасы.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	|	СведенияПрослеживаемости.НомерСтроки КАК НомерСтроки,
//	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
//	|	СведенияПрослеживаемости.Количество КАК Количество,
//	|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
//	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
//	|	СведенияПрослеживаемости.Номенклатура КАК Комплектующие,
//	|	СведенияПрослеживаемости.Сумма КАК Сумма,
//	|	СведенияПрослеживаемости.СтранаПроисхождения КАК СтранаПроисхождения
//	|ПОМЕСТИТЬ ВременнаяТаблицаСведенияПрослеживаемости
//	|ИЗ
//	|	Документ.СборкаЗапасов.СведенияПрослеживаемости КАК СведенияПрослеживаемости
//	|ГДЕ
//	|	СведенияПрослеживаемости.Ссылка = &Ссылка
//	|	И &ВестиУчетПрослеживаемыхТоваров
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СборкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
//	|	СборкаЗапасовЗапасы.Характеристика КАК Характеристика,
//	|	СборкаЗапасовЗапасы.Партия КАК Партия,
//	|	СборкаЗапасовЗапасы.Количество КАК КоличествоДокумент,
//	|	СборкаЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДокумент,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(СборкаЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
//	|			ТОГДА СборкаЗапасовЗапасы.Количество * СборкаЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
//	|		ИНАЧЕ СборкаЗапасовЗапасы.Количество
//	|	КОНЕЦ КАК ЧИСЛО(15, 3)) КАК Количество
//	|ПОМЕСТИТЬ ЗапасыПроверкаПересчета
//	|ИЗ
//	|	Документ.СборкаЗапасов.Запасы КАК СборкаЗапасовЗапасы
//	|ГДЕ
//	|	СборкаЗапасовЗапасы.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаПродукция.Период КАК Период,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	|	ТаблицаПродукция.Период КАК ДатаСобытия,
//	|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийНоменклатуры.Приход) КАК Операция,
//	|	ТаблицаСерииНоменклатурыПродукция.Серия КАК Серия,
//	|	&Организация КАК Организация,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	ТаблицаПродукция.Партия КАК Партия,
//	|	ТаблицаПродукция.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиница,
//	|	ТаблицаПродукция.ЯчейкаПродукции КАК Ячейка,
//	|	ВЫБОР
//	|		КОГДА ТаблицаСерииНоменклатурыПродукция.Количество = 0
//	|			ТОГДА 1
//	|		ИНАЧЕ ТаблицаСерииНоменклатурыПродукция.Количество
//	|	КОНЕЦ КАК Количество,
//	|	ВЫБОР
//	|		КОГДА ТаблицаПродукция.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикаУчетаСерий.ПустаяСсылка)
//	|			ТОГДА &ОстаткиСерийНоменклатуры
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА
//	|				ТаблицаПродукция.ПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
//	|				ТОГДА ИСТИНА
//	|			ИНАЧЕ ЛОЖЬ
//	|		КОНЕЦ
//	|	КОНЕЦ КАК ОстаткиСерийНоменклатуры,
//	|	ТаблицаПродукция.ДокументОснование КАК ДокументОснование
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВыполненныеЭтапы КАК ВыполненныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВыполненныеЭтапы.КлючСвязи
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаЗапасов.СерииНоменклатурыПродукция КАК ТаблицаСерииНоменклатурыПродукция
//	|		ПО ТаблицаПродукция.Ссылка = ТаблицаСерииНоменклатурыПродукция.Ссылка
//	|		И ТаблицаПродукция.КлючСвязи = ТаблицаСерииНоменклатурыПродукция.КлючСвязи
//	|ГДЕ
//	|	&ИспользоватьСерииНоменклатуры
//	|	И ТаблицаСерииНоменклатурыПродукция.Ссылка = &Ссылка
//	|	И ТаблицаПродукция.ОрдерныйСкладПродукции
//	|	И (ВыполненныеЭтапы.Этап ЕСТЬ NULL
//	|	ИЛИ ВыполненныеЭтапы.Этап = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства))
//	|	И ТаблицаПродукция.ОрдерныйСкладКПоступлению
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаЗапасы.Ссылка.Дата КАК Период,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
//	|	ТаблицаЗапасы.Ссылка.Дата КАК ДатаСобытия,
//	|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийНоменклатуры.Расход) КАК Операция,
//	|	ТаблицаСерииНоменклатуры.Серия КАК Серия,
//	|	&Организация КАК Организация,
//	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
//	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
//	|	ТаблицаЗапасы.Партия КАК Партия,
//	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ТаблицаЗапасы.Ячейка КАК Ячейка,
//	|	ВЫБОР
//	|		КОГДА ТаблицаСерииНоменклатуры.Количество = 0
//	|			ТОГДА 1
//	|		ИНАЧЕ ТаблицаСерииНоменклатуры.Количество
//	|	КОНЕЦ КАК Количество,
//	|	ВЫБОР
//	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL
//	|			ТОГДА ВЫБОР
//	|				КОГДА ТаблицаЗапасы.Номенклатура.ИспользоватьСерииИзКатегории
//	|				И ТаблицаЗапасы.Номенклатура.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикаУчетаСерий.ПустаяСсылка)
//	|					ТОГДА &ОстаткиСерийНоменклатуры
//	|				КОГДА ТаблицаЗапасы.Номенклатура.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикаУчетаСерий.ПустаяСсылка)
//	|					ТОГДА &ОстаткиСерийНоменклатуры
//	|				ИНАЧЕ ВЫБОР
//	|					КОГДА ТаблицаЗапасы.Номенклатура.ИспользоватьСерииИзКатегории
//	|					И
//	|						ТаблицаЗапасы.Номенклатура.КатегорияНоменклатуры.ПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
//	|						ТОГДА ИСТИНА
//	|					КОГДА
//	|						ТаблицаЗапасы.Номенклатура.ПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
//	|						ТОГДА ИСТИНА
//	|					ИНАЧЕ ЛОЖЬ
//	|				КОНЕЦ
//	|			КОНЕЦ
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикаУчетаСерий.ПустаяСсылка)
//	|				ТОГДА &ОстаткиСерийНоменклатуры
//	|			ИНАЧЕ ВЫБОР
//	|				КОГДА
//	|					ПолитикиУчетаСерий.ПолитикаУчетаСерий.ТипПолитики = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
//	|					ТОГДА ИСТИНА
//	|				ИНАЧЕ ЛОЖЬ
//	|			КОНЕЦ
//	|		КОНЕЦ
//	|	КОНЕЦ КАК ОстаткиСерийНоменклатуры,
//	|	ВЫБОР
//	|		КОГДА
//	|			ТаблицаЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам)
//	|			ТОГДА ТаблицаЗапасы.Ссылка
//	|		КОГДА
//	|			ТаблицаЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоСкладскимОрдерам)
//	|			ТОГДА ТаблицаЗапасы.Ссылка.СкладскойОрдерЗапасы
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК ДокументОснование
//	|ИЗ
//	|	Документ.СборкаЗапасов.Запасы КАК ТаблицаЗапасы
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаЗапасов.СерииНоменклатуры КАК ТаблицаСерииНоменклатуры
//	|		ПО ТаблицаЗапасы.Ссылка = ТаблицаСерииНоменклатуры.Ссылка
//	|		И ТаблицаЗапасы.КлючСвязи = ТаблицаСерииНоменклатуры.КлючСвязи
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
//	|		ПО ВЫБОР
//	|			КОГДА ТаблицаЗапасы.Номенклатура.ИспользоватьСерииИзКатегории
//	|				ТОГДА ТаблицаЗапасы.Номенклатура.КатегорияНоменклатуры = ПолитикиУчетаСерий.Владелец
//	|			ИНАЧЕ ТаблицаЗапасы.Номенклатура = ПолитикиУчетаСерий.Владелец
//	|		КОНЕЦ
//	|		И ТаблицаЗапасы.СтруктурнаяЕдиница = ПолитикиУчетаСерий.СтруктурнаяЕдиница
//	|		И &Организация = ПолитикиУчетаСерий.Организация
//	|ГДЕ
//	|	&ИспользоватьСерииНоменклатуры
//	|	И ТаблицаСерииНоменклатуры.Ссылка = &Ссылка
//	|	И ТаблицаЗапасы.СтруктурнаяЕдиница.ОрдерныйСклад
//	|	И ТаблицаЗапасы.СтруктурнаяЕдиница.ИспользоватьОрдернуюСхемуПриОтгрузке
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СборкаЗапасовБракованныеЭтапы.КлючСвязи КАК КлючСвязи,
//	|	СборкаЗапасовБракованныеЭтапы.Этап КАК Этап,
//	|	СборкаЗапасовБракованныеЭтапы.Количество
//	|ПОМЕСТИТЬ ВременнаяТаблицаБракованныеЭтапы
//	|ИЗ
//	|	Документ.СборкаЗапасов.БракованныеЭтапы КАК СборкаЗапасовБракованныеЭтапы
//	|ГДЕ
//	|	&ИспользоватьЭтапыПроизводства
//	|	И СборкаЗапасовБракованныеЭтапы.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаПродукция.Период КАК Период,
//	|	&Организация КАК Организация,
//	|	ВЫБОР
//	|		КОГДА ТаблицаПродукция.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|			ТОГДА ТаблицаПродукция.ЗаказНаПроизводство
//	|		ИНАЧЕ ТаблицаПродукция.ЗаказПокупателя
//	|	КОНЕЦ КАК Заказ,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	ТаблицаПродукция.Спецификация КАК Спецификация,
//	|	ТаблицаПродукция.Партия КАК Партия,
//	|	ВременнаяТаблицаБракованныеЭтапы.Этап КАК Этап,
//	|	0 КАК КоличествоПлан,
//	|	-ВременнаяТаблицаБракованныеЭтапы.Количество КАК КоличествоФакт,
//	|	ТаблицаПродукция.ПодразделениеЗавершающегоЭтапа КАК СтруктурнаяЕдиница
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаБракованныеЭтапы КАК ВременнаяТаблицаБракованныеЭтапы
//	|		ПО ТаблицаПродукция.КлючСвязи = ВременнаяТаблицаБракованныеЭтапы.КлючСвязи
//	|ГДЕ
//	|	&ИспользоватьЭтапыПроизводства
//	|	И &ИспользоватьРезервирование
//	|	И ТаблицаПродукция.Спецификация <> ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка)
//	|	И ТаблицаПродукция.ИспользуютсяЭтапы
//	|	И НЕ ВременнаяТаблицаБракованныеЭтапы.Этап ЕСТЬ NULL
//	|	И (ТаблицаПродукция.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|	ИЛИ ТаблицаПродукция.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаПродукция.Период,
//	|	&Организация,
//	|	ВЫБОР
//	|		КОГДА ТаблицаПродукция.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|			ТОГДА ТаблицаПродукция.ЗаказНаПроизводство
//	|		ИНАЧЕ ТаблицаПродукция.ЗаказПокупателя
//	|	КОНЕЦ,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.Спецификация,
//	|	ТаблицаПродукция.Партия,
//	|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ЗавершениеПроизводства),
//	|	0,
//	|	0,
//	|	ТаблицаПродукция.СтруктурнаяЕдиница
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|ГДЕ
//	|	&ИспользоватьЭтапыПроизводства
//	|	И &ИспользоватьРезервирование
//	|	И ТаблицаПродукция.Спецификация <> ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка)
//	|	И НЕ ТаблицаПродукция.ИспользуютсяЭтапы
//	|	И (ТаблицаПродукция.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|	ИЛИ ТаблицаПродукция.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка))";
//	
//КонецФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
//Процедура СформироватьТаблицаРазмещениеЗаказовСборка(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
//	
//	// Установка исключительной блокировки контролируемых размещений заказов.
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ТаблицаПродукция.Организация КАК Организация,
//	|	ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|	ТаблицаПродукция.Характеристика КАК Характеристика,
//	|	ТаблицаПродукция.ИсточникОбеспечения КАК ИсточникОбеспечения
//	|ИЗ
//	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|ГДЕ
//	|	ТаблицаПродукция.ИсточникОбеспечения <> НЕОПРЕДЕЛЕНО
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаПродукция.Организация,
//	|	ТаблицаПродукция.Номенклатура,
//	|	ТаблицаПродукция.Характеристика,
//	|	ТаблицаПродукция.ИсточникОбеспечения";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Блокировка = Новый БлокировкаДанных;
//	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РазмещениеЗаказов");
//	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
//	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
//	
//	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
//		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
//	КонецЦикла;
//	
//	Блокировка.Заблокировать();
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	РазмещениеЗаказовОстатки.Организация КАК Организация,
//	|	РазмещениеЗаказовОстатки.Номенклатура КАК Номенклатура,
//	|	РазмещениеЗаказовОстатки.Характеристика КАК Характеристика,
//	|	РазмещениеЗаказовОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
//	|	РазмещениеЗаказовОстатки.ИсточникОбеспечения КАК ИсточникОбеспечения,
//	|	РазмещениеЗаказовОстатки.КоличествоОстаток КАК Количество
//	|ПОМЕСТИТЬ РазмещениеЗаказовОстатки
//	|ИЗ
//	|	РегистрНакопления.РазмещениеЗаказов.Остатки(&МоментКонтроля, (Организация, Номенклатура, Характеристика,
//	|		ИсточникОбеспечения) В
//	|		(ВЫБРАТЬ
//	|			ТаблицаПродукция.Организация КАК Организация,
//	|			ТаблицаПродукция.Номенклатура КАК Номенклатура,
//	|			ТаблицаПродукция.Характеристика КАК Характеристика,
//	|			ТаблицаПродукция.ИсточникОбеспечения КАК ИсточникОбеспечения
//	|		ИЗ
//	|			ВременнаяТаблицаПродукция КАК ТаблицаПродукция
//	|		ГДЕ
//	|			ТаблицаПродукция.ИсточникОбеспечения <> НЕОПРЕДЕЛЕНО)) КАК РазмещениеЗаказовОстатки
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДвиженияДокументаРазмещениеЗаказов.Организация,
//	|	ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
//	|	ДвиженияДокументаРазмещениеЗаказов.Характеристика,
//	|	ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя,
//	|	ДвиженияДокументаРазмещениеЗаказов.ИсточникОбеспечения,
//	|	ВЫБОР
//	|		КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|			ТОГДА ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
//	|		ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
//	|	КОНЕЦ
//	|ИЗ
//	|	РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
//	|ГДЕ
//	|	ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
//	|	И ДвиженияДокументаРазмещениеЗаказов.Период <= &ПериодКонтроля
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РазмещениеЗаказовОстатки.Организация,
//	|	РазмещениеЗаказовОстатки.Номенклатура,
//	|	РазмещениеЗаказовОстатки.Характеристика,
//	|	РазмещениеЗаказовОстатки.ЗаказПокупателя,
//	|	РазмещениеЗаказовОстатки.ИсточникОбеспечения,
//	|	СУММА(РазмещениеЗаказовОстатки.Количество) КАК Количество,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период
//	|ИЗ
//	|	РазмещениеЗаказовОстатки КАК РазмещениеЗаказовОстатки
//	|СГРУППИРОВАТЬ ПО
//	|	РазмещениеЗаказовОстатки.Организация,
//	|	РазмещениеЗаказовОстатки.Номенклатура,
//	|	РазмещениеЗаказовОстатки.Характеристика,
//	|	РазмещениеЗаказовОстатки.ЗаказПокупателя,
//	|	РазмещениеЗаказовОстатки.ИсточникОбеспечения,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
//	
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСборкаЗапасов);
//	Запрос.УстановитьПараметр("МоментКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментКонтроля);
//	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.ПериодКонтроля);
//	
//	ТаблицаРазмещениеЗаказовОстатки = Запрос.Выполнить().Выгрузить();
//	ТаблицаРазмещениеЗаказов = ТаблицаРазмещениеЗаказовОстатки.СкопироватьКолонки();
//	
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРазмещениеЗаказов", ТаблицаРазмещениеЗаказов);
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРазмещениеЗаказовОстатки",  ТаблицаРазмещениеЗаказовОстатки);
//	
//КонецПроцедуры // СформироватьТаблицаРазмещениеЗаказовСборка()

//Процедура ВыполнитьКонтроль(ДокументСсылкаСборкаЗапасов, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
//	
//	Если ПроведениеДокументовУНФ.КонтрольОстатковВыключен() Тогда
//		Возврат;
//	КонецЕсли;

//	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
//	
//	// Если временные таблицы "ДвиженияЗаказыНаПроизводствоИзменение", 
//	// "ДвиженияРазмещениеЗаказовИзменение", "ДвиженияЗапасыИзменение"
//	// содержат записи, необходимо выполнить контроль реализации товаров.
//	
//	Если СтруктураВременныеТаблицы.ДвиженияЗаказыНаПроизводствоИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияРазмещениеЗаказовИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыВРазрезеГТДИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыПринятыеИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияСерииНоменклатурыИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияПрослеживаемыеТоварыИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыКПоступлениюНаСкладыИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияСерииНоменклатурыКПоступлениюИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыКРасходуСоСкладовИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияРезервыТоваровОрганизацийИзменение
//		ИЛИ СтруктураВременныеТаблицы.ДвиженияСерииНоменклатурыКРасходуИзменение Тогда
//		
//		
//		Запрос = Новый Запрос(
//		"ВЫБРАТЬ
//		|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Организация) КАК ОрганизацияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Номенклатура) КАК НоменклатураПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Характеристика) КАК ХарактеристикаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Партия) КАК ПартияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Ячейка) КАК ЯчейкаПредставление,
//		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
//		|	ЕСТЬNULL(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение, 0) +
//		|		ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыТоваровОрганизацийОстатки.КоличествоОстаток,
//		|		0) КАК ОстатокЗапасыНаСкладах,
//		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыТоваровОрганизацийОстатки.КоличествоОстаток,
//		|		0) КАК КоличествоОстатокЗапасыНаСкладах
//		|ИЗ
//		|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
//		|				&МоментКонтроля, Организация В (&МассивОрганизаций) И 
//		|				(СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, Ячейка) В
//		|					(ВЫБРАТЬ
//		|						ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//		|						ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
//		|						ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
//		|						ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
//		|						ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК Ячейка
//		|					ИЗ
//		|						ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение)) КАК ЗапасыНаСкладахОстатки
//		|		ПО ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
//		|			И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
//		|			И ДвиженияЗапасыНаСкладахИзменение.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
//		|			И ДвиженияЗапасыНаСкладахИзменение.Партия = ЗапасыНаСкладахОстатки.Партия
//		|			И ДвиженияЗапасыНаСкладахИзменение.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТоваровОрганизаций.Остатки(&МоментКонтроля, Организация В
//		|		(&МассивОрганизаций)
//		|		И (СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, Ячейка) В
//		|			(ВЫБРАТЬ
//		|				ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//		|				ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
//		|				ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
//		|				ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
//		|				ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК Ячейка
//		|			ИЗ
//		|				ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение)) КАК РезервыТоваровОрганизацийОстатки
//		|		ПО (&ПередачаТоваровМеждуОрганизациями)
//		|		И ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = РезервыТоваровОрганизацийОстатки.СтруктурнаяЕдиница
//		|		И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = РезервыТоваровОрганизацийОстатки.Номенклатура
//		|		И ДвиженияЗапасыНаСкладахИзменение.Характеристика = РезервыТоваровОрганизацийОстатки.Характеристика
//		|		И ДвиженияЗапасыНаСкладахИзменение.Партия = РезервыТоваровОрганизацийОстатки.Партия
//		|		И ДвиженияЗапасыНаСкладахИзменение.Ячейка = РезервыТоваровОрганизацийОстатки.Ячейка
//		|ГДЕ
//		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыТоваровОрганизацийОстатки.КоличествоОстаток,
//		|		0) < 0
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Организация) КАК ОрганизацияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.СчетУчета) КАК СчетУчетаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Номенклатура) КАК НоменклатураПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Характеристика) КАК ХарактеристикаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Партия) КАК ПартияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
//		|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
//		|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
//		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
//		|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
//		|ИЗ
//		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(&МоментКонтроля, Организация В (&МассивОрганизаций)) КАК ЗапасыОстатки
//		|		ПО ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
//		|			И ДвиженияЗапасыИзменение.СчетУчета = ЗапасыОстатки.СчетУчета
//		|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
//		|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
//		|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
//		|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
//		|			И ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияЗапасыПринятыеИзменение.НомерСтроки КАК НомерСтроки,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПринятыеИзменение.Организация) КАК ОрганизацияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПринятыеИзменение.ТипПриемаПередачи) КАК ТипПриемаПередачиПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПринятыеИзменение.Номенклатура) КАК НоменклатураПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПринятыеИзменение.Характеристика) КАК ХарактеристикаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПринятыеИзменение.Партия) КАК ПартияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПринятыеИзменение.Контрагент) КАК КонтрагентПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПринятыеИзменение.Заказ) КАК ЗаказПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыПринятыеОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
//		|	ЕСТЬNULL(ДвиженияЗапасыПринятыеИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыПринятыеОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыПринятые,
//		|	ЕСТЬNULL(ЗапасыПринятыеОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыПринятые,
//		|	0 КАК СуммаРасчетовОстатокЗапасыПринятые
//		|ИЗ
//		|	ДвиженияЗапасыПринятыеИзменение КАК ДвиженияЗапасыПринятыеИзменение
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИАгентскиеУслугиПринятые.Остатки(
//		|				&МоментКонтроля,
//		|				(Организация, ТипПриемаПередачи, Номенклатура, Характеристика, Партия, Заказ) В
//		|					(ВЫБРАТЬ
//		|						ДвиженияЗапасыПринятыеИзменение.Организация КАК Организация,
//		|						ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ОтчетПоПереработке) КАК ТипПриемаПередачи,
//		|						ДвиженияЗапасыПринятыеИзменение.Номенклатура КАК Номенклатура,
//		|						ДвиженияЗапасыПринятыеИзменение.Характеристика КАК Характеристика,
//		|						ДвиженияЗапасыПринятыеИзменение.Партия КАК Партия,
//		|						НЕОПРЕДЕЛЕНО КАК Заказ
//		|					ИЗ
//		|						ДвиженияЗапасыПринятыеИзменение КАК ДвиженияЗапасыПринятыеИзменение)) КАК ЗапасыПринятыеОстатки
//		|		ПО ДвиженияЗапасыПринятыеИзменение.Организация = ЗапасыПринятыеОстатки.Организация
//		|			И ДвиженияЗапасыПринятыеИзменение.ТипПриемаПередачи = ЗапасыПринятыеОстатки.ТипПриемаПередачи
//		|			И ДвиженияЗапасыПринятыеИзменение.Номенклатура = ЗапасыПринятыеОстатки.Номенклатура
//		|			И ДвиженияЗапасыПринятыеИзменение.Характеристика = ЗапасыПринятыеОстатки.Характеристика
//		|			И ДвиженияЗапасыПринятыеИзменение.Партия = ЗапасыПринятыеОстатки.Партия
//		|			И ДвиженияЗапасыПринятыеИзменение.Контрагент = ЗапасыПринятыеОстатки.Контрагент
//		|			И ДвиженияЗапасыПринятыеИзменение.Заказ = ЗапасыПринятыеОстатки.Заказ
//		|ГДЕ
//		|	ЕСТЬNULL(ЗапасыПринятыеОстатки.КоличествоОстаток, 0) < 0
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияЗаказыНаПроизводствоИзменение.НомерСтроки КАК НомерСтроки,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗаказыНаПроизводствоИзменение.Организация) КАК ОрганизацияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗаказыНаПроизводствоИзменение.Склад) КАК СкладПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗаказыНаПроизводствоИзменение.ЗаказНаПроизводство) КАК ЗаказНаПроизводствоПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗаказыНаПроизводствоИзменение.Номенклатура) КАК НоменклатураПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗаказыНаПроизводствоИзменение.Характеристика) КАК ХарактеристикаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗаказыНаПроизводствоОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
//		|	ЕСТЬNULL(ДвиженияЗаказыНаПроизводствоИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗаказыНаПроизводствоОстатки.КоличествоОстаток, 0) КАК ОстатокЗаказыНаПроизводство,
//		|	ЕСТЬNULL(ЗаказыНаПроизводствоОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗаказыНаПроизводство
//		|ИЗ
//		|	ДвиженияЗаказыНаПроизводствоИзменение КАК ДвиженияЗаказыНаПроизводствоИзменение
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПроизводство.Остатки(
//		|				&МоментКонтроля,
//		|				(Организация, Склад, ЗаказНаПроизводство, Номенклатура, Характеристика) В
//		|					(ВЫБРАТЬ
//		|						ДвиженияЗаказыНаПроизводствоИзменение.Организация КАК Организация,
//		|						ДвиженияЗаказыНаПроизводствоИзменение.Склад КАК Склад,
//		|						ДвиженияЗаказыНаПроизводствоИзменение.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
//		|						ДвиженияЗаказыНаПроизводствоИзменение.Номенклатура КАК Номенклатура,
//		|						ДвиженияЗаказыНаПроизводствоИзменение.Характеристика КАК Характеристика
//		|					ИЗ
//		|						ДвиженияЗаказыНаПроизводствоИзменение КАК ДвиженияЗаказыНаПроизводствоИзменение)) КАК ЗаказыНаПроизводствоОстатки
//		|		ПО ДвиженияЗаказыНаПроизводствоИзменение.Организация = ЗаказыНаПроизводствоОстатки.Организация
//		|			И ДвиженияЗаказыНаПроизводствоИзменение.Склад = ЗаказыНаПроизводствоОстатки.Склад
//		|			И ДвиженияЗаказыНаПроизводствоИзменение.ЗаказНаПроизводство = ЗаказыНаПроизводствоОстатки.ЗаказНаПроизводство
//		|			И ДвиженияЗаказыНаПроизводствоИзменение.Номенклатура = ЗаказыНаПроизводствоОстатки.Номенклатура
//		|			И ДвиженияЗаказыНаПроизводствоИзменение.Характеристика = ЗаказыНаПроизводствоОстатки.Характеристика
//		|ГДЕ
//		|	ЕСТЬNULL(ЗаказыНаПроизводствоОстатки.КоличествоОстаток, 0) < 0
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияРазмещениеЗаказовИзменение.НомерСтроки КАК НомерСтроки,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРазмещениеЗаказовИзменение.Организация) КАК ОрганизацияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРазмещениеЗаказовИзменение.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРазмещениеЗаказовИзменение.Номенклатура) КАК НоменклатураПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРазмещениеЗаказовИзменение.Характеристика) КАК ХарактеристикаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРазмещениеЗаказовИзменение.ИсточникОбеспечения) КАК ИсточникОбеспеченияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РазмещениеЗаказовОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
//		|	ЕСТЬNULL(ДвиженияРазмещениеЗаказовИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) КАК ОстатокРазмещениеЗаказов,
//		|	ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокРазмещениеЗаказов
//		|ИЗ
//		|	ДвиженияРазмещениеЗаказовИзменение КАК ДвиженияРазмещениеЗаказовИзменение
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказов.Остатки(
//		|				&МоментКонтроля,
//		|				(Организация, ЗаказПокупателя, Номенклатура, Характеристика, ИсточникОбеспечения) В
//		|					(ВЫБРАТЬ
//		|						ДвиженияРазмещениеЗаказовИзменение.Организация КАК Организация,
//		|						ДвиженияРазмещениеЗаказовИзменение.ЗаказПокупателя КАК ЗаказПокупателя,
//		|						ДвиженияРазмещениеЗаказовИзменение.Номенклатура КАК Номенклатура,
//		|						ДвиженияРазмещениеЗаказовИзменение.Характеристика КАК Характеристика,
//		|						ДвиженияРазмещениеЗаказовИзменение.ИсточникОбеспечения КАК ИсточникОбеспечения
//		|					ИЗ
//		|						ДвиженияРазмещениеЗаказовИзменение КАК ДвиженияРазмещениеЗаказовИзменение)) КАК РазмещениеЗаказовОстатки
//		|		ПО ДвиженияРазмещениеЗаказовИзменение.Организация = РазмещениеЗаказовОстатки.Организация
//		|			И ДвиженияРазмещениеЗаказовИзменение.ЗаказПокупателя = РазмещениеЗаказовОстатки.ЗаказПокупателя
//		|			И ДвиженияРазмещениеЗаказовИзменение.Номенклатура = РазмещениеЗаказовОстатки.Номенклатура
//		|			И ДвиженияРазмещениеЗаказовИзменение.Характеристика = РазмещениеЗаказовОстатки.Характеристика
//		|			И ДвиженияРазмещениеЗаказовИзменение.ИсточникОбеспечения = РазмещениеЗаказовОстатки.ИсточникОбеспечения
//		|ГДЕ
//		|	ЕСТЬNULL(РазмещениеЗаказовОстатки.КоличествоОстаток, 0) < 0
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияСерииНоменклатурыИзменение.НомерСтроки КАК НомерСтроки,
//		|	ДвиженияСерииНоменклатурыИзменение.Серия КАК СерияПредставление,
//		|	ДвиженияСерииНоменклатурыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
//		|	ДвиженияСерииНоменклатурыИзменение.Номенклатура КАК НоменклатураПредставление,
//		|	ДвиженияСерииНоменклатурыИзменение.Характеристика КАК ХарактеристикаПредставление,
//		|	ДвиженияСерииНоменклатурыИзменение.Партия КАК ПартияПредставление,
//		|	ДвиженияСерииНоменклатурыИзменение.Ячейка КАК ЯчейкаПредставление,
//		|	СерииНоменклатурыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
//		|	СерииНоменклатурыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
//		|	ЕСТЬNULL(ДвиженияСерииНоменклатурыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(СерииНоменклатурыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
//		|	ЕСТЬNULL(СерииНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
//		|ИЗ
//		|	ДвиженияСерииНоменклатурыИзменение КАК ДвиженияСерииНоменклатурыИзменение
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СерииНоменклатуры.Остатки(&МоментКонтроля, ) КАК СерииНоменклатурыОстатки
//		|		ПО ДвиженияСерииНоменклатурыИзменение.СтруктурнаяЕдиница = СерииНоменклатурыОстатки.СтруктурнаяЕдиница
//		|			И ДвиженияСерииНоменклатурыИзменение.Номенклатура = СерииНоменклатурыОстатки.Номенклатура
//		|			И ДвиженияСерииНоменклатурыИзменение.Характеристика = СерииНоменклатурыОстатки.Характеристика
//		|			И ДвиженияСерииНоменклатурыИзменение.Партия = СерииНоменклатурыОстатки.Партия
//		|			И ДвиженияСерииНоменклатурыИзменение.Серия = СерииНоменклатурыОстатки.Серия
//		|			И ДвиженияСерииНоменклатурыИзменение.Ячейка = СерииНоменклатурыОстатки.Ячейка
//		|			И (ЕСТЬNULL(СерииНоменклатурыОстатки.КоличествоОстаток, 0) < 0)
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияЗапасыВРазрезеГТДИзменение.НомерСтроки КАК НомерСтроки,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Организация) КАК ОрганизацияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД) КАК НомерГТДПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура) КАК НоменклатураПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика) КАК ХарактеристикаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Партия) КАК ПартияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения) КАК СтранаПроисхожденияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыВРазрезеГТДОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
//		|	ЕСТЬNULL(ДвиженияЗапасыВРазрезеГТДИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыВРазрезеГТД,
//		|	ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыВРазрезеГТД
//		|ИЗ
//		|	ДвиженияЗапасыВРазрезеГТДИзменение КАК ДвиженияЗапасыВРазрезеГТДИзменение
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыВРазрезеГТД.Остатки(
//		|				&МоментКонтроля,
//		|				(Организация, НомерГТД, Номенклатура, Характеристика, Партия, СтранаПроисхождения) В
//		|					(ВЫБРАТЬ
//		|						ДвиженияЗапасыВРазрезеГТДИзменение.Организация КАК Организация,
//		|						ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД КАК НомерГТД,
//		|						ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура КАК Номенклатура,
//		|						ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика КАК Характеристика,
//		|						ДвиженияЗапасыВРазрезеГТДИзменение.Партия КАК Партия,
//		|						ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения КАК СтранаПроисхождения
//		|					ИЗ
//		|						ДвиженияЗапасыВРазрезеГТДИзменение КАК ДвиженияЗапасыВРазрезеГТДИзменение)) КАК ЗапасыВРазрезеГТДОстатки
//		|		ПО ДвиженияЗапасыВРазрезеГТДИзменение.Организация = ЗапасыВРазрезеГТДОстатки.Организация
//		|			И ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД = ЗапасыВРазрезеГТДОстатки.НомерГТД
//		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура = ЗапасыВРазрезеГТДОстатки.Номенклатура
//		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика = ЗапасыВРазрезеГТДОстатки.Характеристика
//		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Партия = ЗапасыВРазрезеГТДОстатки.Партия
//		|			И ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения = ЗапасыВРазрезеГТДОстатки.СтранаПроисхождения
//		|ГДЕ
//		|	ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) < 0
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияПрослеживаемыеТоварыИзменение.НомерСтроки КАК НомерСтроки,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.Организация КАК ОрганизацияПредставление,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.РНПТ КАК РНПТПредставление,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.СтранаПроисхождения КАК СтранаПроисхожденияПредставление,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура КАК НоменклатураПредставление,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.Характеристика КАК ХарактеристикаПредставление,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.Партия КАК ПартияПредставление,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.Комиссионер КАК Комиссионер,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.Комплектующие КАК Комплектующие,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
//		|	ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура.ТоварнаяНоменклатураВЭД.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПрослеживаемостиПредставление,
//		|	ЕСТЬNULL(ДвиженияПрослеживаемыеТоварыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоОстаток, 0) КАК ОстатокКоличество,
//		|	ЕСТЬNULL(ДвиженияПрослеживаемыеТоварыИзменение.КоличествоПрослеживаемостиИзменение, 0) + ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоПрослеживаемостиОстаток, 0) КАК ОстатокКоличествоПрослеживаемости,
//		|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоОстаток, 0) КАК ОстатокКоличествоТекущий,
//		|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоПрослеживаемостиОстаток, 0) КАК ОстатокКоличествоПрослеживаемостиТекущий
//		|ИЗ
//		|	ДвиженияПрослеживаемыеТоварыИзменение КАК ДвиженияПрослеживаемыеТоварыИзменение
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрослеживаемыеТовары.Остатки(&МоментКонтроля, ) КАК ПрослеживаемыеТоварыОстатки
//		|		ПО ДвиженияПрослеживаемыеТоварыИзменение.Организация = ПрослеживаемыеТоварыОстатки.Организация
//		|			И ДвиженияПрослеживаемыеТоварыИзменение.РНПТ = ПрослеживаемыеТоварыОстатки.РНПТ
//		|			И ДвиженияПрослеживаемыеТоварыИзменение.СтранаПроисхождения = ПрослеживаемыеТоварыОстатки.СтранаПроисхождения
//		|			И ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура = ПрослеживаемыеТоварыОстатки.Номенклатура
//		|			И ДвиженияПрослеживаемыеТоварыИзменение.Характеристика = ПрослеживаемыеТоварыОстатки.Характеристика
//		|			И ДвиженияПрослеживаемыеТоварыИзменение.Партия = ПрослеживаемыеТоварыОстатки.Партия
//		|			И (ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоОстаток, 0) < 0
//		|				ИЛИ ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоПрослеживаемостиОстаток, 0) < 0)
//		|			И ДвиженияПрослеживаемыеТоварыИзменение.Комиссионер = ПрослеживаемыеТоварыОстатки.Комиссионер
//		|			И ДвиженияПрослеживаемыеТоварыИзменение.Комплектующие = ПрослеживаемыеТоварыОстатки.Комплектующие
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияЗапасыКПоступлениюНаСкладыИзменение.НомерСтроки КАК НомерСтроки,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКПоступлениюНаСкладыИзменение.ДокументОснование) КАК ДокументПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Организация) КАК ОрганизацияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКПоступлениюНаСкладыИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Номенклатура) КАК НоменклатураПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Характеристика) КАК ХарактеристикаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Партия) КАК ПартияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКПоступлениюНаСкладыИзменение.ДокументОснование) КАК ДокументОснованиеПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Ячейка) КАК ЯчейкаПредставление,
//		|	ЗапасыКПоступлениюНаСкладыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыКПоступлениюНаСкладыОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
//		|	ЕСТЬNULL(ДвиженияЗапасыКПоступлениюНаСкладыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыКПоступлениюНаСкладыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
//		|	ЕСТЬNULL(ЗапасыКПоступлениюНаСкладыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
//		|ИЗ
//		|	ДвиженияЗапасыКПоступлениюНаСкладыИзменение КАК ДвиженияЗапасыКПоступлениюНаСкладыИзменение
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыКПоступлениюНаСклады.Остатки(
//		|				&МоментКонтроля,
//		|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, ДокументОснование, Ячейка) В
//		|					(ВЫБРАТЬ
//		|						ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Организация КАК Организация,
//		|						ДвиженияЗапасыКПоступлениюНаСкладыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//		|						ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Номенклатура КАК Номенклатура,
//		|						ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Характеристика КАК Характеристика,
//		|						ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Партия КАК Партия,
//		|						ДвиженияЗапасыКПоступлениюНаСкладыИзменение.ДокументОснование КАК ДокументОснование,
//		|						ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Ячейка КАК Ячейка
//		|					ИЗ
//		|						ДвиженияЗапасыКПоступлениюНаСкладыИзменение КАК ДвиженияЗапасыКПоступлениюНаСкладыИзменение)) КАК ЗапасыКПоступлениюНаСкладыОстатки
//		|		ПО ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Организация = ЗапасыКПоступлениюНаСкладыОстатки.Организация
//		|			И ДвиженияЗапасыКПоступлениюНаСкладыИзменение.СтруктурнаяЕдиница = ЗапасыКПоступлениюНаСкладыОстатки.СтруктурнаяЕдиница
//		|			И ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Номенклатура = ЗапасыКПоступлениюНаСкладыОстатки.Номенклатура
//		|			И ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Характеристика = ЗапасыКПоступлениюНаСкладыОстатки.Характеристика
//		|			И ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Партия = ЗапасыКПоступлениюНаСкладыОстатки.Партия
//		|			И ДвиженияЗапасыКПоступлениюНаСкладыИзменение.ДокументОснование = ЗапасыКПоступлениюНаСкладыОстатки.ДокументОснование
//		|			И ДвиженияЗапасыКПоступлениюНаСкладыИзменение.Ячейка = ЗапасыКПоступлениюНаСкладыОстатки.Ячейка
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА ЗапасыКПоступлениюНаСкладыОстатки.СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоСкладскимОрдерам)
//		|				ТОГДА ЕСТЬNULL(ЗапасыКПоступлениюНаСкладыОстатки.КоличествоОстаток, 0) < 0
//		|			КОГДА ЗапасыКПоступлениюНаСкладыОстатки.СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам)
//		|				ТОГДА ЕСТЬNULL(ЗапасыКПоступлениюНаСкладыОстатки.КоличествоОстаток, 0) > 0
//		|			ИНАЧЕ ЛОЖЬ
//		|		КОНЕЦ
//		|	И НЕ ДвиженияЗапасыКПоступлениюНаСкладыИзменение.СтруктурнаяЕдиница = &Изготовитель
//		|	И ДвиженияЗапасыКПоступлениюНаСкладыИзменение.СтруктурнаяЕдиница В(&МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам)
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияСерииНоменклатурыКПоступлениюИзменение.НомерСтроки КАК НомерСтроки,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКПоступлениюИзменение.ДокументОснование) КАК ДокументПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКПоступлениюИзменение.Организация) КАК ОрганизацияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКПоступлениюИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКПоступлениюИзменение.Номенклатура) КАК НоменклатураПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКПоступлениюИзменение.Характеристика) КАК ХарактеристикаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКПоступлениюИзменение.Партия) КАК ПартияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКПоступлениюИзменение.Серия) КАК СерияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКПоступлениюИзменение.ДокументОснование) КАК ДокументОснованиеПредставление,
//		|	СерииНоменклатурыКПоступлениюОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СерииНоменклатурыКПоступлениюОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
//		|	-(ЕСТЬNULL(ДвиженияСерииНоменклатурыКПоступлениюИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(СерииНоменклатурыКПоступлениюОстатки.КоличествоОстаток, 0)) КАК ОстатокЗапасыНаСкладах,
//		|	-ЕСТЬNULL(СерииНоменклатурыКПоступлениюОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
//		|ИЗ
//		|	ДвиженияСерииНоменклатурыКПоступлениюИзменение КАК ДвиженияСерииНоменклатурыКПоступлениюИзменение
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СерииНоменклатурыКПоступлению.Остатки(
//		|				&МоментКонтроля,
//		|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, ДокументОснование, Серия) В
//		|					(ВЫБРАТЬ
//		|						ДвиженияСерииНоменклатурыКПоступлениюИзменение.Организация КАК Организация,
//		|						ДвиженияСерииНоменклатурыКПоступлениюИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//		|						ДвиженияСерииНоменклатурыКПоступлениюИзменение.Номенклатура КАК Номенклатура,
//		|						ДвиженияСерииНоменклатурыКПоступлениюИзменение.Характеристика КАК Характеристика,
//		|						ДвиженияСерииНоменклатурыКПоступлениюИзменение.Партия КАК Партия,
//		|						ДвиженияСерииНоменклатурыКПоступлениюИзменение.ДокументОснование КАК ДокументОснование,
//		|						ДвиженияСерииНоменклатурыКПоступлениюИзменение.Серия КАК Серия
//		|					ИЗ
//		|						ДвиженияСерииНоменклатурыКПоступлениюИзменение КАК ДвиженияСерииНоменклатурыКПоступлениюИзменение)) КАК СерииНоменклатурыКПоступлениюОстатки
//		|		ПО ДвиженияСерииНоменклатурыКПоступлениюИзменение.Организация = СерииНоменклатурыКПоступлениюОстатки.Организация
//		|			И ДвиженияСерииНоменклатурыКПоступлениюИзменение.СтруктурнаяЕдиница = СерииНоменклатурыКПоступлениюОстатки.СтруктурнаяЕдиница
//		|			И ДвиженияСерииНоменклатурыКПоступлениюИзменение.Номенклатура = СерииНоменклатурыКПоступлениюОстатки.Номенклатура
//		|			И ДвиженияСерииНоменклатурыКПоступлениюИзменение.Характеристика = СерииНоменклатурыКПоступлениюОстатки.Характеристика
//		|			И ДвиженияСерииНоменклатурыКПоступлениюИзменение.Партия = СерииНоменклатурыКПоступлениюОстатки.Партия
//		|			И ДвиженияСерииНоменклатурыКПоступлениюИзменение.ДокументОснование = СерииНоменклатурыКПоступлениюОстатки.ДокументОснование
//		|			И ДвиженияСерииНоменклатурыКПоступлениюИзменение.Серия = СерииНоменклатурыКПоступлениюОстатки.Серия
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА СерииНоменклатурыКПоступлениюОстатки.СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоСкладскимОрдерам)
//		|				ТОГДА ЕСТЬNULL(СерииНоменклатурыКПоступлениюОстатки.КоличествоОстаток, 0) < 0
//		|			КОГДА СерииНоменклатурыКПоступлениюОстатки.СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам)
//		|				ТОГДА ЕСТЬNULL(СерииНоменклатурыКПоступлениюОстатки.КоличествоОстаток, 0) > 0
//		|			ИНАЧЕ ЛОЖЬ
//		|		КОНЕЦ
//		|	И НЕ ДвиженияСерииНоменклатурыКПоступлениюИзменение.СтруктурнаяЕдиница = &Изготовитель
//		|	И ДвиженияСерииНоменклатурыКПоступлениюИзменение.СтруктурнаяЕдиница В(&МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам)
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияЗапасыКРасходуСоСкладовИзменение.НомерСтроки КАК НомерСтроки,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКРасходуСоСкладовИзменение.ДокументОснование) КАК ДокументПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКРасходуСоСкладовИзменение.Организация) КАК ОрганизацияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКРасходуСоСкладовИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКРасходуСоСкладовИзменение.Номенклатура) КАК НоменклатураПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКРасходуСоСкладовИзменение.Характеристика) КАК ХарактеристикаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКРасходуСоСкладовИзменение.Партия) КАК ПартияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКРасходуСоСкладовИзменение.ДокументОснование) КАК ДокументОснованиеПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыКРасходуСоСкладовИзменение.Ячейка) КАК ЯчейкаПредставление,
//		|	ЗапасыКРасходуСоСкладовОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыКРасходуСоСкладовОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
//		|	ЕСТЬNULL(ДвиженияЗапасыКРасходуСоСкладовИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыКРасходуСоСкладовОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
//		|	ЕСТЬNULL(ЗапасыКРасходуСоСкладовОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
//		|ИЗ
//		|	ДвиженияЗапасыКРасходуСоСкладовИзменение КАК ДвиженияЗапасыКРасходуСоСкладовИзменение
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыКРасходуСоСкладов.Остатки(
//		|				&МоментКонтроля,
//		|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, ДокументОснование, Ячейка) В
//		|					(ВЫБРАТЬ
//		|						ДвиженияЗапасыКРасходуСоСкладовИзменение.Организация КАК Организация,
//		|						ДвиженияЗапасыКРасходуСоСкладовИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//		|						ДвиженияЗапасыКРасходуСоСкладовИзменение.Номенклатура КАК Номенклатура,
//		|						ДвиженияЗапасыКРасходуСоСкладовИзменение.Характеристика КАК Характеристика,
//		|						ДвиженияЗапасыКРасходуСоСкладовИзменение.Партия КАК Партия,
//		|						ДвиженияЗапасыКРасходуСоСкладовИзменение.ДокументОснование КАК ДокументОснование,
//		|						ДвиженияЗапасыКРасходуСоСкладовИзменение.Ячейка КАК Ячейка
//		|					ИЗ
//		|						ДвиженияЗапасыКРасходуСоСкладовИзменение КАК ДвиженияЗапасыКРасходуСоСкладовИзменение)) КАК ЗапасыКРасходуСоСкладовОстатки
//		|		ПО ДвиженияЗапасыКРасходуСоСкладовИзменение.Организация = ЗапасыКРасходуСоСкладовОстатки.Организация
//		|			И ДвиженияЗапасыКРасходуСоСкладовИзменение.СтруктурнаяЕдиница = ЗапасыКРасходуСоСкладовОстатки.СтруктурнаяЕдиница
//		|			И ДвиженияЗапасыКРасходуСоСкладовИзменение.Номенклатура = ЗапасыКРасходуСоСкладовОстатки.Номенклатура
//		|			И ДвиженияЗапасыКРасходуСоСкладовИзменение.Характеристика = ЗапасыКРасходуСоСкладовОстатки.Характеристика
//		|			И ДвиженияЗапасыКРасходуСоСкладовИзменение.Партия = ЗапасыКРасходуСоСкладовОстатки.Партия
//		|			И ДвиженияЗапасыКРасходуСоСкладовИзменение.ДокументОснование = ЗапасыКРасходуСоСкладовОстатки.ДокументОснование
//		|			И ДвиженияЗапасыКРасходуСоСкладовИзменение.Ячейка = ЗапасыКРасходуСоСкладовОстатки.Ячейка
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА ЗапасыКРасходуСоСкладовОстатки.СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоСкладскимОрдерам)
//		|				ТОГДА ЕСТЬNULL(ЗапасыКРасходуСоСкладовОстатки.КоличествоОстаток, 0) > 0
//		|			КОГДА ЗапасыКРасходуСоСкладовОстатки.СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам)
//		|				ТОГДА ЕСТЬNULL(ЗапасыКРасходуСоСкладовОстатки.КоличествоОстаток, 0) < 0
//		|			ИНАЧЕ ЛОЖЬ
//		|		КОНЕЦ
//		|	И НЕ ДвиженияЗапасыКРасходуСоСкладовИзменение.СтруктурнаяЕдиница = &Изготовитель
//		|	И ДвиженияЗапасыКРасходуСоСкладовИзменение.СтруктурнаяЕдиница В(&МассивКонтроляПоЗапасамКОтгрузкеПоСкладскимОрдерам)
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияСерииНоменклатурыКРасходуИзменение.НомерСтроки КАК НомерСтроки,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКРасходуИзменение.ДокументОснование) КАК ДокументПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКРасходуИзменение.Организация) КАК ОрганизацияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКРасходуИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКРасходуИзменение.Номенклатура) КАК НоменклатураПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКРасходуИзменение.Характеристика) КАК ХарактеристикаПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКРасходуИзменение.Партия) КАК ПартияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКРасходуИзменение.Серия) КАК СерияПредставление,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСерииНоменклатурыКРасходуИзменение.ДокументОснование) КАК ДокументОснованиеПредставление,
//		|	СерииНоменклатурыКРасходуОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СерииНоменклатурыКРасходуОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
//		|	-(ЕСТЬNULL(ДвиженияСерииНоменклатурыКРасходуИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(СерииНоменклатурыКРасходуОстатки.КоличествоОстаток, 0)) КАК ОстатокЗапасыНаСкладах,
//		|	-ЕСТЬNULL(СерииНоменклатурыКРасходуОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
//		|ИЗ
//		|	ДвиженияСерииНоменклатурыКРасходуИзменение КАК ДвиженияСерииНоменклатурыКРасходуИзменение
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СерииНоменклатурыКРасходу.Остатки(
//		|				&МоментКонтроля,
//		|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, ДокументОснование, Серия) В
//		|					(ВЫБРАТЬ
//		|						ДвиженияСерииНоменклатурыКРасходуИзменение.Организация КАК Организация,
//		|						ДвиженияСерииНоменклатурыКРасходуИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//		|						ДвиженияСерииНоменклатурыКРасходуИзменение.Номенклатура КАК Номенклатура,
//		|						ДвиженияСерииНоменклатурыКРасходуИзменение.Характеристика КАК Характеристика,
//		|						ДвиженияСерииНоменклатурыКРасходуИзменение.Партия КАК Партия,
//		|						ДвиженияСерииНоменклатурыКРасходуИзменение.ДокументОснование КАК ДокументОснование,
//		|						ДвиженияСерииНоменклатурыКРасходуИзменение.Серия КАК Серия
//		|					ИЗ
//		|						ДвиженияСерииНоменклатурыКРасходуИзменение КАК ДвиженияСерииНоменклатурыКРасходуИзменение)) КАК СерииНоменклатурыКРасходуОстатки
//		|		ПО ДвиженияСерииНоменклатурыКРасходуИзменение.Организация = СерииНоменклатурыКРасходуОстатки.Организация
//		|			И ДвиженияСерииНоменклатурыКРасходуИзменение.СтруктурнаяЕдиница = СерииНоменклатурыКРасходуОстатки.СтруктурнаяЕдиница
//		|			И ДвиженияСерииНоменклатурыКРасходуИзменение.Номенклатура = СерииНоменклатурыКРасходуОстатки.Номенклатура
//		|			И ДвиженияСерииНоменклатурыКРасходуИзменение.Характеристика = СерииНоменклатурыКРасходуОстатки.Характеристика
//		|			И ДвиженияСерииНоменклатурыКРасходуИзменение.Партия = СерииНоменклатурыКРасходуОстатки.Партия
//		|			И ДвиженияСерииНоменклатурыКРасходуИзменение.ДокументОснование = СерииНоменклатурыКРасходуОстатки.ДокументОснование
//		|			И ДвиженияСерииНоменклатурыКРасходуИзменение.Серия = СерииНоменклатурыКРасходуОстатки.Серия
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА СерииНоменклатурыКРасходуОстатки.СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоСкладскимОрдерам)
//		|				ТОГДА ЕСТЬNULL(СерииНоменклатурыКРасходуОстатки.КоличествоОстаток, 0) > 0
//		|			КОГДА СерииНоменклатурыКРасходуОстатки.СтруктурнаяЕдиница.ВидУчетаОрдерныхСкладов = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаОрдерныхСкладов.УчетОстатковПоПрочимДокументам)
//		|				ТОГДА ЕСТЬNULL(СерииНоменклатурыКРасходуОстатки.КоличествоОстаток, 0) < 0
//		|			ИНАЧЕ ЛОЖЬ
//		|		КОНЕЦ
//		|	И НЕ ДвиженияСерииНоменклатурыКРасходуИзменение.СтруктурнаяЕдиница = &Изготовитель
//		|	И ДвиженияСерииНоменклатурыКРасходуИзменение.СтруктурнаяЕдиница В(&МассивКонтроляПоЗапасамКОтгрузкеПоСкладскимОрдерам)
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ДвиженияРезервыТоваровОрганизацийИзменение.НомерСтроки КАК НомерСтроки,
//		|	ДвиженияРезервыТоваровОрганизацийИзменение.Организация КАК ОрганизацияПредставление,
//		|	ДвиженияРезервыТоваровОрганизацийИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
//		|	ДвиженияРезервыТоваровОрганизацийИзменение.Номенклатура КАК НоменклатураПредставление,
//		|	ДвиженияРезервыТоваровОрганизацийИзменение.Характеристика КАК ХарактеристикаПредставление,
//		|	ДвиженияРезервыТоваровОрганизацийИзменение.Партия КАК ПартияПредставление,
//		|	ДвиженияРезервыТоваровОрганизацийИзменение.ЗаказПокупателя КАК ЯчейкаПредставление,
//		|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
//		|	ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
//		|	ДвиженияРезервыТоваровОрганизацийИзменение.КоличествоПередЗаписью + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
//		|	ДвиженияРезервыТоваровОрганизацийИзменение.КоличествоИзменение +
//		|		ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыТоваровОрганизацийОстатки.КоличествоОстаток,
//		|		0) КАК КоличествоОстатокЗапасыНаСкладах,
//		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыТоваровОрганизацийОстатки.КоличествоОстаток,
//		|		0) КАК ОстатокЗапасыНаСкладах
//		|ИЗ
//		|	ДвиженияРезервыТоваровОрганизацийИзменение КАК ДвиженияРезервыТоваровОрганизацийИзменение
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(&МоментКонтроля, Организация В (&МассивОрганизаций)
//		|		И (СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
//		|			(ВЫБРАТЬ
//		|				ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//		|				ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
//		|				ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
//		|				ДвиженияЗапасыИзменение.Партия КАК Партия,
//		|				ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя
//		|			ИЗ
//		|				ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
//		|		ПО ДвиженияРезервыТоваровОрганизацийИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
//		|		И ДвиженияРезервыТоваровОрганизацийИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
//		|		И ДвиженияРезервыТоваровОрганизацийИзменение.Характеристика = ЗапасыОстатки.Характеристика
//		|		И ДвиженияРезервыТоваровОрганизацийИзменение.Партия = ЗапасыОстатки.Партия
//		|		И ДвиженияРезервыТоваровОрганизацийИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТоваровОрганизаций.Остатки(&МоментКонтроля, Организация В
//		|		(&МассивОрганизаций)
//		|		И (СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
//		|			(ВЫБРАТЬ
//		|				ДвиженияРезервыТоваровОрганизацийИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//		|				ДвиженияРезервыТоваровОрганизацийИзменение.Номенклатура КАК Номенклатура,
//		|				ДвиженияРезервыТоваровОрганизацийИзменение.Характеристика КАК Характеристика,
//		|				ДвиженияРезервыТоваровОрганизацийИзменение.Партия КАК Партия,
//		|				ДвиженияРезервыТоваровОрганизацийИзменение.ЗаказПокупателя КАК ЗаказПокупателя
//		|			ИЗ
//		|				ДвиженияРезервыТоваровОрганизацийИзменение КАК ДвиженияРезервыТоваровОрганизацийИзменение)) КАК РезервыТоваровОрганизацийОстатки
//		|		ПО (&ПередачаТоваровМеждуОрганизациями)
//		|		И ДвиженияРезервыТоваровОрганизацийИзменение.СтруктурнаяЕдиница = РезервыТоваровОрганизацийОстатки.СтруктурнаяЕдиница
//		|		И ДвиженияРезервыТоваровОрганизацийИзменение.Номенклатура = РезервыТоваровОрганизацийОстатки.Номенклатура
//		|		И ДвиженияРезервыТоваровОрганизацийИзменение.Характеристика = РезервыТоваровОрганизацийОстатки.Характеристика
//		|		И ДвиженияРезервыТоваровОрганизацийИзменение.Партия = РезервыТоваровОрганизацийОстатки.Партия
//		|		И ДвиженияРезервыТоваровОрганизацийИзменение.ЗаказПокупателя = РезервыТоваровОрганизацийОстатки.ЗаказПокупателя
//		|ГДЕ
//		|	ДвиженияРезервыТоваровОрганизацийИзменение.Организация В (&МассивОрганизаций)
//		|	И ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыТоваровОрганизацийОстатки.КоличествоОстаток,
//		|		0) + ДвиженияРезервыТоваровОрганизацийИзменение.КоличествоИзменение < 0
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки");
//		
//		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
//		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
//		Запрос.УстановитьПараметр("МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам", ДополнительныеСвойства.МассивКонтроляПоЗапасамКПоступлениюПоСкладскимОрдерам); 
//		Запрос.УстановитьПараметр("МассивКонтроляПоЗапасамКОтгрузкеПоСкладскимОрдерам", ДополнительныеСвойства.МассивКонтроляПоЗапасамКОтгрузкеПоСкладскимОрдерам); 
//		Запрос.УстановитьПараметр("Изготовитель", ДополнительныеСвойства.Изготовитель); 
//		
//		ИнтеркампаниСервер.УстановитьПараметрыКонтроляОстатков(Запрос, ДополнительныеСвойства);
//		
//		РезультатыЗапроса = Запрос.ВыполнитьПакет();
//		
//		Если НЕ РезультатыЗапроса[0].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[1].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[2].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[3].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[4].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[5].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[6].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[7].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[8].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[9].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[10].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[11].Пустой()
//			ИЛИ НЕ РезультатыЗапроса[12].Пустой() Тогда
//						
//			ДокументОбъектСборкаЗапасов = ДокументСсылкаСборкаЗапасов.ПолучитьОбъект()
//			
//		КонецЕсли;
//		
//		// Отрицательный остаток запасов на складе.
//		Если НЕ РезультатыЗапроса[0].Пустой() Тогда
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[0].Выбрать();
//			КонтрольОстатковУНФ.ЗапасыНаСкладахСписком(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//		// Отрицательный остаток запасов.
//		Если НЕ РезультатыЗапроса[1].Пустой() Тогда
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[1].Выбрать();
//			КонтрольОстатковУНФ.ЗапасыСписком(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//		// Отрицательный остаток запасов принятых.
//		Если НЕ РезультатыЗапроса[2].Пустой() Тогда
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[2].Выбрать();
//			КонтрольОстатковУНФ.ЗапасыПринятые(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//		// Отрицательный остаток по заказам на производство.
//		Если НЕ РезультатыЗапроса[3].Пустой() Тогда
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[3].Выбрать();
//			КонтрольОстатковУНФ.ЗаказыНаПроизводство(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//		// Отрицательный остаток по размещению запасов.
//		Если НЕ РезультатыЗапроса[4].Пустой() Тогда
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[4].Выбрать();
//			КонтрольОстатковУНФ.РазмещениеЗаказов(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//		// Отрицательный остаток учета серийных номеров.
//		Если НЕ РезультатыЗапроса[5].Пустой() Тогда
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[5].Выбрать();
//			КонтрольОстатковУНФ.СерииНоменклатуры(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//		// Отрицательный остаток по остаткам запасов в разрезе номеров ГТД.
//		Если Константы.КонтролироватьОстаткиПоНомерамГТД.Получить()
//			И НЕ РезультатыЗапроса[6].Пустой() Тогда
//			
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[6].Выбрать();
//			КонтрольОстатковУНФ.ЗапасыВРазрезеГТД(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//			
//		КонецЕсли;
//		
//		// Отрицательный остаток учета прослеживаемых товаров.
//		Если Константы.ВестиУчетПрослеживаемыхТоваров.Получить()
//			И НЕ РезультатыЗапроса[7].Пустой() Тогда
//			
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[7].Выбрать(); 
//			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструПрослеживаемыеТовары(
//				ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//			
//		КонецЕсли;
//			
//		// Отрицательный остаток запасов к поступлению.
//		Если НЕ РезультатыЗапроса[8].Пустой() Тогда 
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[8].Выбрать();
//			КонтрольОстатковУНФ.ЗапасыКПоступлению(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//		// Отрицательный остаток по сериям номенклатуры к поступлению.
//		Если НЕ РезультатыЗапроса[9].Пустой() Тогда 
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[9].Выбрать();
//			КонтрольОстатковУНФ.СерииНоменклатурыКПоступлению(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//		// Отрицательный остаток запасов к расходу.
//		Если НЕ РезультатыЗапроса[10].Пустой() Тогда 
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[10].Выбрать();
//			КонтрольОстатковУНФ.ЗапасыКРасходу(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//		// Отрицательный остаток по сериям номенклатуры к расходу.
//		Если НЕ РезультатыЗапроса[11].Пустой() Тогда 
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[11].Выбрать();
//			КонтрольОстатковУНФ.СерииНоменклатурыКРасходуПоДокументам(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//		// Отрицательный остаток по запасам с учетом резервов к передаче
//		Если НЕ РезультатыЗапроса[12].Пустой() И НЕ Отказ Тогда
//			ВыборкаИзРезультатаЗапроса = РезультатыЗапроса[12].Выбрать();
//			КонтрольОстатковУНФ.РезервыКПередачиСУчетомОстатковПоЗапасамНаСкладах(ДокументОбъектСборкаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры // ВыполнитьКонтроль()
