
&НаСервере
Процедура выполнитьОтборыКМНаСервере()
	       
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПулКодовМаркировкиСУЗ.ДокументОснование КАК ДокументОснование,
		|	ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию КАК ЗаказНаЭмиссию,
		|	ПулКодовМаркировкиСУЗ.КодМаркировки КАК КодМаркировки,
		|	ПулКодовМаркировкиСУЗ.ХешСуммаКодаМаркировки КАК ХешСуммаКодаМаркировки,
		|	ПулКодовМаркировкиСУЗ.Статус КАК Статус,
		|	ПулКодовМаркировкиСУЗ.Организация КАК Организация,
		|	ПулКодовМаркировкиСУЗ.СтанцияУправленияЗаказами КАК СтанцияУправленияЗаказами,
		|	ПулКодовМаркировкиСУЗ.Номенклатура КАК Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика КАК Характеристика,
		|	ПулКодовМаркировкиСУЗ.ПолныйКодМаркировки КАК ПолныйКодМаркировки,
		|	ПулКодовМаркировкиСУЗ.ДатаЭмиссииУниверсальная КАК ДатаЭмиссииУниверсальная,
		|	ПулКодовМаркировкиСУЗ.ДатаПечатиУниверсальная КАК ДатаПечатиУниверсальная,
		|	ПулКодовМаркировкиСУЗ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ПулКодовМаркировкиСУЗ.GTIN КАК GTIN,
		|	ПулКодовМаркировкиСУЗ.ВидПродукции КАК ВидПродукции,
		|	ПулКодовМаркировкиСУЗ.МаксимальнаяРозничнаяЦена КАК МаксимальнаяРозничнаяЦена,
		|	ПулКодовМаркировкиСУЗ.СпособВводаВОборот КАК СпособВводаВОборот,
		|	ПулКодовМаркировкиСУЗ.Шаблон КАК Шаблон,
		|	ПулКодовМаркировкиСУЗ.ХешСуммаУпаковки КАК ХешСуммаУпаковки,
		|	ПулКодовМаркировкиСУЗ.ТипШтрихкода КАК ТипШтрихкода,
		|	ПулКодовМаркировкиСУЗ.МаркировкаОстатков КАК МаркировкаОстатков,
		|	ПулКодовМаркировкиСУЗ.СрокГодности КАК СрокГодности,
		|	ПулКодовМаркировкиСУЗ.ИдентификаторЗаказаСУЗ КАК ИдентификаторЗаказаСУЗ,
		|	ПулКодовМаркировкиСУЗ.ИдентификаторБлокаСУЗ КАК ИдентификаторБлокаСУЗ,
		|	ПулКодовМаркировкиСУЗ.ВидКИЗ КАК ВидКИЗ,
		|	ПулКодовМаркировкиСУЗ.РазмерКИЗ КАК РазмерКИЗ
		|ИЗ
		|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
		|ГДЕ
		|	ПулКодовМаркировкиСУЗ.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование", документПроизводства.ЗаказНаПроизводство);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// Обновляем СрокГодности у записей в наборе
	Для каждого ЗаписьНабора Из РезультатЗапроса Цикл
		НаборЗаписей = РегистрыСведений.ПулКодовМаркировкиСУЗ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОснование.Установить(документПроизводства.ЗаказНаПроизводство);
		НаборЗаписей.Отбор.ЗаказНаЭмиссию.Установить(ЗаписьНабора.ЗаказНаЭмиссию);
		НаборЗаписей.Отбор.КодМаркировки.Установить(ЗаписьНабора.КодМаркировки);
		НаборЗаписей.Отбор.ХешСуммаКодаМаркировки.Установить(ЗаписьНабора.ХешСуммаКодаМаркировки);
		НаборЗаписей.Прочитать();
		Для Каждого ЗаписьРегистра Из НаборЗаписей Цикл
			ЗаписьРегистра.СрокГодности = ДобавитьМесяц(ТекущаяДата(), ЗаписьРегистра.Номенклатура.БИТ_СрокГодности);
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	// Записываем изменения в регистр
	//НаборЗаписей.Записать(Ложь); // Ложь - не заменять, а только изменять существующие записи
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура выполнитьОтборыКМ(Команда)
	выполнитьОтборыКМНаСервере();
КонецПроцедуры
