//+БИТ доработка функционала от 08.05.2026
&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура БИТ_ДополнитьПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Ссылка.Пустая() Тогда
		Для каждого Строка Из ТекущийОбъект.Продукция Цикл
			Строка.БИТ_КлючСтроки = Новый УникальныйИдентификатор();
		КонецЦикла;
	КонецЕсли;
	
	НулевойUUID = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Для каждого Строка Из ТекущийОбъект.Продукция Цикл
		Если Строка.БИТ_КлючСтроки = Неопределено Или Строка.БИТ_КлючСтроки = "" ИЛИ Строка.БИТ_КлючСтроки = НулевойUUID Тогда
			Строка.БИТ_КлючСтроки = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
	ТекущийОбъект.БИТ_ДоработкиОбщийСтатусСтрок = ПолучитьОбщийСтатусСтрок();
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоСотрудника()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Сотрудники.Физлицо = Пользователи.ФизическоеЛицо
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Сотрудник;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ВзятьВРаботуНаСервере(НомерСтрокиТЧПродукция)
	//ТекущийСотрудник = ПараметрыСеанса.ТекущийСотрудник; 
	ТекущийСотрудник = ПолучитьТекущегоСотрудника();
	Если ТекущийСотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
		Сообщить("Не найден сотрудник в справочнике!");
		Возврат;
	КонецЕсли;
	// Получаем строку табличной части (нумерация с 0)
	СтрокаТЧ = Объект.Продукция[НомерСтрокиТЧПродукция - 1];
	
	Если СтрокаТЧ.Статус = Перечисления.СтатусыДокументовФасовка.Завершен Тогда
		Сообщить("Нельзя взять в работу завершенную позицию.");
		Возврат;
	КонецЕсли;
	Если СтрокаТЧ.Сотрудник <> ТекущийСотрудник И ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда
		Сообщить("Строка уже занята сотрудником: " + СтрокаТЧ.Сотрудник);
		Возврат;
	КонецЕсли;
	
	// Заполняем данные
	СтрокаТЧ.Сотрудник = ТекущийСотрудник;
	СтрокаТЧ.Статус = Перечисления.СтатусыДокументовФасовка.Запланировано;
КонецПроцедуры

&НаКлиенте
Процедура ВзятьВРаботу(Команда)
	// 1. Проверяем, что выделена хотя бы одна строка
	Если Не Объект.Продукция.Количество() > 0 И Не Элементы.Продукция.ТекущаяСтрока = Неопределено Тогда
		Сообщить("Выделите строку продукции для начала работы.");
		Возврат;
	КонецЕсли;
	
	// 2. Получаем данные выделенной строки
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	
	// 4. Вызов сервера
	ВзятьВРаботуНаСервере(ТекущаяСтрока.НомерСтроки); // Передаем индекс строки
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусСтрокиВРаботе()
	Возврат Перечисления.СтатусыДокументовФасовка.ВРаботе;
КонецФункции

&НаСервере
Функция ПолучитьСтатусСтрокиЗапланировано()
	Возврат Перечисления.СтатусыДокументовФасовка.Запланировано;
КонецФункции

&НаСервере
Функция ПолучитьСтатусСтрокиЗавершен()
	Возврат Перечисления.СтатусыДокументовФасовка.Завершен;
КонецФункции

&НаКлиенте
Процедура ПродукцияПередНачаломИзменения(Элемент, Отказ)
	// Если редактируем существующую строку
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		// Проверяем: если строка в работе у другого сотрудника
		Если ТекущиеДанные.Сотрудник <> ПолучитьТекущегоСотрудника() И ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
			//Отказ = Истина;  // Запрещаем редактирование
			//Сообщить("Эта строка уже в работе у сотрудника " + ТекущиеДанные.Сотрудник);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСтатусПриИзменении(Элемент) 
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.Статус = ПолучитьСтатусСтрокиВРаботе() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОСтатусе", ЭтотОбъект, ТекущаяСтрока), 
		"Вы уверены, что хотите взять эту позицию в работу?", 
		РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСтатусе(Результат, Параметры) Экспорт
	ТекущаяСтрока = Параметры;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		ТекущаяСтрока.Статус = ПолучитьСтатусСтрокиЗапланировано();
		ЗаписатьДокументНаСервере();
		ЭтаФорма.ОбновитьОтображениеДанных();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда //статус строки в работе
		// Проверяем, записан ли документ
		Если Объект.Ссылка.Пустая() Тогда
			Сообщить("Документ должен быть записан перед упаковкой!");
			Возврат;
		КонецЕсли;
		
		// Проверяем, есть ли позиции в ТЧ
		Если Объект.Продукция.Количество() = 0 Тогда
			Сообщить("Нет позиций для упаковки!");
			Возврат;
		КонецЕсли;
		
		//Проверяем, что ИД строк все заполнены, если нет - просим пользователя перезаписать документ
		НулевойUUID = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		Для каждого Строка Из Объект.Продукция Цикл
			Если Строка.БИТ_КлючСтроки = Неопределено Или Строка.БИТ_КлючСтроки = "" ИЛИ Строка.БИТ_КлючСтроки = НулевойUUID Тогда
				Сообщить("Не созданы Идентификаторы строк, просьба перезаписать документ");
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		
		//Записываем документ - статус отдельно не записать, но без проведения!
		ЗаписатьДокументНаСервере();
		ЭтаФорма.ОбновитьОтображениеДанных();
		// Открываем форму упаковки
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("БИТ_КлючСтроки", ТекущаяСтрока.БИТ_КлючСтроки);
		ПараметрыФормы.Вставить("ПроизводствоОснование", Объект.Ссылка); 
		ПараметрыФормы.Вставить("ПродукцияТЧ", Объект.Продукция);
		
		//параметрыДляОбработкиСтатуса
		ПараметрыСтрокиДляСтатуса = Новый Структура;
		ПараметрыСтрокиДляСтатуса.Вставить("СтатусЗавершен", ПолучитьСтатусСтрокиЗавершен());
		ПараметрыСтрокиДляСтатуса.Вставить("БИТ_КлючСтроки", ТекущаяСтрока.БИТ_КлючСтроки);
		
		//ОткрытьФорму("Обработка.УпаковкаПродукции.Форма", ПараметрыФормы, ЭтаФорма); //просто открываем форму(СТАРАЯ ВЕРСИЯ)
		//Форма = ПолучитьФорму("Обработка.УпаковкаПродукции.Форма",ПараметрыФормы,ЭтаФорма);
		//Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
		//Форма.ВариантСпособаОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
		//Форма = ПолучитьФорму("Обработка.УпаковкаПродукции.Форма",ПараметрыФормы,ЭтаФорма)
		//Форма.Открыть(, , ВариантСпособаОтображенияОкна.Максимизированное);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияОбработкиУпаковки", ЭтотОбъект, ПараметрыСтрокиДляСтатуса);
		ОткрытьФорму("Обработка.УпаковкаПродукции.Форма", ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОбработкиУпаковки(Результат, ПараметрыСтрокиДляСтатуса) Экспорт
	/////////////////////////////////////////////////////////
	НастроитьУсловноеОформлениеПоСтатусам();
	Если Результат = Истина Тогда
		ОбновитьСтатусУСтроки(ПараметрыСтрокиДляСтатуса.БИТ_КлючСтроки, ПараметрыСтрокиДляСтатуса.СтатусЗавершен);
		ЗаписатьДокументБезопасно(ПараметрыСтрокиДляСтатуса.БИТ_КлючСтроки, ПараметрыСтрокиДляСтатуса.СтатусЗавершен);
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;
	
	
	//Для паллетов
	Если ПроверитьСуществованиеУпакованныхКоробов() Тогда
		Элементы.УпаковкаВПаллеты.Видимость = Истина;
		Элементы.УпаковкаВПаллеты.Доступность = Истина;
	Иначе
		Элементы.УпаковкаВПаллеты.Видимость = Ложь;
		Элементы.УпаковкаВПаллеты.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьСтатусУСтроки(БИТ_КлючСтроки, НовыйСтатус)
	//Сначала находим строку в документе
	//ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("БИТ_КлючСтроки", БИТ_КлючСтроки);
	НайденныеСтроки = Объект.Продукция.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() <> 1 Тогда
		Сообщить("не удалось автоматически изменить статус у строки на ""завершен"", просьба поменять самостоятельно");
	Иначе
		НайденныеСтроки[0].Статус = НовыйСтатус;
	КонецЕсли;
	
Конецпроцедуры

&НаСервере
Процедура ЗаписатьДокументНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		//ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
		//ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Объект.БИТ_ДоработкиОбщийСтатусСтрок = ПолучитьОбщийСтатусСтрок();
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		ЭтаФорма.Записать(ПараметрыЗаписи);
	Исключение
		//ВызватьИсключение("БИТ: Невозможно записать документ программно. Обратитесь к специалисту!");
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
Конецпроцедуры

//////////////////////////////////////////////////нужное?
&НаСервере
Процедура ЗаписатьДокументБезопасно(БИТ_КлючСтроки, СтатусЗавершен)
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		// Пробуем обычную запись
		Объект.БИТ_ДоработкиОбщийСтатусСтрок = ПолучитьОбщийСтатусСтрок();
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		ЭтаФорма.Записать(ПараметрыЗаписи);
		
	Исключение
		// При ошибке - обновляем через объект
		//Если СтрНайти(ОписаниеОшибки(), "заблокирован") > 0 Тогда
			// Обновляем статус через объект в обход блокировки
		Попытка
			ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
			Если ДокументОбъект <> Неопределено Тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("БИТ_КлючСтроки", БИТ_КлючСтроки);
				НайденныеСтроки = ДокументОбъект.Продукция.НайтиСтроки(ПараметрыОтбора);
				
				Если НайденныеСтроки.Количество() = 1 Тогда
					НайденныеСтроки[0].Статус = СтатусЗавершен;
					ДокументОбъект.БИТ_ДоработкиОбщийСтатусСтрок = ПолучитьОбщийСтатусСтрок();
					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
					//Сообщить("Статус обновлен в обход блокировки");
				КонецЕсли;
			КонецЕсли;
		Исключение
			// Если опять ошибка - пробуем записать принудительно
			Попытка
				ДокументОбъект.БИТ_ДоработкиОбщийСтатусСтрок = ПолучитьОбщийСтатусСтрок();
				ДокументОбъект.Записать(Ложь);
				//Сообщить("Статус обновлен принудительно");
			Исключение
				//Сообщить("Не удалось обновить статус: " + ОписаниеОшибки());
			КонецПопытки;
		КонецПопытки;
		//КонецЕсли;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПослеПредупреждения(Результат) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		// Пользователь подтвердил действие
		Сообщить("Позиция взята в работу.");
	Иначе
		// Пользователь отказался - нужно вернуть старый статус
		ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
		Если ТекущаяСтрока <> Неопределено Тогда
			ТекущаяСтрока.Статус = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//-БИТ доработка функционала от 08.05.2026


//+БИТ доработка паллетов от 08.06.2026
&НаКлиенте
&После("ПриОткрытии")
Процедура Бит_ДополнитьПриОткрытии(Отказ)
	ОграниченияПросмотраДляЗоныУпаковки();
	// Проверяем, есть ли уже созданные короба для этого заказа
	// Используем синхронный вызов серверной функции
	Если ПроверитьСуществованиеУпакованныхКоробов() Тогда
		Элементы.УпаковкаВПаллеты.Видимость = Истина;
		Элементы.УпаковкаВПаллеты.Доступность = Истина;
	Иначе
		Элементы.УпаковкаВПаллеты.Видимость = Ложь;
		Элементы.УпаковкаВПаллеты.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		Элементы.БИТ_АвтоматическиСоздатьДокументМаркировки.Видимость = Истина;
		Элементы.БИТ_АвтоматическиСоздатьДокументМаркировки.Доступность = Истина;
	Иначе
		Элементы.БИТ_АвтоматическиСоздатьДокументМаркировки.Видимость = Ложь;
		Элементы.БИТ_АвтоматическиСоздатьДокументМаркировки.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОграниченияПросмотраДляЗоныУпаковки()
	//ТекущийСотрудник = ПараметрыСеанса.ТекущийСотрудник; 
	ТекущийСотрудник = ПолучитьТекущегоСотрудника();
	Если ТекущийСотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
		Сообщить("Не найден сотрудник в справочнике!");
		Возврат;
	КонецЕсли;
	
	//ЭлементУО = УсловноеОформление.Элементы.Добавить();
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь); // Скрываем строку
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); // На всякий случай
	//
	//// 3. Задаем условие для скрытия: строки, где сотрудник НЕ равен нашему
	//ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Продукция.ЗонаУпаковки"); // Укажите ваш путь к полю
	//ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//ЭлементУсловия.ПравоеЗначение = ТекущийСотрудник;
	//
	////4. Применяем оформление ко всем колонкам табличной части
	//Для каждого Колонка Из Элементы.Продукция.ПодчиненныеЭлементы Цикл
	//	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	//КонецЦикла;
	//
	//// Также обходим группы (если колонки сгруппированы)
	//Для каждого ЭлементФормы Из Элементы.Продукция.ПодчиненныеЭлементы Цикл
	//    Если ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы") Тогда
	//        Для каждого Вложенный Из ЭлементФормы.ПодчиненныеЭлементы Цикл
	//            Попытка
	//                ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	//                ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Объект.Продукция." + Вложенный.Имя);
	//            Исключение
	//            КонецПопытки;
	//        КонецЦикла;
	//    КонецЕсли;
	//КонецЦикла;
	// 2. Проверяем, входит ли пользователь в группу "Администраторы"
	ЕстьПраваАдминистратора = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступа.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|	ГруппыДоступа.Наименование = ""Администраторы""
	|	И ГруппыДоступа.Пользователи.Пользователь.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Пользователи.ТекущийПользователь());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЕстьПраваАдминистратора = Истина;
	КонецЕсли;
	
	Если Не ЕстьПраваАдминистратора Тогда
		СтруктураОтбора = Новый ФиксированнаяСтруктура("ЗонаУпаковки", ТекущийСотрудник);
		Элементы.Продукция.ОтборСтрок = СтруктураОтбора;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьСуществованиеУпакованныхКоробов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Количество(УпакованныеКороба.ШККороба) КАК Количество
	|ИЗ
	|	РегистрСведений.УпакованныеКороба КАК УпакованныеКороба
	|ГДЕ
	|	УпакованныеКороба.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество > 0;
	
КонецФункции

&НаКлиенте
Процедура БИТ_ДоработкаУпаковкаВПаллеты(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПроизводствоОснование", Объект.Ссылка);
	ПараметрыФормы.Вставить("ПроизводствоТЧ", Объект.Продукция);
	
	//ОткрытьФорму("Обработка.УпаковкаПродукции.Форма", ПараметрыФормы, ЭтаФорма); //просто открываем форму(СТАРАЯ ВЕРСИЯ)
	//Форма = Обработки.УпаковкаПродукции.ПолучитьФорму("Форма", , КлючУникальности);

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияОбработкиУпаковкиВПаллеты", ЭтотОбъект, ПараметрыФормы);
	ОткрытьФорму("Обработка.УпаковкаВПаллеты.Форма", ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОбработкиУпаковкиВПаллеты(Результат, ПараметрыФормы) Экспорт
	НастроитьУсловноеОформлениеПоСтатусам();
	/////////////////////////////////////////////////////////
	//Если Результат = ПараметрыСтрокиДляСтатуса.СтатусЗавершен Тогда
	//	ОбновитьСтатусУСтроки(ПараметрыСтрокиДляСтатуса.БИТ_КлючСтроки, ПараметрыСтрокиДляСтатуса.СтатусЗавершен);
	//	ОбновитьОтображениеДанных();
	//КонецЕсли;
КонецПроцедуры


//-БИТ доработка паллетов от 08.06.2026


//УСЛОВНОЕ ОФОРМЛЕНИЕ
&НаСервере
Процедура НастроитьУсловноеОформлениеПоСтатусам()
	
	// ========== СборкаЗапасов: подсветка завершенных позиций ==========
	// Получаем список номенклатуры с завершеным
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
	"Объект.Продукция.Статус", Перечисления.СтатусыДокументовФасовка.Завершен, ВидСравненияКомпоновкиДанных.Равно);
	
	// Добавляем оформляемые поля (вся строка таблицы "Продукция")
	//Для каждого Эл Из Элементы.Продукция.ПодчиненныеЭлементы Цикл
	//	Если ТипЗнч(Эл) = Тип("ГруппаФормы") Тогда
	//		Для каждого ПодчиненныйЭл Из Эл.ПодчиненныеЭлементы Цикл
	//			РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, ПодчиненныйЭл.Имя);
	//		КонецЦикла;
	//	ИначеЕсли ТипЗнч(Эл) = Тип("ПолеФормы") Тогда
	//		РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Эл.Имя);
	//	КонецЕсли;
	//КонецЦикла;
	// Оформляем не поля, а всю строку таблицы через путь к данным
	//НовоеУсловноеОформление.Поля.Добавить("Продукция"); // <-- ВАЖНО!
	//РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Элементы.Продукция);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "Продукция");
	// Устанавливаем зеленый фон
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветФона", 
	Новый Цвет(200, 255, 200));  // Светло-зеленый
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", 
	WebЦвета.Черный);
	
	// ========== ФАСОВКА: подсветка позиций в работе ==========
	// Получаем список номенклатуры с фасовкой в работе
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	
	// Отбор: номенклатура в списке фасовок в работе
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, 
	"Объект.Продукция.Статус", Перечисления.СтатусыДокументовФасовка.ВРаботе, ВидСравненияКомпоновкиДанных.Равно);
	
	// Добавляем оформляемые поля (вся строка таблицы "Запасы")
	// Проходим по всем элементам таблицы "Запасы"
	//Для каждого Эл Из Элементы.Продукция.ПодчиненныеЭлементы Цикл
	//	Если ТипЗнч(Эл) = Тип("ГруппаФормы") Тогда
	//		Для каждого ПодчиненныйЭл Из Эл.ПодчиненныеЭлементы Цикл
	//			РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, ПодчиненныйЭл.Имя);
	//		КонецЦикла;
	//	ИначеЕсли ТипЗнч(Эл) = Тип("ПолеФормы") Тогда
	//		РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Эл.Имя);
	//	КонецЕсли;
	//КонецЦикла;
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "Продукция");
	// Устанавливаем желтый фон
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветФона", 
	WebЦвета.Желтый);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", 
	WebЦвета.Черный);
	
КонецПроцедуры

&НаСервере
Процедура БИТ_ДоработкаПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НастроитьУсловноеОформлениеПоСтатусам();
КонецПроцедуры


&НаСервере
Процедура БИТ_ДоработкаПриЧтенииНаСервереПосле(ТекущийОбъект)
	НастроитьУсловноеОформлениеПоСтатусам();
КонецПроцедуры

&НаСервере
Функция ПолучитьОбщийСтатусСтрок()
	ЕстьСтрокиЗапланировано = Ложь;
	ЕстьСтрокиВРаботе = Ложь;
	ЕстьСтрокиЗавершен = Ложь;
	ЕстьПустыеСтроки = Ложь;
	Для Каждого СтрокаТЧ Из Объект.Продукция Цикл
		Если СтрокаТЧ.Статус = Перечисления.СтатусыДокументовФасовка.Запланировано Тогда
			ЕстьСтрокиЗапланировано = Истина;
		КонецЕсли;
		Если СтрокаТЧ.Статус = Перечисления.СтатусыДокументовФасовка.ВРаботе Тогда
			ЕстьСтрокиВРаботе = Истина;
		КонецЕсли;
		Если СтрокаТЧ.Статус = Перечисления.СтатусыДокументовФасовка.Завершен Тогда
			ЕстьСтрокиЗавершен = Истина;
		КонецЕсли;
		Если ПустаяСтрока(СтрокаТЧ.Статус) Тогда
			ЕстьПустыеСтроки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьСтрокиВРаботе ИЛИ (ЕстьСтрокиЗавершен И ЕстьСтрокиЗапланировано) Тогда
		Возврат Перечисления.СтатусыДокументовФасовка.ВРаботе;
	КонецЕсли;
	
	Если НЕ ЕстьСтрокиВРаботе И НЕ ЕстьСтрокиЗапланировано И НЕ ЕстьПустыеСтроки Тогда
		Возврат Перечисления.СтатусыДокументовФасовка.Завершен;
	КонецЕсли;
	
	Если НЕ ЕстьСтрокиВРаботе И НЕ ЕстьСтрокиЗавершен Тогда
		Возврат Перечисления.СтатусыДокументовФасовка.Запланировано;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура БИТ_АвтоматическиСоздатьДокументМаркировки(Команда)
	
	Если Не ЕстьСозданныйДокументМаркировкиТоваровИСМП() Тогда
		//НавигационнаяСсылкаФорматированнойСтроки_БИТ = "ИнтеграцияИС_КомандаНавигационнойСсылки#ИСМП#СоздатьОбъект#Документ.МаркировкаТоваровИСМП";
		//СтандартнаяОбработка_БИТ = Истина;
		
		ПолноеИмяДокумента = "Документ.МаркировкаТоваровИСМП";
		ОписаниеОповещения = Неопределено;
		КорректировочныйДокумент = Ложь;
		
		Если КорректировочныйДокумент Тогда
			ПараметрыФормы = Новый Структура("Основание", Новый Структура("Основание, Корректировочный", Объект.Ссылка, КорректировочныйДокумент));
		Иначе
			ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
		КонецЕсли;
		ПараметрыФормы.Вставить("БИТ_АвтосозданиеДокумента", Истина);
		
		ОткрытьФорму(ПолноеИмяДокумента + ".Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения);
		//ИнтеграцияИСКлиент.ОткрытьФормуСозданияДокумента(ПолноеИмяДокумента, Объект.Ссылка, ЭтаФорма, ОписаниеОповещения, КорректировочныйДокумент);
		//ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки_БИТ, СтандартнаяОбработка_БИТ);
	Иначе
		Сообщить("Есть уже созданный документ на основании!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьСозданныйДокументМаркировкиТоваровИСМП()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркировкаТоваровИСМП.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|ГДЕ
		|	МаркировкаТоваровИСМП.ПометкаУдаления = ЛОЖЬ
		|	И МаркировкаТоваровИСМП.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции
