
&НаСервере
Процедура БИТ_ДоработкаПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПараметрыУказанияСерий") Тогда
		Если Параметры.ПараметрыУказанияСерий.Свойство("БИТ_АвтоПодбор") Тогда
			Попытка
				Объект.БИТ_ЗаказНаПроизводствоДляЗаказаНаЭмиссию = Параметры.ПроверяемыйДокумент.ДокументОснование.ЗаказНаПроизводство;
				Объект.БИТ_АвтоПодборДляДокументаПроизводства = Истина;
			Исключение
				Сообщить("Не удалось открыть проверку и подбор продукции автоматически");
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БИТ_ДоработкаПриОткрытииПосле(Отказ)
	Если Объект.БИТ_АвтоПодборДляДокументаПроизводства Тогда
		РежимПолученияКодов = "ОтчетОНанесении";
		ЗаказыНаЭмиссию = Новый Массив;
		ЗаказНаЭмиссиюОснование = ПолучитьОснованиеЗаказаНаЭмиссию();
		Если ЗаказНаЭмиссиюОснование = Неопределено Тогда
			ВызватьИсключение("Не найден документ основание заказа на эмиссию");
		КонецЕсли;
		ЗаказыНаЭмиссию.Добавить(ЗаказНаЭмиссиюОснование);
		Подключаемый_ПослеВыбораЗаказовНаЭмиссию(ЗаказыНаЭмиссию, РежимПолученияКодов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьОснованиеЗаказаНаЭмиссию()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	               |ГДЕ
	               |	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &ЗаказНаПроизводство
	               |	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", Объект.БИТ_ЗаказНаПроизводствоДляЗаказаНаЭмиссию);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено
	КонецЕсли;
КонецФункции
