
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ИсходнаяТЧ = Параметры.Запасы;
	Объект.ЗаказОснование = Параметры.ЗаказОснование; 
	Объект.Организация = Параметры.Организация;
    Объект.УспешноеСоздание = Ложь;
    
    // Заполняем данными из заказа
	Для каждого СтрокаТЧ Из ИсходнаяТЧ Цикл 
		
		Запрос = Новый Запрос;
	    Запрос.Текст = 
	    "ВЫБРАТЬ ПЕРВЫЕ 1
	    |	КомплектацииНоменклатуры.Ссылка КАК Комплектация
	    |ИЗ
	    |	Справочник.КомплектацииНоменклатуры КАК КомплектацииНоменклатуры
	    |ГДЕ
	    |	КомплектацииНоменклатуры.Владелец = &Номенклатура
	    |	И КомплектацииНоменклатуры.ПометкаУдаления = ЛОЖЬ
	    |	И КомплектацииНоменклатуры.Недействителен = ЛОЖЬ";
	    
	    Запрос.УстановитьПараметр("Номенклатура", СтрокаТЧ.Номенклатура);
	    Результат = Запрос.Выполнить();
	    Выборка = Результат.Выбрать();
	    
		Если Выборка.Следующий() Тогда
			Запрос = Новый Запрос;
		    Запрос.Текст = 
		    "ВЫБРАТЬ
		    |	КомплектацииНоменклатурыСостав.Номенклатура КАК Номенклатура,
		    |	КомплектацииНоменклатурыСостав.Количество КАК Количество,
		    |	КомплектацииНоменклатурыСостав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		    |	КомплектацииНоменклатурыСостав.Номенклатура.Штрихкод КАК НоменклатураШтрихкод
		    |ИЗ
		    |	Справочник.КомплектацииНоменклатуры.Состав КАК КомплектацииНоменклатурыСостав
		    |ГДЕ
		    |	КомплектацииНоменклатурыСостав.Ссылка = &Комплектация";
		    Запрос.УстановитьПараметр("Комплектация", Выборка.Комплектация);
		    Результат = Запрос.Выполнить();
		    Выборка = Результат.Выбрать();
			КоличествоСтрок = Результат.Выгрузить().Количество();
			Если КоличествоСтрок > 0 Тогда
				Пока Выборка.Следующий() Цикл
			        НоваяСтрока = Объект.ТаблицаФасовок.Добавить();
			        НоваяСтрока.Номенклатура = Выборка.Номенклатура;
					НоваяСтрока.Штрихкод = Выборка.НоменклатураШтрихкод;
					НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			        НоваяСтрока.Количество = СтрокаТЧ.Количество;
					//НоваяСтрока.ЭтоЧастьКомплектации = СтрокаТЧ.Номенклатура;
					//НоваяСтрока.БИТ_КлючСтроки = СтрокаТЧ.БИТ_КлючСтроки;
					// Инициализируем пустыми значениями
			        НоваяСтрока.Сотрудник = Неопределено;
			        НоваяСтрока.Статус = Неопределено;
			        НоваяСтрока.Станок = Неопределено;
				КонецЦикла;
			Иначе
				НоваяСтрока = Объект.ТаблицаФасовок.Добавить();
				НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
				НоваяСтрока.Штрихкод = СтрокаТЧ.Номенклатура.Штрихкод;
				НоваяСтрока.ЕдиницаИзмерения = СтрокаТЧ.ЕдиницаИзмерения;
		        НоваяСтрока.Количество = СтрокаТЧ.Количество; 
				//НоваяСтрока.ЭтоЧастьКомплектации = СтрокаТЧ.Номенклатура;
				//НоваяСтрока.БИТ_КлючСтроки = СтрокаТЧ.БИТ_КлючСтроки;
		        // Инициализируем пустыми значениями
		        НоваяСтрока.Сотрудник = Неопределено;
		        НоваяСтрока.Статус = Неопределено;
		        НоваяСтрока.Станок = Неопределено;
			КонецЕсли;
			
		Иначе
        	НоваяСтрока = Объект.ТаблицаФасовок.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
			НоваяСтрока.Штрихкод = СтрокаТЧ.Номенклатура.Штрихкод;
			НоваяСтрока.ЕдиницаИзмерения = СтрокаТЧ.ЕдиницаИзмерения;
	        НоваяСтрока.Количество = СтрокаТЧ.Количество;
			//НоваяСтрока.БИТ_КлючСтроки = СтрокаТЧ.БИТ_КлючСтроки;
	        // Инициализируем пустыми значениями
	        НоваяСтрока.Сотрудник = Неопределено;
	        НоваяСтрока.Статус = Неопределено;
	        НоваяСтрока.Станок = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	//нужно похожую номенклатуру спихнуть в одну строку с общим количеством
	ТабличнаяЧастьФасовок = Объект.ТаблицаФасовок.Выгрузить();
	
	// Измерения: Номенклатура, Характеристика. Ресурсы: Количество, Сумма.
	ТабличнаяЧастьФасовок.Свернуть("Номенклатура, ЕдиницаИзмерения", "Количество");

	//Загружаем свернутые данные обратно
	Объект.ТаблицаФасовок.Загрузить(ТабличнаяЧастьФасовок);
КонецПроцедуры 


&НаКлиенте
Процедура ЗаполнитьДляВсех(Команда)
    
    // Заполняет все строки значениями из шапки
    Для каждого Строка Из Объект.ТаблицаФасовок Цикл
        Если ЗначениеЗаполнено(Объект.СотрудникОбщий) Тогда
            Строка.Сотрудник = Объект.СотрудникОбщий;
        КонецЕсли;
        Если ЗначениеЗаполнено(Объект.СтанокОбщий) Тогда
            Строка.Станок = Объект.СтанокОбщий;
        КонецЕсли;
        Если ЗначениеЗаполнено(Объект.СтатусОбщий) Тогда
            Строка.Статус = Объект.СтатусОбщий;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
    
    // Проверяем заполнение хотя бы одной строки
    СтрокиЗаполнены = Истина;
    Для каждого Строка Из Объект.ТаблицаФасовок Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) ИЛИ Не ЗначениеЗаполнено(Строка.Количество) ИЛИ Не ЗначениеЗаполнено(Строка.Сотрудник) 
			ИЛИ Не ЗначениеЗаполнено(Строка.Статус) ИЛИ Не ЗначениеЗаполнено(Строка.Станок) Тогда
            СтрокиЗаполнены = Ложь;
            Прервать;
        КонецЕсли;
    КонецЦикла;
    
    Если Не СтрокиЗаполнены Тогда
        ПоказатьПредупреждение(,"Заполните данные по каждой строке!");
        Возврат;
    КонецЕсли;
    
    // Вызываем серверный метод создания
    МассивДокументов = СоздатьДокументыФасовкиНаСервере();
    
	Если МассивДокументов.Количество() > 0 Тогда
		Объект.УспешноеСоздание = Истина;
        Сообщить("Создано документов: " + МассивДокументов.Количество());
		Закрыть(Истина);
		Сообщить("Создано документов: " + МассивДокументов.Количество());
	Иначе
		Объект.УспешноеСоздание = Ложь;
		Закрыть(Ложь);
		Сообщить("Документы не созданы");
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция СоздатьДокументыФасовкиНаСервере()
    
    МассивДокументов = Новый Массив;
    
    Для каждого СтрокаДанных Из Объект.ТаблицаФасовок Цикл
        // Создаем документ фасовки
        Док = Документы.Фасовка.СоздатьДокумент();
		СтрокаНоменклатуры = Док.Продукция.Добавить();
        СтрокаНоменклатуры.Номенклатура = СтрокаДанных.Номенклатура;
		СтрокаНоменклатуры.ЕдиницаИзмерения = СтрокаДанных.ЕдиницаИзмерения;
        СтрокаНоменклатуры.Количество = СтрокаДанных.Количество;
		//СтрокаНоменклатуры.БИТ_КлючСтроки = СтрокаДанных.БИТ_КлючСтроки;
		//Если СтрокаДанных.ЭтоЧастьКомплектации <> Неопределено Тогда
		//	СтрокаНоменклатуры.ЭтоЧастьКомплектации = СтрокаДанных.ЭтоЧастьКомплектации;
		//КонецЕсли;
		
		//теперь у нас нет комплектации, только номенклатура с спецификацией, необходимо из нее добавить 1 элемент(само сырье)
		//находим первый элемент строки спецификации
		Запрос = Новый Запрос;
	    Запрос.Текст = 
	    "ВЫБРАТЬ ПЕРВЫЕ 1
	    |	СпецификацииСостав.Номенклатура КАК Номенклатура,
	    |	СпецификацииСостав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	    |	СпецификацииСостав.Количество КАК Количество,
	    |	СпецификацииСостав.Номенклатура.Штрихкод КАК НоменклатураШтрихкод
	    |ИЗ
	    |	РегистрСведений.СпецификацииПоУмолчанию КАК СпецификацииПоУмолчанию
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Спецификации.Состав КАК СпецификацииСостав
	    |		ПО СпецификацииПоУмолчанию.Спецификация = СпецификацииСостав.Ссылка
	    |ГДЕ
	    |	СпецификацииСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
	    |	И СпецификацииСостав.Ссылка.Недействителен = ЛОЖЬ
	    |	И СпецификацииПоУмолчанию.Номенклатура = &Номенклатура";
	    
	    Запрос.УстановитьПараметр("Номенклатура", СтрокаДанных.Номенклатура);
	    Результат = Запрос.Выполнить();
	    Выборка = Результат.Выбрать();
	    
		Если Выборка.Следующий() Тогда
			СтрокаНоменклатуры = Док.Продукция.Добавить();
	        СтрокаНоменклатуры.Номенклатура = Выборка.Номенклатура;
			СтрокаНоменклатуры.Штрихкод = Выборка.НоменклатураШтрихкод;
			СтрокаНоменклатуры.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
	        СтрокаНоменклатуры.Количество = Выборка.Количество*СтрокаДанных.Количество;
			СтрокаНоменклатуры.ЭтоМатериал = Истина;
		КонецЕсли;
		
		Док.СтатусДокумента = СтрокаДанных.Статус;
        Док.Автор = Пользователи.ТекущийПользователь();
		Док.Организация = Объект.Организация;
        Док.Станок = СтрокаДанных.Станок;
        Док.СтатусДокумента = СтрокаДанных.Статус;
		Док.Сотрудник = СтрокаДанных.Сотрудник;
        Док.ДокументОснование = Объект.ЗаказОснование;
		Док.Дата = ТекущаяДата();
		Док.Комментарий = "Документ создан обработкой";
        Док.Записать(РежимЗаписиДокумента.Запись);
        
        МассивДокументов.Добавить(Док.Ссылка);
        
    КонецЦикла;
    
    Возврат МассивДокументов;
    
КонецФункции 

&НаКлиенте
Процедура Отмена(Команда)
    Закрыть(Объект.УспешноеСоздание);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуСоздания(Команда)
    Закрыть(Объект.УспешноеСоздание);
КонецПроцедуры
