
&НаКлиенте
&После("ПослеЗаписи")
Процедура Бит_ДополнитьПослеЗаписи(ПараметрыЗаписи)
	
	Если ИспользоватьАвтоматическоеСозданиеЭмиссииПриПроведении() И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Док = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
		//Док.Дата = ТекущаяДата();
		//Док.Организация = ТекущийОбъект.Организация;
		//Док.ВидПродукции = Перечисления.ВидыПродукцииИС.СладостиИКондитерскиеИзделия; 
		//Док.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Производство;
		//Док.ПроизводственныйОбъект = ТекущийОбъект.СтруктурнаяЕдиница;
		//
		//Док.Ответственный = Пользователи.ТекущийПользователь();
		//Док.Комментарий = "Документ создан обработкой";
		//
		//Док.ДокументОснование = ТекущийОбъект;
		//
		//Для Каждого СтрокаДанных Из ТекущийОбъект.Продукция Цикл
		//	СтрокаНоменклатуры = Док.Продукция.Добавить();
		//	СтрокаНоменклатуры.Номенклатура = СтрокаДанных.Номенклатура;
		//	//СтрокаНоменклатуры.ЕдиницаИзмерения = СтрокаДанных.ЕдиницаИзмерения;
		//	//СтрокаНоменклатуры.Количество = СтрокаДанных.Количество;
		//КонецЦикла;
		//
		//Док.Записать(РежимЗаписиДокумента.Запись);
		Если Не ЕстьСозданныйДокументЭмиссии() Тогда
			НавигационнаяСсылкаФорматированнойСтроки_БИТ = "ИнтеграцияИС_КомандаНавигационнойСсылки#ИСМП#СоздатьОбъект#Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ";
			СтандартнаяОбработка_БИТ = Истина;
			ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки_БИТ, СтандартнаяОбработка_БИТ);
			//СобытияФормИСУНФКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки_БИТ,СтандартнаяОбработка_БИТ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИспользоватьАвтоматическоеСозданиеЭмиссииПриПроведении()
	Возврат Константы.БИТ_ИспользоватьАвтосозданиеЭмиссии.Получить();
КонецФункции

&НаСервере
Функция ЕстьСозданныйДокументЭмиссии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|ГДЕ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &ДокументОснование
		|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции