&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЭтаФорма.Окно.Состояние = ВариантСостоянияОкна.Максимизированное;
	//ВариантСпособаОтображенияОкна = ЭтаФорма.ВариантСпособаОтображенияОкна.Максимизированное;
	
	РазрешеноЗакрытиеФормы = Ложь;
	
	Если Параметры.Свойство("ПроизводствоОснование") Тогда
		Объект.ПроизводствоСсылка = Параметры.ПроизводствоОснование;
		Объект.ЗаказПокупателяСсылка = Объект.ПроизводствоСсылка.ЗаказПокупателя;
		Объект.Контрагент = Объект.ЗаказПокупателяСсылка.Контрагент;
		Если Объект.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("РВБ ООО") Тогда
			Объект.ИспользуемыйСклад = 2;
		ИначеЕсли Объект.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("ИНТЕРНЕТ РЕШЕНИЯ ООО") Тогда 
			Объект.ИспользуемыйСклад = 1;
		Иначе
			ВызватьИсключение("Неверный контрагент в заказе покупателя, необходимо указать РВБ ООО или ИНТЕРНЕТ РЕШЕНИЯ ООО");
		КонецЕсли;
	Иначе
		ВызватьИсключение("Нет основания документа производства или заказа покупателя!");
	КонецЕсли;
	
    // Получаем переданную строку ТЧ
    Если Параметры.Свойство("ПродукцияТЧ") И Параметры.Свойство("БИТ_КлючСтроки") Тогда
        ТекущаяСтрокаТЧ = Параметры.ПродукцияТЧ.НайтиСтроки(Новый Структура("БИТ_КлючСтроки",Параметры.БИТ_КлючСтроки))[0];
		Объект.КоличествоНоменклатуры = ТекущаяСтрокаТЧ.Количество;
		Объект.БИТ_КлючСтроки = Параметры.БИТ_КлючСтроки;
		Если ТекущаяСтрокаТЧ.Сотрудник = Неопределено ИЛИ ТекущаяСтрокаТЧ.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
			ВызватьИсключение("Не заполнен сотрудник по текущей строке!");
		Иначе
			Объект.ОтветственныйСотрудник = ТекущаяСтрокаТЧ.Сотрудник;
		КонецЕсли;
		Если ТекущаяСтрокаТЧ.ЗонаУпаковки = Неопределено ИЛИ ТекущаяСтрокаТЧ.ЗонаУпаковки = Справочники.Сотрудники.ПустаяСсылка() Тогда
			ВызватьИсключение("Не заполнена ЗонаУпаковки по текущей строке!");
		Иначе
			Объект.ОтветственнаяЗона = ТекущаяСтрокаТЧ.ЗонаУпаковки;
		КонецЕсли;
	Иначе
		ВызватьИсключение("Не выбрана текущая строка!");
    КонецЕсли;
    
    // Сохраняем данные строки (используем правильные имена реквизитов из формы)
    Объект.ТекущаяНоменклатура = ТекущаяСтрокаТЧ.Номенклатура;
	
	//Что имеем!!!!!!!!!!!!!!
	//Объект.ПроизводствоСсылка - сам документ производства
	//Объект.ЗаказПокупателяСсылка - сам документ заказа покупателя 
	//Объект.Контрагент - значение контрагента из заказа покупателя(для склада)
	//Объект.ТекущаяСтрокаТЧ - текущая строка ТЧ производства
	//Объект.ТекущаяНоменклатура - текущая номенклатура в текущей строке
	//Объект.ЭтапСборки : 0 - нет записей в регистре, "начать упаковку"
	//                    1 - есть записи в регистре, но неизвестно отсканированные "продолжить упаковку"
	//                    2 - все отсканированы, "упаковка завершена"
	//                    3 - есть отсканенные в короба, "продолжить упаковку короба"
	//                    4 - все в короба отсканены, "упаковка в короба завершена"
	Объект.ЭтапСборки = 0;
	ТаблицаЗначенийУпаковки = ПолучитьТаблицуЗначенийИзРегистраУпаковкаПродукцииКодыМаркировки(Объект.ПроизводствоСсылка, Параметры.БИТ_КлючСтроки);
	Если ТаблицаЗначенийУпаковки.Количество() = 0 Тогда
		#Область НачальнаяЗаписьВРегистр
		////////////////////////////////////////////////////////////////
		//НАЧАЛЬНАЯ СТАДИЯ, запись в регистр значений кодов маркировки//
		///////////////////////////////////////////////////////////////
		ЭтоНаборНоменклатуры = НоменклатураЭтоНабор(Объект.ТекущаяНоменклатура);
		Если ЭтоНаборНоменклатуры = Неопределено Тогда
			ВызватьИсключение("Не найден штрихкод номенклатуры или ОписаниеGTINИС!");
		КонецЕсли;
		Если ЭтоНаборНоменклатуры Тогда
			//Работаем с текущей номенклатурой набором
			НоменклатураGTINНабора = ПолучитьGTINНоменклатуры(Объект.ТекущаяНоменклатура);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПулКодовМаркировкиСУЗ.Номенклатура КАК Номенклатура,
			|	ПулКодовМаркировкиСУЗ.GTIN КАК GTIN,
			|	ПулКодовМаркировкиСУЗ.КодМаркировки КАК КодМаркировки,
			|	ПулКодовМаркировкиСУЗ.ШтрихкодУпаковки КАК ШтрихкодУпаковки
			|ИЗ
			|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
			|ГДЕ
			|	ПулКодовМаркировкиСУЗ.ДокументОснование = &ЗаказНаПроизводство
			|	И ПулКодовМаркировкиСУЗ.GTIN = &НоменклатураGTINНабора";

			Запрос.УстановитьПараметр("ЗаказНаПроизводство", Объект.ПроизводствоСсылка.ЗаказНаПроизводство);
			Запрос.УстановитьПараметр("НоменклатураGTINНабора", НоменклатураGTINНабора);
			Результат = Запрос.Выполнить();
			ТаблицаКодовНаборов = Результат.Выгрузить();
			ТаблицаКодовНаборов.Колонки.Добавить("НомерНабора");
			ТаблицаКодовНаборов.Колонки.Добавить("Тип");
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНаборов Цикл
				СтрокаТаблицы.Тип = "Набор";
			КонецЦикла;
			НомерНабораВТаблице = 1;
			Для Каждого СтрокаТаблицыНаборов Из ТаблицаКодовНаборов Цикл
				СтрокаТаблицыНаборов.НомерНабора = НомерНабораВТаблице;
				НомерНабораВТаблице = НомерНабораВТаблице + 1;
			КонецЦикла;
			ИндексСтроки = 0;
			Пока ИндексСтроки <> НомерНабораВТаблице-1 Цикл
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПулКодовМаркировкиСУЗ.Номенклатура КАК Номенклатура,
				|	ПулКодовМаркировкиСУЗ.GTIN КАК GTIN,
				|	ПулКодовМаркировкиСУЗ.КодМаркировки КАК КодМаркировки,
				|	ПулКодовМаркировкиСУЗ.ШтрихкодУпаковки КАК ШтрихкодУпаковки
				|ИЗ
				|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
				|ГДЕ
				|	ПулКодовМаркировкиСУЗ.ДокументОснование = &ЗаказНаПроизводство
				|	И ПулКодовМаркировкиСУЗ.GTIN <> &НоменклатураGTINНабора
				|	И ПулКодовМаркировкиСУЗ.ШтрихкодУпаковки = &ШтрихкодУпаковки";

				Запрос.УстановитьПараметр("ЗаказНаПроизводство", Объект.ПроизводствоСсылка.ЗаказНаПроизводство);
				Запрос.УстановитьПараметр("НоменклатураGTINНабора", НоменклатураGTINНабора);
				Запрос.УстановитьПараметр("ШтрихкодУпаковки", ТаблицаКодовНаборов[ИндексСтроки].ШтрихкодУпаковки);
				Результат = Запрос.Выполнить();
				ТаблицаКодовТоваровУНабора = Результат.Выгрузить();
				Для Каждого СтрокаТаблицыКодовТоваровУНабора Из ТаблицаКодовТоваровУНабора Цикл 
					НоваяСтрока = ТаблицаКодовНаборов.Добавить();
					НоваяСтрока.Номенклатура = СтрокаТаблицыКодовТоваровУНабора.Номенклатура; 
					НоваяСтрока.GTIN = СтрокаТаблицыКодовТоваровУНабора.GTIN;
					НоваяСтрока.КодМаркировки = СтрокаТаблицыКодовТоваровУНабора.КодМаркировки;
					НоваяСтрока.ШтрихкодУпаковки = СтрокаТаблицыКодовТоваровУНабора.ШтрихкодУпаковки;
					НоваяСтрока.НомерНабора = ТаблицаКодовНаборов[ИндексСтроки].НомерНабора;
					НоваяСтрока.Тип = "ЧастьНабора";
				КонецЦикла;
				ИндексСтроки = ИндексСтроки + 1;
			КонецЦикла;
			
			ТаблицаКодовНаборов.Сортировать("НомерНабора");
			ТаблицаКодовНаборов.Колонки.Добавить("Отсканировано"); 
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНаборов Цикл
				СтрокаТаблицы.Отсканировано = Ложь;
			КонецЦикла;
			ТаблицаКодовНаборов.Колонки.Добавить("ДокументОснование");
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНаборов Цикл
				СтрокаТаблицы.ДокументОснование = Объект.ПроизводствоСсылка;
			КонецЦикла;
			ТаблицаКодовНаборов.Колонки.Добавить("НомерСтрокиВДокументеОсновании");
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНаборов Цикл
				СтрокаТаблицы.НомерСтрокиВДокументеОсновании = Параметры.БИТ_КлючСтроки;
			КонецЦикла;
			ТаблицаКодовНаборов.Колонки.Добавить("ИндексСтроки");
			ИндексСтроки_Бит = 0;
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНаборов Цикл
				СтрокаТаблицы.ИндексСтроки = ИндексСтроки_Бит;
				ИндексСтроки_Бит = ИндексСтроки_Бит + 1;
			КонецЦикла;
			ТаблицаКодовНаборов.Колонки.Добавить("Период");
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНаборов Цикл
				СтрокаТаблицы.Период = ТекущаяДата();
			КонецЦикла;
			ЗаписатьВРегистрСведенийУпаковкаПродукцииКодыМаркировки(ТаблицаКодовНаборов);
				
				
			//ТаблицаКодовНаборов = ЗаполнитьНаборыКодамиМаркировки(ТаблицаКодовНаборов);
			
		Иначе
			//Работаем с текущей номенклатурой обычной
			НоменклатураGTIN = ПолучитьGTINНоменклатуры(Объект.ТекущаяНоменклатура);
			/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПулКодовМаркировкиСУЗ.Номенклатура КАК Номенклатура,
			|	ПулКодовМаркировкиСУЗ.GTIN КАК GTIN,
			|	ПулКодовМаркировкиСУЗ.КодМаркировки КАК КодМаркировки,
			|	ПулКодовМаркировкиСУЗ.ШтрихкодУпаковки КАК ШтрихкодУпаковки
			|ИЗ
			|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
			|ГДЕ
			|	ПулКодовМаркировкиСУЗ.ДокументОснование = &ЗаказНаПроизводство
			|	И ПулКодовМаркировкиСУЗ.GTIN = &НоменклатураGTIN
			|	И ЕСТЬNULL(ПулКодовМаркировкиСУЗ.ШтрихкодУпаковки.ЗначениеШтрихкода, """") = """"";  //чем отличается часть набора от дойпака
			
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	ПулКодовМаркировкиСУЗ.Номенклатура КАК Номенклатура,
			//|	ПулКодовМаркировкиСУЗ.GTIN КАК GTIN,
			//|	ПулКодовМаркировкиСУЗ.КодМаркировки КАК КодМаркировки,
			//|	ПулКодовМаркировкиСУЗ.ШтрихкодУпаковки КАК ШтрихкодУпаковки
			//|ИЗ
			//|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
			//|ГДЕ
			//|	ПулКодовМаркировкиСУЗ.ДокументОснование = &ЗаказНаПроизводство
			//|	И ПулКодовМаркировкиСУЗ.GTIN = &НоменклатураGTIN";
			
			Запрос.УстановитьПараметр("ЗаказНаПроизводство", Объект.ПроизводствоСсылка.ЗаказНаПроизводство);
			Запрос.УстановитьПараметр("НоменклатураGTIN", НоменклатураGTIN);
			Результат = Запрос.Выполнить();
			ТаблицаКодовНоменклатуры = Результат.Выгрузить();
			ТаблицаКодовНоменклатуры.Колонки.Добавить("НомерНабора");
			ТаблицаКодовНоменклатуры.Колонки.Добавить("Тип");
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНоменклатуры Цикл
				СтрокаТаблицы.Тип = "Дойпак";
				СтрокаТаблицы.НомерНабора = 0;
			КонецЦикла;
			
			ТаблицаКодовНоменклатуры.Колонки.Добавить("Отсканировано"); 
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНоменклатуры Цикл
				СтрокаТаблицы.Отсканировано = Ложь;
			КонецЦикла;
			ТаблицаКодовНоменклатуры.Колонки.Добавить("ДокументОснование");
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНоменклатуры Цикл
				СтрокаТаблицы.ДокументОснование = Объект.ПроизводствоСсылка;
			КонецЦикла;
			ТаблицаКодовНоменклатуры.Колонки.Добавить("НомерСтрокиВДокументеОсновании");
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНоменклатуры Цикл
				СтрокаТаблицы.НомерСтрокиВДокументеОсновании = Параметры.БИТ_КлючСтроки;
			КонецЦикла;
			ТаблицаКодовНоменклатуры.Колонки.Добавить("ИндексСтроки");
			ИндексСтроки_Бит = 0;
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНоменклатуры Цикл
				СтрокаТаблицы.ИндексСтроки = ИндексСтроки_Бит;
				ИндексСтроки_Бит = ИндексСтроки_Бит + 1;
			КонецЦикла;
			ТаблицаКодовНоменклатуры.Сортировать("ИндексСтроки");
			ТаблицаКодовНоменклатуры.Колонки.Добавить("Период");
			Для Каждого СтрокаТаблицы Из ТаблицаКодовНоменклатуры Цикл
				СтрокаТаблицы.Период = ТекущаяДата();
			КонецЦикла;
			ЗаписатьВРегистрСведенийУпаковкаПродукцииКодыМаркировки(ТаблицаКодовНоменклатуры);
			//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
			
		КонецЕсли;
		Объект.ЭтапСборки = 1;
		#КонецОбласти
		
		Если Объект.ИспользуемыйСклад = 1 Тогда
			СоздатьШтрихкодыДляКоробовОЗОН();
		КонецЕсли;
		
		ТаблицаМонопаллетов = ПолучитьТаблицуВсехМоноПаллетовПоДокументу();
		Если ТаблицаМонопаллетов <> Неопределено Тогда
			Если Объект.ИспользуемыйСклад = 2 И ТаблицаМонопаллетов.Количество() > 0 Тогда
				СоздатьШтрихкодыДляКоробовВБПриМонопаллете();
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Если ВсяУпаковкаЗавершена() Тогда
			Элементы.НачатьУпаковку.Заголовок = "Упаковка завершена";
			Объект.ЭтапСборки = 2;
			Если НачатаУпаковкаВКороба() Тогда
				Объект.ЭтапСборки = 3;
				Элементы.НачатьУпаковку.Заголовок = "Начать/Продолжить упаковку в короба";
				Элементы.ПоказатьДеревоЗначений.Видимость = Истина;
				Элементы.ПоказатьДеревоЗначений.Доступность = Истина;
				Если ВсяУпаковкаВКоробаЗавершена() Тогда
					Объект.ЭтапСборки = 4;
					Элементы.НачатьУпаковку.Заголовок = "Упаковка в короба завершена";
				КонецЕсли;
			Иначе
				Элементы.ПоказатьДеревоЗначений.Видимость = Ложь;
				Элементы.ПоказатьДеревоЗначений.Доступность = Ложь;
			КонецЕсли;
		Иначе
			Элементы.ПоказатьДеревоЗначений.Видимость = Ложь;
			Элементы.ПоказатьДеревоЗначений.Доступность = Ложь;
			Элементы.НачатьУпаковку.Заголовок = "Начать/Продолжить упаковку";
			Объект.ЭтапСборки = 1;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗавершениеРаботы И НЕ РазрешеноЗакрытиеФормы Тогда
		Сообщить("Разрешено закрытие формы только через кнопку ""Возврат к документу""");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуВсехМоноПаллетовПоДокументу()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыМонопаллетов.Период КАК Период,
	|	ШтрихкодыМонопаллетов.ДокументОснование КАК ДокументОснование,
	|	ШтрихкодыМонопаллетов.ШтрихкодМонопаллета КАК ШтрихкодМонопаллета,
	|	ШтрихкодыМонопаллетов.НоменклатураДляМонопаллета КАК НоменклатураДляМонопаллета,
	|	ШтрихкодыМонопаллетов.БаркодТовара КАК БаркодТовара,
	|	ШтрихкодыМонопаллетов.ПорядковыйНомерМонопаллета КАК ПорядковыйНомерМонопаллета,
	|	ШтрихкодыМонопаллетов.ШтрихкодПаллета КАК ШтрихкодПаллета
	|ИЗ
	|	РегистрСведений.ШтрихкодыМонопаллетов КАК ШтрихкодыМонопаллетов
	|ГДЕ
	|	ШтрихкодыМонопаллетов.ДокументОснование = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодМонопаллета,
	|	ПорядковыйНомерМонопаллета";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ЗаказПокупателяСсылка);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		// Логирование ошибки (опционально)
		// ЗаписьЖурналаРегистрации("Ошибка запроса паллет", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	//Есть ли данные в результате
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Выгрузка результата с обработкой ошибок
	Попытка
		ТаблицаМонопаллетов = РезультатЗапроса.Выгрузить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ТаблицаМонопаллетов;
	
КонецФункции

&НаСервере
Процедура СоздатьШтрихкодыДляКоробовВБПриМонопаллете();
	СсылкаЗаказПокупателя = Объект.ЗаказПокупателяСсылка;
	Номенклатура = Объект.ТекущаяНоменклатура;
	БаркодТовара = Номенклатура.Штрихкод;
	
	//необходимо понять сколько коробов генерировать
	ОбщееКоличествоНоменклатуры = Объект.КоличествоНоменклатуры;
	КоличествоВОдномКоробеВКарточкеНоменклатуры = ПолучитьЗначениеДопРеквизитаКороб(Номенклатура);
	Если КоличествоВОдномКоробеВКарточкеНоменклатуры = Неопределено ИЛИ КоличествоВОдномКоробеВКарточкеНоменклатуры = 0 Тогда
		ВызватьИсключение("Не задано кол-во коробов в карточке номенклатуры!");
	КонецЕсли;
	НужноКоробов = Цел(ОбщееКоличествоНоменклатуры/КоличествоВОдномКоробеВКарточкеНоменклатуры);
	ДробнаяЧасть = ОбщееКоличествоНоменклатуры/КоличествоВОдномКоробеВКарточкеНоменклатуры;
	Если  НужноКоробов <> ДробнаяЧасть Тогда
		НужноКоробов = НужноКоробов + 1;
	КонецЕсли;
	
	//генерируем новое количество
	МассивШККоробовВБ = СгенерироватьШККоробовВБПриМонопаллетах(НужноКоробов);
	
	//Формируем таблицу значений для записи в регистр
	ТаблицаЗначенийШККоробов = Новый ТаблицаЗначений;
	ТаблицаЗначенийШККоробов.Колонки.Добавить("Период");
	ТаблицаЗначенийШККоробов.Колонки.Добавить("ДокументОснование");
	ТаблицаЗначенийШККоробов.Колонки.Добавить("ШККороба");
	ТаблицаЗначенийШККоробов.Колонки.Добавить("ПорядковыйНомерКороба");
	ТаблицаЗначенийШККоробов.Колонки.Добавить("БаркодТовара");
	ТаблицаЗначенийШККоробов.Колонки.Добавить("Номенклатура");
	Номер = 1;
	Пока Номер <> НужноКоробов+1 Цикл
		Стр = ТаблицаЗначенийШККоробов.Добавить();
		Стр.Период = ТекущаяДата();
		Стр.ДокументОснование = СсылкаЗаказПокупателя;
		Стр.ШККороба = МассивШККоробовВБ[Номер-1];
		Стр.ПорядковыйНомерКороба = Номер;
		Стр.БаркодТовара = БаркодТовара;
		Стр.Номенклатура = Номенклатура;
		Номер = Номер+1;
	КонецЦикла;
	
	//теперь записываем ТаблицаЗначенийШККоробов
	
	//Получаем значения для отбора из первой строки
	ДокументОснование = ТаблицаЗначенийШККоробов[0].ДокументОснование;
	//ШККороба = ТаблицаЗначенийШККоробов[0].ШККороба;
	
	// Пакетная запись в регистр
	НаборЗаписей = РегистрыСведений.ДанныеПоКоробам.СоздатьНаборЗаписей();
	
	//Пакетная запись в регистр (удаляем старые записи по этому документу, записываем новые)
	НаборЗаписей.Отбор.ДокументОснование.Установить(ДокументОснование);
	//НаборЗаписей.Отбор.ШККороба.Установить(ШККороба);
	
	НаборЗаписей.Прочитать();      // Читаем старые записи по этому отбору
	НаборЗаписей.Загрузить(ТаблицаЗначенийШККоробов);  // Загружаем новые данные
	НаборЗаписей.Записать(Ложь); // Истина = замещать старые записи новыми
	
	Сообщить("Данные успешно записаны в регистр ДанныеПоКоробам. Записей: " + ТаблицаЗначенийШККоробов.Количество() + ". Можно приступать к работе!");
	
	
Конецпроцедуры

&НаСервере
Процедура СоздатьШтрихкодыДляКоробовОЗОН();
	СсылкаЗаказПокупателя = Объект.ЗаказПокупателяСсылка;
	Номенклатура = Объект.ТекущаяНоменклатура;
	БаркодТовара = Номенклатура.Штрихкод;
	
	//необходимо понять сколько коробов генерировать
	ОбщееКоличествоНоменклатуры = Объект.КоличествоНоменклатуры;
	КоличествоВОдномКоробеВКарточкеНоменклатуры = ПолучитьЗначениеДопРеквизитаКороб(Номенклатура);
	Если КоличествоВОдномКоробеВКарточкеНоменклатуры = Неопределено ИЛИ КоличествоВОдномКоробеВКарточкеНоменклатуры = 0 Тогда
		ВызватьИсключение("Не задано кол-во коробов в карточке номенклатуры!");
	КонецЕсли;
	НужноКоробов = Цел(ОбщееКоличествоНоменклатуры/КоличествоВОдномКоробеВКарточкеНоменклатуры);
	ДробнаяЧасть = ОбщееКоличествоНоменклатуры/КоличествоВОдномКоробеВКарточкеНоменклатуры;
	Если  НужноКоробов <> ДробнаяЧасть Тогда
		НужноКоробов = НужноКоробов + 1;
	КонецЕсли;
	
	//генерируем новое количество
	МассивШККоробовОЗОН = СгенерироватьШККоробовОЗОН(НужноКоробов);
	
	//Формируем таблицу значений для записи в регистр
	ТаблицаЗначенийШККоробов = Новый ТаблицаЗначений;
	ТаблицаЗначенийШККоробов.Колонки.Добавить("Период");
	ТаблицаЗначенийШККоробов.Колонки.Добавить("ДокументОснование");
	ТаблицаЗначенийШККоробов.Колонки.Добавить("ШККороба");
	ТаблицаЗначенийШККоробов.Колонки.Добавить("ПорядковыйНомерКороба");
	ТаблицаЗначенийШККоробов.Колонки.Добавить("БаркодТовара");
	ТаблицаЗначенийШККоробов.Колонки.Добавить("Номенклатура");
	Номер = 1;
	Пока Номер <> НужноКоробов+1 Цикл
		Стр = ТаблицаЗначенийШККоробов.Добавить();
		Стр.Период = ТекущаяДата();
		Стр.ДокументОснование = СсылкаЗаказПокупателя;
		Стр.ШККороба = МассивШККоробовОЗОН[Номер-1];
		Стр.ПорядковыйНомерКороба = Номер;
		Стр.БаркодТовара = БаркодТовара;
		Стр.Номенклатура = Номенклатура;
		Номер = Номер+1;
	КонецЦикла;
	
	//теперь записываем ТаблицаЗначенийШККоробов
	
	//Получаем значения для отбора из первой строки
	ДокументОснование = ТаблицаЗначенийШККоробов[0].ДокументОснование;
	//ШККороба = ТаблицаЗначенийШККоробов[0].ШККороба;
	
	// Пакетная запись в регистр
	НаборЗаписей = РегистрыСведений.ДанныеПоКоробам.СоздатьНаборЗаписей();
	
	//Пакетная запись в регистр (удаляем старые записи по этому документу, записываем новые)
	НаборЗаписей.Отбор.ДокументОснование.Установить(ДокументОснование);
	//НаборЗаписей.Отбор.ШККороба.Установить(ШККороба);
	
	НаборЗаписей.Прочитать();      // Читаем старые записи по этому отбору
	НаборЗаписей.Загрузить(ТаблицаЗначенийШККоробов);  // Загружаем новые данные
	НаборЗаписей.Записать(Ложь); // Истина = замещать старые записи новыми
	
	Сообщить("Данные успешно записаны в регистр ДанныеПоКоробам. Записей: " + ТаблицаЗначенийШККоробов.Количество() + ". Можно приступать к работе!");
	
	
Конецпроцедуры

&НаСервере
Функция СгенерироватьШККоробовОЗОН(НужноКоробов)
	
	//сначала находим последний сгенерированный
	//префикс = ZN_ + числовое значение = 10 последних символов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(СОКРЛ(ПРАВ(ДанныеПоКоробам.ШККороба, 10)) КАК СТРОКА(10)) КАК ШККороба
	               |ИЗ
	               |	РегистрСведений.ДанныеПоКоробам КАК ДанныеПоКоробам
	               |ГДЕ
	               |	ЛЕВ(ДанныеПоКоробам.ШККороба, 3) ПОДОБНО &Префикс + ""%""
	               |	И ЕСТЬNULL(ДанныеПоКоробам.ШККороба, """") <> """"";
	Запрос.УстановитьПараметр("Префикс", "ZN_");

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ПоследнийНомерШККороба = 0;
	Если Выборка.Количество() = 0 Тогда//у нас нет еще ШКОзона, создаем первые
		ПоследнийНомерШККороба = 0;
	Иначе//у нас есть созданные, начинаем поиск максимального 
		ТаблицаЗначенийЧиселШККоробов = Новый ТаблицаЗначений;
		ТаблицаЗначенийЧиселШККоробов.Колонки.Добавить("ШККороба");
		Пока Выборка.Следующий() Цикл
			Стр = ТаблицаЗначенийЧиселШККоробов.Добавить();
			Стр.ШККороба = (ЧИСЛО(Выборка.ШККороба));
		КонецЦикла;
		ТаблицаЗначенийЧиселШККоробов.Сортировать("ШККороба Убыв");
		ПоследнийНомерШККороба = ТаблицаЗначенийЧиселШККоробов[0].ШККороба;
	КонецЕсли;
	
	//теперь добавляем следующие номера
	МассивНовыхШК = Новый Массив;
	Номер = 1;
	Пока Номер <> НужноКоробов+1 Цикл
		МассивНовыхШК.Добавить(Строка(ПоследнийНомерШККороба + Номер));
		Номер = Номер+1;
	КонецЦикла;
	
	//теперь каждый номер нужно преобразовать в строку с нулями, всего длина = 10
	ПреобразованныйМассив = Новый Массив;
	Для Каждого НовыйШК Из МассивНовыхШК Цикл
		НеобходимаяДлина = 10 - СтрДлина(НовыйШК);
		СтрокаНулей = Лев("0000000000", НеобходимаяДлина);
		НовыйНомер = СтрокаНулей + СтрЗаменить(НовыйШК, " ", "");
		
		ПреобразованныйМассив.Добавить("ZN_" + НовыйНомер);
	КонецЦикла;
	
	Возврат ПреобразованныйМассив;
	
КонецФункции

&НаСервере
Функция СгенерироватьШККоробовВБПриМонопаллетах(НужноКоробов)
	
	//сначала находим последний сгенерированный
	//префикс = WM_ + числовое значение = 10 последних символов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(СОКРЛ(ПРАВ(ДанныеПоКоробам.ШККороба, 10)) КАК СТРОКА(10)) КАК ШККороба
	               |ИЗ
	               |	РегистрСведений.ДанныеПоКоробам КАК ДанныеПоКоробам
	               |ГДЕ
	               |	ЛЕВ(ДанныеПоКоробам.ШККороба, 3) ПОДОБНО &Префикс + ""%""
	               |	И ЕСТЬNULL(ДанныеПоКоробам.ШККороба, """") <> """"";
	Запрос.УстановитьПараметр("Префикс", "WM_");

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ПоследнийНомерШККороба = 0;
	Если Выборка.Количество() = 0 Тогда//у нас нет еще ШКОзона, создаем первые
		ПоследнийНомерШККороба = 0;
	Иначе//у нас есть созданные, начинаем поиск максимального 
		ТаблицаЗначенийЧиселШККоробов = Новый ТаблицаЗначений;
		ТаблицаЗначенийЧиселШККоробов.Колонки.Добавить("ШККороба");
		Пока Выборка.Следующий() Цикл
			Стр = ТаблицаЗначенийЧиселШККоробов.Добавить();
			Стр.ШККороба = (ЧИСЛО(Выборка.ШККороба));
		КонецЦикла;
		ТаблицаЗначенийЧиселШККоробов.Сортировать("ШККороба Убыв");
		ПоследнийНомерШККороба = ТаблицаЗначенийЧиселШККоробов[0].ШККороба;
	КонецЕсли;
	
	//теперь добавляем следующие номера
	МассивНовыхШК = Новый Массив;
	Номер = 1;
	Пока Номер <> НужноКоробов+1 Цикл
		МассивНовыхШК.Добавить(Строка(ПоследнийНомерШККороба + Номер));
		Номер = Номер+1;
	КонецЦикла;
	
	//теперь каждый номер нужно преобразовать в строку с нулями, всего длина = 10
	ПреобразованныйМассив = Новый Массив;
	Для Каждого НовыйШК Из МассивНовыхШК Цикл
		НеобходимаяДлина = 10 - СтрДлина(НовыйШК);
		СтрокаНулей = Лев("0000000000", НеобходимаяДлина);
		НовыйНомер = СтрокаНулей + СтрЗаменить(НовыйШК, " ", "");
		
		ПреобразованныйМассив.Добавить("WM_" + НовыйНомер);
	КонецЦикла;
	
	Возврат ПреобразованныйМассив;
	
КонецФункции

&НаСервере
Функция НоменклатураЭтоНабор(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|ОписаниеGTINИС.ВидУпаковки КАК ВидУпаковки
	|ИЗ
	|	РегистрСведений.ОписаниеGTINИС КАК ОписаниеGTINИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ШтрихкодыНоменклатуры.Штрихкод = ОписаниеGTINИС.GTIN
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Выборка.Следующий() Тогда
		Если Выборка.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьGTINНоменклатуры(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОписаниеGTINИС.GTIN КАК GTIN
	               |ИЗ
	               |	РегистрСведений.ОписаниеGTINИС КАК ОписаниеGTINИС
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |		ПО (ШтрихкодыНоменклатуры.Штрихкод = ОписаниеGTINИС.GTIN)
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Выборка.Следующий() Тогда
		Возврат Выборка.GTIN;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаписатьВРегистрСведенийУпаковкаПродукцииКодыМаркировки(ТаблицаКодов)
	// ---------------------------------------------------------------------------------
	// Запись данных в регистр сведений УпаковкаПродукцииКодыМаркировки
	// ---------------------------------------------------------------------------------
	// Проверка, что таблица не пустая
	Если ТаблицаКодов.Количество() = 0 Тогда
		Сообщить("Нет данных для записи в регистр");
		Возврат;
	КонецЕсли;
	
	// Получаем значения для отбора из первой строки
	ДокументОснование = ТаблицаКодов[0].ДокументОснование;
	НомерСтроки = ТаблицаКодов[0].НомерСтрокиВДокументеОсновании;
	
	// Пакетная запись в регистр
	НаборЗаписей = РегистрыСведений.УпаковкаПродукцииКодыМаркировки.СоздатьНаборЗаписей();
	
	//Пакетная запись в регистр (удаляем старые записи по этому документу, записываем новые)
	НаборЗаписей.Отбор.ДокументОснование.Установить(ДокументОснование);
	НаборЗаписей.Отбор.НомерСтрокиВДокументеОсновании.Установить(НомерСтроки);
	
	НаборЗаписей.Прочитать();      // Читаем старые записи по этому отбору
	НаборЗаписей.Загрузить(ТаблицаКодов);  // Загружаем новые данные
	НаборЗаписей.Записать(Истина); // Истина = замещать старые записи новыми
	
	Сообщить("Данные успешно записаны в регистр УпаковкаПродукцииКодыМаркировки. Записей: " + ТаблицаКодов.Количество() + ". Можно приступать к работе!");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьВРСУпакованныеКороба(ШККороба)
	// ---------------------------------------------------------------------------------
	// Запись данных в регистр сведений УпакованныеКороба
	// ---------------------------------------------------------------------------------
	
	// Получаем значения для отбора
	ДокументОснование = Объект.ПроизводствоСсылка;
	
	// Пакетная запись в регистр
	НаборЗаписей = РегистрыСведений.УпакованныеКороба.СоздатьНаборЗаписей();
	
	//Пакетная запись в регистр (удаляем старые записи по этому документу, записываем новые)
	НаборЗаписей.Отбор.ДокументОснование.Установить(ДокументОснование);
	НаборЗаписей.Отбор.ШККороба.Установить(ШККороба);
	
	НаборЗаписей.Прочитать();      // Читаем старые записи по этому отбору
	
	//формируем таблицу значений для записи
	ТаблицаУпакованныхКоробов = Новый ТаблицаЗначений;
	ТаблицаУпакованныхКоробов.Колонки.Добавить("Период");
	ТаблицаУпакованныхКоробов.Колонки.Добавить("ДокументОснование");
	ТаблицаУпакованныхКоробов.Колонки.Добавить("ШККороба");
	ТекСтр = ТаблицаУпакованныхКоробов.Добавить();
	ТекСтр.Период = ТекущаяДата();
	ТекСтр.ДокументОснование = ДокументОснование;
	ТекСтр.ШККороба = ШККороба;
	
	
	НаборЗаписей.Загрузить(ТаблицаУпакованныхКоробов);  // Загружаем новые данные
	НаборЗаписей.Записать(Истина); // Истина = замещать старые записи новыми
	
	Сообщить("Данные успешно записаны в регистр УпакованныеКороба. Записей: " + ТаблицаУпакованныхКоробов.Количество() + ".");
	
КонецПроцедуры

&НаСервере
Функция ВсяУпаковкаЗавершена()
    ТаблицаЗначенийУпаковки = ПолучитьТаблицуЗначенийИзРегистраУпаковкаПродукцииКодыМаркировки(Объект.ПроизводствоСсылка, Объект.БИТ_КлючСтроки);
	Для каждого СтрокаТаблицы Из ТаблицаЗначенийУпаковки Цикл 
		Если Не СтрокаТаблицы.Отсканировано Тогда
			Возврат Ложь; 
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

&НаСервере
Функция ВсяУпаковкаВКоробаЗавершена()
    ТаблицаЗначенийУпаковки = ПолучитьТаблицуЗначенийИзРегистраУпаковкаПродукцииКодыМаркировки(Объект.ПроизводствоСсылка, Объект.БИТ_КлючСтроки);
	Для каждого СтрокаТаблицы Из ТаблицаЗначенийУпаковки Цикл 
		Если Не СтрокаТаблицы.СобраноВКороб Тогда
			Возврат Ложь; 
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

&НаСервере
Функция НачатаУпаковкаВКороба()
    ТаблицаЗначенийУпаковки = ПолучитьТаблицуЗначенийИзРегистраУпаковкаПродукцииКодыМаркировки(Объект.ПроизводствоСсылка, Объект.БИТ_КлючСтроки);
	Для каждого СтрокаТаблицы Из ТаблицаЗначенийУпаковки Цикл 
		Если СтрокаТаблицы.СобраноВКороб Тогда
			Возврат Истина; 
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция ПолучитьТаблицуЗначенийИзРегистраУпаковкаПродукцииКодыМаркировки(ДокументОснование, НомерСтрокиВДокументеОсновании)
	
	// Создаем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкаПродукцииКодыМаркировки.ИндексСтроки КАК ИндексСтроки,
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование КАК ДокументОснование,
	|	УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании КАК НомерСтрокиВДокументеОсновании,
	|	УпаковкаПродукцииКодыМаркировки.Номенклатура КАК Номенклатура,
	|	УпаковкаПродукцииКодыМаркировки.GTIN КАК GTIN,
	|	УпаковкаПродукцииКодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	УпаковкаПродукцииКодыМаркировки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	УпаковкаПродукцииКодыМаркировки.НомерНабора КАК НомерНабора,
	|	УпаковкаПродукцииКодыМаркировки.Тип КАК Тип,
	|	УпаковкаПродукцииКодыМаркировки.Отсканировано КАК Отсканировано,
	|	УпаковкаПродукцииКодыМаркировки.ШтрихкодКороба КАК ШтрихкодКороба,
	|	УпаковкаПродукцииКодыМаркировки.СобраноВКороб КАК СобраноВКороб
	|ИЗ
	|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|ГДЕ
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование = &ДокументОснование
	|	И УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании = &НомерСтрокиВДокументеОсновании
	|
	|УПОРЯДОЧИТЬ ПО
	|	УпаковкаПродукцииКодыМаркировки.ИндексСтроки";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("НомерСтрокиВДокументеОсновании", НомерСтрокиВДокументеОсновании);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаСервере
Функция ПолучитьИзРегистраУпаковкаПродукцииКодыМаркировкиУнабора(ДокументОснование, НомерСтрокиВДокументеОсновании, НомерНабора)
	
	// Создаем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкаПродукцииКодыМаркировки.ИндексСтроки КАК ИндексСтроки,
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование КАК ДокументОснование,
	|	УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании КАК НомерСтрокиВДокументеОсновании,
	|	УпаковкаПродукцииКодыМаркировки.Номенклатура КАК Номенклатура,
	|	УпаковкаПродукцииКодыМаркировки.GTIN КАК GTIN,
	|	УпаковкаПродукцииКодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	УпаковкаПродукцииКодыМаркировки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	УпаковкаПродукцииКодыМаркировки.НомерНабора КАК НомерНабора,
	|	УпаковкаПродукцииКодыМаркировки.Тип КАК Тип,
	|	УпаковкаПродукцииКодыМаркировки.Отсканировано КАК Отсканировано
	|ИЗ
	|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|ГДЕ
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование = &ДокументОснование
	|	И УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании = &НомерСтрокиВДокументеОсновании
	|	И УпаковкаПродукцииКодыМаркировки.НомерНабора = &НомерНабора
	|	И УпаковкаПродукцииКодыМаркировки.Тип = ""ЧастьНабора""
	|
	|УПОРЯДОЧИТЬ ПО
	|	УпаковкаПродукцииКодыМаркировки.ИндексСтроки";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("НомерСтрокиВДокументеОсновании", НомерСтрокиВДокументеОсновании);
	Запрос.УстановитьПараметр("НомерНабора", НомерНабора);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаСервере
Функция ПолучитьКодыМаркировки()
	//получаем ТаблицаЗначений всего РС по строке в производстве, уже отсортировано по индексу
	ТаблицаЗначенийУпаковки = ПолучитьТаблицуЗначенийИзРегистраУпаковкаПродукцииКодыМаркировки(Объект.ПроизводствоСсылка, Объект.БИТ_КлючСтроки);
	//проверяем сразу на количество
	Если ТаблицаЗначенийУпаковки.Количество() < 1 Тогда
		Сообщить("по текущей строке не создана упаковка, регистр сведений УпаковкаПродукцииКодыМаркировки не заполнен");
		Возврат Неопределено;
	КонецЕсли;
	
	//создаем структуру для передачи параметров
	МассивКодовМаркировкиНеотсканированных = Новый Массив;
	ПараметрыДляВводаКода = Новый Структура;
	ПараметрыДляВводаКода.Вставить("МассивКодовМаркировкиНеотсканированных", МассивКодовМаркировкиНеотсканированных);
	ПараметрыДляВводаКода.Вставить("Тип", "");
	ПараметрыДляВводаКода.Вставить("НоменклатураСборки", "");
	ПараметрыДляВводаКода.Вставить("ШтрихкодНоменклатураСборки", "");
	
	
	//теперь надо по первой строке определить тип - у первой строки может быть только набор или Дойпак
	//Если набор - проверяем отсканированные, находим не отсканированный
	Если ТаблицаЗначенийУпаковки[0].Тип = "Набор" Тогда
		
		Для Каждого СтрокаТаблицыЗначенийУпаковки Из ТаблицаЗначенийУпаковки Цикл
			//Нужно найти неотсканированный набор 
			Если СтрокаТаблицыЗначенийУпаковки.Отсканировано = Истина Тогда//если отсканирован, идем к следующему
				Продолжить;
			Иначе//проверяем все ли отсканированы КМ у набора, сам набор сканируется последним
				ТаблицаЗначенийНабора = ПолучитьИзРегистраУпаковкаПродукцииКодыМаркировкиУнабора(Объект.ПроизводствоСсылка, Объект.БИТ_КлючСтроки, СтрокаТаблицыЗначенийУпаковки.НомерНабора);
				ВсеОтсканированы = Истина;
				Для Каждого СтрокаТаблицыНабора Из ТаблицаЗначенийНабора Цикл
					Если СтрокаТаблицыНабора.Отсканировано = Ложь Тогда//формируем массив неотсканированных у набора
						ПараметрыДляВводаКода.МассивКодовМаркировкиНеотсканированных.Добавить(СтрокаТаблицыНабора.КодМаркировки);
						ВсеОтсканированы = Ложь;
					КонецЕсли;
				КонецЦикла;
				Если ВсеОтсканированы Тогда //передаем сам КМ набора и прерываем цикл
					ПараметрыДляВводаКода.МассивКодовМаркировкиНеотсканированных.Добавить(СтрокаТаблицыЗначенийУпаковки.КодМаркировки);
					ПараметрыДляВводаКода.Тип = "Набор";
					ПараметрыДляВводаКода.НоменклатураСборки = СтрокаТаблицыЗначенийУпаковки.Номенклатура;
					ПараметрыДляВводаКода.ШтрихкодНоменклатураСборки = СтрокаТаблицыЗначенийУпаковки.Номенклатура.Штрихкод;
					Прервать;
				КонецЕсли;
				ПараметрыДляВводаКода.Тип = "ЧастьНабора";
				ПараметрыДляВводаКода.НоменклатураСборки = СтрокаТаблицыЗначенийУпаковки.Номенклатура;
				ПараметрыДляВводаКода.ШтрихкодНоменклатураСборки = СтрокаТаблицыЗначенийУпаковки.Номенклатура.Штрихкод;
				Прервать; //тогда есть неотсканированные, их уже добавили в массив, прерываем цикл
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТаблицаЗначенийУпаковки[0].Тип = "Дойпак" Тогда //если дойпак - у нас нужно просто добавить неотсканированные КМ
		
		Для Каждого СтрокаТаблицыЗначенийУпаковки Из ТаблицаЗначенийУпаковки Цикл
			Если СтрокаТаблицыЗначенийУпаковки.Отсканировано = Ложь Тогда
				ПараметрыДляВводаКода.МассивКодовМаркировкиНеотсканированных.Добавить(СтрокаТаблицыЗначенийУпаковки.КодМаркировки);
			КонецЕсли;
		КонецЦикла;
		ПараметрыДляВводаКода.Тип = "Дойпак";
		ПараметрыДляВводаКода.НоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура;
		ПараметрыДляВводаКода.ШтрихкодНоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура.Штрихкод;
		
	КонецЕсли;
	
	//передаем структуру
	Возврат ПараметрыДляВводаКода;
КонецФункции

&НаСервере
Процедура НДЭ()
	Если Объект.ИспользуемыйСклад = 1 Тогда
			СоздатьШтрихкодыДляКоробовОЗОН();
		КонецЕсли;
		
		ТаблицаМонопаллетов = ПолучитьТаблицуВсехМоноПаллетовПоДокументу();
		Если ТаблицаМонопаллетов <> Неопределено Тогда
			Если Объект.ИспользуемыйСклад = 2 И ТаблицаМонопаллетов.Количество() > 0 Тогда
				СоздатьШтрихкодыДляКоробовВБПриМонопаллете();
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачатьУпаковку(Команда)
	
	//НДЭ();
	
	Если ВсяУпаковкаЗавершена() Тогда
		Если НачатаУпаковкаВКороба() Тогда
			Если ВсяУпаковкаВКоробаЗавершена() Тогда
				ОзвучитьТекст("Все отгрузочные короба собраны");
				Сообщить("упаковка строки полностью завершена");
				Возврат;
			Иначе
				НачатьИлиПродолжитьУпаковкуВКороба();
			КонецЕсли;
		Иначе
			ТекстВопроса = "Упаковка полностью завершена, все КМ отсканированы. Начать упаковку в короба?";
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗавершениеУпаковкиВопросЗавершен", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;//обязательно прерываем
		КонецЕсли;
	Иначе
		НачатьИлиПродолжитьУпаковкуПоНаборам();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачатьИлиПродолжитьУпаковкуПоНаборам()
	//если набор
	//Необходимо брать первый набор, проверять у него отсканированные части набора, если нет - передавать, если да - следующий набор и из него дойпак, передача массива
	//
	//если дойпак
	//передавать массив неотсканенных
	//РАБОТАЕМ ТОЛЬКО С КОДАМИ МАРКИРОВКИ - ПЕРЕДАЧА МАССИВА ДОЙПАКОВ ИЛИ ЧАСТЕЙ НАБОРА, ЕСЛИ НАБОР - ПАРАМЕТР КОДА МАРКИРОВКИ НАБОРА
	//ПОЧЕМУ:
	//у наборов - одинаковый GTIN(по номенклатуре)
	//у наборов и частей набора - одинаковый штрихкод упаковки(уникальный) и номер набора(только по ид строки)
	//у частей набора - одинаковый GTIN(по номенклатуре)
	//дойпак
	//одинаковый GTIN(по номенклатуре), нет штрихкода упаковки 
	
	//в РС так же есть 3 типа(Набор, ЧастьНабора, Дойпак), "Отсканировано"
	
	////озвучиваем количество номер сколько уже упаковано в короб
		КоличествоУпакованных = ПолучитьКоличествоОтсканированных();
		КоличествоВсехКодовМаркировки = ПолучитьКоличествоВсехКодовМаркировкиПоСтроке();
		//ОзвучитьТекст(Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВсехКодовМаркировки) + " собрано в упаковку");
		СтрокаНумерацииУпакованных = Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВсехКодовМаркировки) + " собрано в упаковку";
		//Сообщить(Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВсехКодовМаркировки) + " собрано в упаковку");
	
	//РАЗРАБОТКА - сначала получаем коды маркировки массив не отсканенных + доп параметры - если набор - код маркировки набора, так же тип передаем
	ПараметрыСтруктура = ПолучитьКодыМаркировки();
	Если ПараметрыСтруктура = Неопределено Тогда
		Сообщить("нет данных по регистр сведений УпаковкаПродукцииКодыМаркировки");
		Возврат;
	КонецЕсли;
	ПараметрыСтруктура.Вставить("СтрокаНумерацииУпакованных", СтрокаНумерацииУпакованных);
	
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКодаМаркировки", ЭтотОбъект);
	ОткрытьФорму("Обработка.УпаковкаПродукции.Форма.ВводКода", ПараметрыСтруктура, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НачатьИлиПродолжитьУпаковкуВКороба()
	Элементы.ПоказатьДеревоЗначений.Видимость = Истина;
	Элементы.ПоказатьДеревоЗначений.Доступность = Истина;
	//если набор
	//Необходимо брать все наборы КМ не упакованных, так же смотреть на каком коробе остановились-  передача массива
	//
	//если дойпак
	//передавать массив всех дойпаков
	
	//в РС так же есть 3 типа(Набор, ЧастьНабора, Дойпак), "Отсканировано"
	
	//РАЗРАБОТКА - сначала получаем коды маркировки массив не отсканенных + доп параметры - если набор - код маркировки набора, так же тип передаем
	ПараметрыСтруктура = ПолучитьКодыМаркировкиДляКороба();
	Если ПараметрыСтруктура = Неопределено Тогда
		Сообщить("Ошибка ПриПолученииКодовМаркировки для коробов");
		Возврат;
	КонецЕсли;
	ПараметрыСтруктура.Вставить("ИспользуемыйСклад", Объект.ИспользуемыйСклад);
	
	ПараметрыПослеУдачногоВвода = Новый Структура;
	ПараметрыПослеУдачногоВвода.Вставить("ШККороба",ПараметрыСтруктура.ШККороба);
	ПараметрыПослеУдачногоВвода.Вставить("ВыводитьПечатьШККороба", ПараметрыСтруктура.ВыводитьПечатьШККороба);
	
	////озвучиваем количество номер сколько уже упаковано в короб
	КоличествоУпакованных = ПолучитьКоличествоУпакованныхВКороб(ПараметрыСтруктура.ШККороба);
	КоличествоВОдномКоробеВКарточкеНоменклатуры = ПолучитьЗначениеДопРеквизитаКороб(Объект.ТекущаяНоменклатура);
	//ОзвучитьТекст(Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВОдномКоробеВКарточкеНоменклатуры) + " собрано в короб");
	СтрокаНумерацииУпакованных = Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВОдномКоробеВКарточкеНоменклатуры) + " собрано в короб";
	//Сообщить(Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВОдномКоробеВКарточкеНоменклатуры) + " собрано в короб");
	ПараметрыСтруктура.Вставить("СтрокаНумерацииУпакованных", СтрокаНумерацииУпакованных);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКодаМаркировкиДляКороба", ЭтотОбъект, ПараметрыПослеУдачногоВвода);
	ОткрытьФорму("Обработка.УпаковкаПродукции.Форма.ВводКороба", ПараметрыСтруктура, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьКодыМаркировкиДляКороба()
	//получаем ТаблицаЗначений всего РС по строке в производстве, уже отсортировано по индексу
	ТаблицаЗначенийУпаковки = ПолучитьТаблицуЗначенийИзРегистраУпаковкаПродукцииКодыМаркировки(Объект.ПроизводствоСсылка, Объект.БИТ_КлючСтроки);
	//проверяем сразу на количество
	Если ТаблицаЗначенийУпаковки.Количество() < 1 Тогда
		Сообщить("по текущей строке не создана упаковка, регистр сведений УпаковкаПродукцииКодыМаркировки не заполнен");
		Возврат Неопределено;
	КонецЕсли;
	
	//проверяем короба соответствие
	//сначала по карточке номенклатуры
	ОбщееКоличествоНоменклатуры = Объект.КоличествоНоменклатуры;
	КоличествоВОдномКоробеВКарточкеНоменклатуры = ПолучитьЗначениеДопРеквизитаКороб(Объект.ТекущаяНоменклатура);
	Если КоличествоВОдномКоробеВКарточкеНоменклатуры = Неопределено ИЛИ КоличествоВОдномКоробеВКарточкеНоменклатуры = 0 Тогда
		Сообщить("Не задано кол-во коробов в карточке номенклатуры!");
		Возврат Неопределено;
	КонецЕсли;
	НужноКоробов = Цел(ОбщееКоличествоНоменклатуры/КоличествоВОдномКоробеВКарточкеНоменклатуры);
	ДробнаяЧасть = ОбщееКоличествоНоменклатуры/КоличествоВОдномКоробеВКарточкеНоменклатуры;
	Если  НужноКоробов <> ДробнаяЧасть Тогда
		НужноКоробов = НужноКоробов + 1;
	КонецЕсли;
	//после по зарезервированным штрихкодам коробов
	ТаблицаЗначенийКоробовПоНоменклатуре = ПолучитьТаблицуЗначенийКоробов(ТаблицаЗначенийУпаковки[0].Номенклатура.Штрихкод);//по первому можно, так как отсортировано
	Если ТаблицаЗначенийКоробовПоНоменклатуре.Количество() < 1 Тогда
		Сообщить("по текущей строке не заполнен регистр сведений ДанныеПоКоробам!");
		Возврат Неопределено;
	КонецЕсли;
	ЗарезервированноеКоличествоКоробов = ТаблицаЗначенийКоробовПоНоменклатуре[ТаблицаЗначенийКоробовПоНоменклатуре.Количество()-1].ПорядковыйНомерКороба;//таблица отсортирована по возрастанию
	//сравнием их для надежности
	Если ЗарезервированноеКоличествоКоробов <> НужноКоробов Тогда
		Сообщить("ЗарезервированноеКоличествоКоробов не совпадает с НеобходимымКоличествомКоробов: " + ЗарезервированноеКоличествоКоробов + "<>" + НужноКоробов);
		Возврат Неопределено;
	КонецЕсли;
	/////////////////////////////////
	//Проверки прошли
	//ТаблицаЗначенийУпаковки - вся тч по маркировкам с коробами
	//ТаблицаЗначенийКоробовПоНоменклатуре - вся тч по ШККороба и номером
	//ЗарезервированноеКоличествоКоробов - сколько нужно коробов
	//КоличествоВОдномКоробеВКарточкеНоменклатуры
	
	//создаем структуру для передачи параметров
	МассивКодовМаркировкиНеУпакованных = Новый Массив;
	ПараметрыДляВводаКороба = Новый Структура;
	ПараметрыДляВводаКороба.Вставить("МассивКодовМаркировкиНеУпакованных", МассивКодовМаркировкиНеУпакованных);
	ПараметрыДляВводаКороба.Вставить("Тип", "");
	ПараметрыДляВводаКороба.Вставить("ШККороба", "");
	ПараметрыДляВводаКороба.Вставить("НоменклатураСборки", "");
	ПараметрыДляВводаКороба.Вставить("ШтрихкодНоменклатураСборки", "");
	ПараметрыДляВводаКороба.Вставить("ВыводитьПечатьШККороба", Ложь);
	
	////////////////////////////////
	//теперь нужно проверить начата ли упаковка
	Если НачатаУпаковкаВКороба() Тогда
		//нужно найти на каком шк коробе остановились
		ТаблицаЗначенийИспользованныхКоробов = ПолучитьШККоробовИспользованных();
		Если ТаблицаЗначенийИспользованныхКоробов.Количество() < 1 Тогда
			Сообщить("не удалось получить таблицу использованных коробов");
			Возврат неопределено;
		КонецЕсли;
		ПоследнийИспользованныйШККоробаПоПорядку = ТаблицаЗначенийИспользованныхКоробов[ТаблицаЗначенийИспользованныхКоробов.Количество()-1].ШтрихкодКороба;
		ПараметрыДляВводаКороба.ШККороба = ПоследнийИспользованныйШККоробаПоПорядку;
		ПоследнийПорядковыйНомерКоробаПоПорядку = ТаблицаЗначенийИспользованныхКоробов[ТаблицаЗначенийИспользованныхКоробов.Количество()-1].ПорядковыйНомерКороба;
		//теперь нужно проверить все ли упаковано в этот короб и является ли он последним
		Если ПоследнийПорядковыйНомерКоробаПоПорядку = ЗарезервированноеКоличествоКоробов Тогда
			//последний короб может быть заполнен не полностью, нужно найти наборы неупакованные и их полный массив передать
			Если ТаблицаЗначенийУпаковки[0].Тип = "Набор" Тогда
				
				Для Каждого СтрокаТаблицыЗначенийУпаковки Из ТаблицаЗначенийУпаковки Цикл
					Если СтрокаТаблицыЗначенийУпаковки.СобраноВКороб = Истина Тогда //на часть набора первым попасть не можем, таблица отсортирована
						Продолжить;
					ИначеЕсли СтрокаТаблицыЗначенийУпаковки.Тип = "Набор" Тогда
						ПараметрыДляВводаКороба.МассивКодовМаркировкиНеУпакованных.Добавить(СтрокаТаблицыЗначенийУпаковки.КодМаркировки);
					КонецЕсли;
				КонецЦикла;
				ПараметрыДляВводаКороба.Тип = "Набор";
				ПараметрыДляВводаКороба.НоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура;
				ПараметрыДляВводаКороба.ШтрихкодНоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура.Штрихкод;
				
			ИначеЕсли ТаблицаЗначенийУпаковки[0].Тип = "Дойпак" Тогда
				
				Для Каждого СтрокаТаблицыЗначенийУпаковки Из ТаблицаЗначенийУпаковки Цикл
					Если СтрокаТаблицыЗначенийУпаковки.СобраноВКороб = Истина Тогда //передаем все НеУпакованные
						Продолжить;
					ИначеЕсли СтрокаТаблицыЗначенийУпаковки.Тип = "Дойпак" Тогда
						ПараметрыДляВводаКороба.МассивКодовМаркировкиНеУпакованных.Добавить(СтрокаТаблицыЗначенийУпаковки.КодМаркировки);
					КонецЕсли;
				КонецЦикла;
				ПараметрыДляВводаКороба.Тип = "Дойпак";
				ПараметрыДляВводаКороба.НоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура;
				ПараметрыДляВводаКороба.ШтрихкодНоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура.Штрихкод;
				
			КонецЕсли;
			//получаем шкКороба последнего
			ПараметрыДляВводаКороба.ШККороба = ТаблицаЗначенийКоробовПоНоменклатуре[ЗарезервированноеКоличествоКоробов-1].ШККороба
			
		Иначе
			//если у нас какой то короб, но не последний, надо посмотреть сколько в него еще умещается - для этого получить уже Упакованные и сравнить с вмещением
			Если ТаблицаЗначенийУпаковки[0].Тип = "Набор" Тогда
				
				ТаблицаЗначенийУпакованных = ПолучитьТаблицуЗначенийУпакованныхВКороб(ПоследнийИспользованныйШККоробаПоПорядку, "Набор");
				СколькоУжеУпакованоПоШККоробу = ТаблицаЗначенийУпакованных.Количество();
				Если КоличествоВОдномКоробеВКарточкеНоменклатуры = СколькоУжеУпакованоПоШККоробу Тогда//если уже укомплектован этот короб, то получаем следующий 
					
					ФлагНайденного = Ложь;
					Для Каждого СтрокаТаблицаЗначенийКоробовПоНоменклатуре Из ТаблицаЗначенийКоробовПоНоменклатуре Цикл
						Если ФлагНайденного Тогда
							ПараметрыДляВводаКороба.ШККороба = СтрокаТаблицаЗначенийКоробовПоНоменклатуре.ШККороба;
							Прервать;
						КонецЕсли;
						Если СтрокаТаблицаЗначенийКоробовПоНоменклатуре.ШККороба = ПоследнийИспользованныйШККоробаПоПорядку Тогда
							ФлагНайденного = Истина;
						КонецЕсли;
					КонецЦикла;
					Для Каждого СтрокаТаблицыЗначенийУпаковки Из ТаблицаЗначенийУпаковки Цикл
						Если СтрокаТаблицыЗначенийУпаковки.СобраноВКороб = Истина Тогда //на часть набора первым попасть не можем, таблица отсортирована
							Продолжить;
						ИначеЕсли СтрокаТаблицыЗначенийУпаковки.Тип = "Набор" Тогда
							ПараметрыДляВводаКороба.МассивКодовМаркировкиНеУпакованных.Добавить(СтрокаТаблицыЗначенийУпаковки.КодМаркировки);
						КонецЕсли;
					КонецЦикла;
					ПараметрыДляВводаКороба.Тип = "Набор";
					ПараметрыДляВводаКороба.НоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура;
					ПараметрыДляВводаКороба.ШтрихкодНоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура.Штрихкод;
					
				Иначе
					
					Для Каждого СтрокаТаблицыЗначенийУпаковки Из ТаблицаЗначенийУпаковки Цикл
					Если СтрокаТаблицыЗначенийУпаковки.СобраноВКороб = Истина Тогда //на часть набора первым попасть не можем, таблица отсортирована
						Продолжить;
					ИначеЕсли СтрокаТаблицыЗначенийУпаковки.Тип = "Набор" Тогда
						ПараметрыДляВводаКороба.МассивКодовМаркировкиНеУпакованных.Добавить(СтрокаТаблицыЗначенийУпаковки.КодМаркировки);
					КонецЕсли;
					КонецЦикла;
					ПараметрыДляВводаКороба.Тип = "Набор";
					ПараметрыДляВводаКороба.НоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура;
					ПараметрыДляВводаКороба.ШтрихкодНоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура.Штрихкод;
					Если КоличествоВОдномКоробеВКарточкеНоменклатуры - СколькоУжеУпакованоПоШККоробу = 1 Тогда//печатаем ШК короба, если не хватает всего одного дойпака
						ПараметрыДляВводаКороба.ВыводитьПечатьШККороба = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ТаблицаЗначенийУпаковки[0].Тип = "Дойпак" Тогда
				
				ТаблицаЗначенийУпакованных = ПолучитьТаблицуЗначенийУпакованныхВКороб(ПоследнийИспользованныйШККоробаПоПорядку, "Дойпак");
				СколькоУжеУпакованоПоШККоробу = ТаблицаЗначенийУпакованных.Количество();
				Если КоличествоВОдномКоробеВКарточкеНоменклатуры = СколькоУжеУпакованоПоШККоробу Тогда//если уже укомплектован этот короб, то получаем следующий 
					
					ФлагНайденного = Ложь;
					Для Каждого СтрокаТаблицаЗначенийКоробовПоНоменклатуре Из ТаблицаЗначенийКоробовПоНоменклатуре Цикл
						Если ФлагНайденного Тогда
							ПараметрыДляВводаКороба.ШККороба = СтрокаТаблицаЗначенийКоробовПоНоменклатуре.ШККороба;
							Прервать;
						КонецЕсли;
						Если СтрокаТаблицаЗначенийКоробовПоНоменклатуре.ШККороба = ПоследнийИспользованныйШККоробаПоПорядку Тогда
							ФлагНайденного = Истина;
						КонецЕсли;
					КонецЦикла;
					
					Для Каждого СтрокаТаблицыЗначенийУпаковки Из ТаблицаЗначенийУпаковки Цикл
						Если СтрокаТаблицыЗначенийУпаковки.СобраноВКороб = Истина Тогда //на часть набора первым попасть не можем, таблица отсортирована
							Продолжить;
						ИначеЕсли СтрокаТаблицыЗначенийУпаковки.Тип = "Дойпак" Тогда
							ПараметрыДляВводаКороба.МассивКодовМаркировкиНеУпакованных.Добавить(СтрокаТаблицыЗначенийУпаковки.КодМаркировки);
						КонецЕсли;
					КонецЦикла;
					ПараметрыДляВводаКороба.Тип = "Дойпак";
					ПараметрыДляВводаКороба.НоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура;
					ПараметрыДляВводаКороба.ШтрихкодНоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура.Штрихкод;
					
				Иначе
					
					Для Каждого СтрокаТаблицыЗначенийУпаковки Из ТаблицаЗначенийУпаковки Цикл
						Если СтрокаТаблицыЗначенийУпаковки.СобраноВКороб = Истина Тогда //на часть набора первым попасть не можем, таблица отсортирована
							Продолжить;
						ИначеЕсли СтрокаТаблицыЗначенийУпаковки.Тип = "Дойпак" Тогда
							ПараметрыДляВводаКороба.МассивКодовМаркировкиНеУпакованных.Добавить(СтрокаТаблицыЗначенийУпаковки.КодМаркировки);
						КонецЕсли;
					КонецЦикла;
					ПараметрыДляВводаКороба.Тип = "Дойпак";
					ПараметрыДляВводаКороба.НоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура;
					ПараметрыДляВводаКороба.ШтрихкодНоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура.Штрихкод;
					Если КоличествоВОдномКоробеВКарточкеНоменклатуры - СколькоУжеУпакованоПоШККоробу = 1 Тогда//печатаем ШК короба, если не хватает всего одного дойпака
						ПараметрыДляВводаКороба.ВыводитьПечатьШККороба = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		//Нужно получить первый шк короба, передать Наборы массив или Дойпаки массив
		//ШККоробаПервый Передали
		ПараметрыДляВводаКороба.ШККороба = ТаблицаЗначенийКоробовПоНоменклатуре[0].ШККороба;
		
		//определяем массив какой передавать - массив наборов КМ или массив дойпаков КМ
		Если ТаблицаЗначенийУпаковки[0].Тип = "Набор" Тогда
			
			ПараметрыДляВводаКороба.Тип = "Набор";
			ПараметрыДляВводаКороба.НоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура; 
			ПараметрыДляВводаКороба.ШтрихкодНоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура.Штрихкод;
			//если набор - передаем массив наборов
			Для Каждого СтрокаТаблицыЗначенийУпаковки Из ТаблицаЗначенийУпаковки Цикл
				//Нужно найти наборы
				Если СтрокаТаблицыЗначенийУпаковки.Тип = "ЧастьНабора" Тогда//если ЧастьНабора, идем к следующему
					Продолжить;
				Иначе//добавляем в Массив
					ПараметрыДляВводаКороба.МассивКодовМаркировкиНеУпакованных.Добавить(СтрокаТаблицыЗначенийУпаковки.КодМаркировки);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ТаблицаЗначенийУпаковки[0].Тип = "Дойпак" Тогда //если дойпак - у нас нужно просто добавить все КМ
			
			Для Каждого СтрокаТаблицыЗначенийУпаковки Из ТаблицаЗначенийУпаковки Цикл
				ПараметрыДляВводаКороба.МассивКодовМаркировкиНеУпакованных.Добавить(СтрокаТаблицыЗначенийУпаковки.КодМаркировки);
			КонецЦикла;
			ПараметрыДляВводаКороба.Тип = "Дойпак";
			ПараметрыДляВводаКороба.НоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура;
			ПараметрыДляВводаКороба.ШтрихкодНоменклатураСборки = ТаблицаЗначенийУпаковки[0].Номенклатура.Штрихкод;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Если у нас остался один - печатаем ШК
	Если ПараметрыДляВводаКороба.МассивКодовМаркировкиНеУпакованных.Количество() = 1 Тогда
		ПараметрыДляВводаКороба.ВыводитьПечатьШККороба = Истина;
	КонецЕсли; 
	
	//но если у нас несколько дойпаков передается и у нас в короб влезает только один - тоже печатаем
	
	//передаем структуру
	Возврат ПараметрыДляВводаКороба;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуЗначенийКоробов(НоменклатураGTIN)
	// Создаем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПоКоробам.ШККороба КАК ШККороба,
	|	ДанныеПоКоробам.ПорядковыйНомерКороба КАК ПорядковыйНомерКороба
	|ИЗ
	|	РегистрСведений.ДанныеПоКоробам КАК ДанныеПоКоробам
	|ГДЕ
	|	ДанныеПоКоробам.ДокументОснование = &ДокументОснование
	|	И ДанныеПоКоробам.БаркодТовара = &НоменклатураGTIN
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомерКороба";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ЗаказПокупателяСсылка);
	Запрос.УстановитьПараметр("НоменклатураGTIN", НоменклатураGTIN);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	
	Возврат ТаблицаЗначений;
КонецФункции

&НаСервере
Функция ПолучитьТаблицуЗначенийУпакованныхВКороб(ШтрихкодКороба, Тип)
	// Создаем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкаПродукцииКодыМаркировки.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|ГДЕ
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование = &ДокументОснование
	|	И УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании = &НомерСтрокиВДокументеОсновании
	|	И УпаковкаПродукцииКодыМаркировки.ШтрихкодКороба = &ШтрихкодКороба
	|	И УпаковкаПродукцииКодыМаркировки.Тип = &Тип";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ПроизводствоСсылка);
	Запрос.УстановитьПараметр("НомерСтрокиВДокументеОсновании", Объект.БИТ_КлючСтроки);
	Запрос.УстановитьПараметр("ШтрихкодКороба", ШтрихкодКороба);
	Запрос.УстановитьПараметр("Тип", Тип);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	
	Возврат ТаблицаЗначений;
КонецФункции

&НаСервере
Функция ПолучитьШККоробовИспользованных()
	// Создаем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УпаковкаПродукцииКодыМаркировки.ШтрихкодКороба КАК ШтрихкодКороба
	|ПОМЕСТИТЬ ШККоробов
	|ИЗ
	|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|ГДЕ
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование = &ДокументОснование
	|	И УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании = &НомерСтрокиВДокументеОсновании
	|	И УпаковкаПродукцииКодыМаркировки.СобраноВКороб = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШККоробов.ШтрихкодКороба КАК ШтрихкодКороба,
	|	ДанныеПоКоробам.ПорядковыйНомерКороба КАК ПорядковыйНомерКороба
	|ИЗ
	|	ШККоробов КАК ШККоробов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоКоробам КАК ДанныеПоКоробам
	|		ПО ШККоробов.ШтрихкодКороба = ДанныеПоКоробам.ШККороба
	|ГДЕ
	|	ДанныеПоКоробам.ДокументОснование = &ДокументОснованиеЗаказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомерКороба";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ПроизводствоСсылка);
	Запрос.УстановитьПараметр("ДокументОснованиеЗаказ", Объект.ЗаказПокупателяСсылка);
	Запрос.УстановитьПараметр("НомерСтрокиВДокументеОсновании", Объект.БИТ_КлючСтроки);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	
	Возврат ТаблицаЗначений;
КонецФункции

&НаСервере
Функция ПолучитьКоличествоУпакованныхВКороб(ШтрихкодКороба)
	// Создаем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкаПродукцииКодыМаркировки.СобраноВКороб КАК СобраноВКороб,
	|	УпаковкаПродукцииКодыМаркировки.Тип КАК Тип
	|ИЗ
	|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|ГДЕ
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование = &ДокументОснование
	|	И УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании = &НомерСтрокиВДокументеОсновании
	|	И УпаковкаПродукцииКодыМаркировки.СобраноВКороб = ИСТИНА
	|	И УпаковкаПродукцииКодыМаркировки.ШтрихкодКороба = &ШтрихкодКороба";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ПроизводствоСсылка);
	Запрос.УстановитьПараметр("НомерСтрокиВДокументеОсновании", Объект.БИТ_КлючСтроки);
	Запрос.УстановитьПараметр("ШтрихкодКороба", ШтрихкодКороба);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	КоличествоНаборов = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Тип = "Набор" Тогда
			КоличествоНаборов = КоличествоНаборов + 1;
		КонецЕсли;
	КонецЦикла;
	Если КоличествоНаборов = 0 Тогда
		ТаблицаЗначений = Результат.Выгрузить();
		Возврат ТаблицаЗначений.Количество();
	КонецЕсли;
	Возврат КоличествоНаборов;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеДопРеквизитаКороб(НоменклатураСсылка)
	 
	ОбъектНоменклатуры = НоменклатураСсылка.ПолучитьОбъект();
	
	ЭлементПВХ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "КолвоВОтгрузочнойКоробке_46ce489ccc8b43f1a0f2ee82e9be3e64");
	 Если ЭлементПВХ.Пустая() Тогда
        Возврат Неопределено;
	КонецЕсли;
	СвойствоЗначение = ОбъектНоменклатуры.ДополнительныеРеквизиты.Найти(ЭлементПВХ, "Свойство");
	Если СвойствоЗначение <> Неопределено Тогда
	    ЗначениеДопРеквизитаКолвоВКоробке = СвойствоЗначение.Значение; 
	Иначе
		ЗначениеДопРеквизитаКолвоВКоробке = Неопределено;
	КонецЕсли;
	Если ЗначениеДопРеквизитаКолвоВКоробке <> Неопределено Тогда
		Возврат ЗначениеДопРеквизитаКолвоВКоробке;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеВводаКодаМаркировки(Результат,эмм) Экспорт
	/////////////////////////////////////////////////////////
	Если Результат <> Неопределено И Результат <> "" Тогда
		//обновляем РС
		ОбновитьСтатусПоКодуМаркировки(Результат);
		
		////озвучиваем количество номер сколько уже упаковано в короб
		КоличествоУпакованных = ПолучитьКоличествоОтсканированных();
		КоличествоВсехКодовМаркировки = ПолучитьКоличествоВсехКодовМаркировкиПоСтроке();
		//ОзвучитьТекст(Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВсехКодовМаркировки) + " собрано в упаковку");
		СтрокаНумерацииУпакованных = Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВсехКодовМаркировки) + " собрано в упаковку";
		//Сообщить(Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВсехКодовМаркировки) + " собрано в упаковку");
		//проверяем на завершение
		Если ВсяУпаковкаЗавершена() Тогда
			Элементы.НачатьУпаковку.Заголовок = "Упаковка завершена";
			Сообщить("Упаковка полностью завершена, все КМ отсканированы");
			Возврат;
		КонецЕсли;
		//получаем следующие коды маркировки
		ПараметрыСтруктура = ПолучитьКодыМаркировки();
		Если ПараметрыСтруктура = Неопределено Тогда
			Сообщить("нет данных по регистр сведений УпаковкаПродукцииКодыМаркировки");
			Возврат;
		КонецЕсли;
		ПараметрыСтруктура.Вставить("СтрокаНумерацииУпакованных", СтрокаНумерацииУпакованных);
		
		//дальше запускаем окно, пока не нажмется отмена или вся упаковка не завершится
		Оповещение = Новый ОписаниеОповещения("ПослеВводаКодаМаркировки", ЭтотОбъект);
		ОткрытьФорму("Обработка.УпаковкаПродукции.Форма.ВводКода", ПараметрыСтруктура, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		// Пользователь нажал Отмена или закрыл диалог
		Сообщить("Ввод отменен");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоОтсканированных()
	// Создаем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкаПродукцииКодыМаркировки.Отсканировано КАК Отсканировано,
	|	УпаковкаПродукцииКодыМаркировки.Тип КАК Тип
	|ИЗ
	|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|ГДЕ
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование = &ДокументОснование
	|	И УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании = &НомерСтрокиВДокументеОсновании
	|	И УпаковкаПродукцииКодыМаркировки.Отсканировано = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ПроизводствоСсылка);
	Запрос.УстановитьПараметр("НомерСтрокиВДокументеОсновании", Объект.БИТ_КлючСтроки);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	
	Если ТаблицаЗначений.Количество() < 1 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ТаблицаЗначений[0].Тип = "Набор" ИЛИ ТаблицаЗначений[0].Тип = "ЧастьНабора" Тогда
		//ТаблицаЗначений.Свернуть("Тип");
		ОтсканированныеКоличество = 0;
		Для Каждого строкаТаблицы Из ТаблицаЗначений Цикл
			Если строкаТаблицы.Тип = "Набор" Тогда
				ОтсканированныеКоличество = ОтсканированныеКоличество +1;
			КонецЕсли;
		КонецЦикла;
		Возврат ОтсканированныеКоличество;
	КонецЕсли;
	
	Возврат ТаблицаЗначений.Количество();
КонецФункции

&НаСервере
Функция ПолучитьКоличествоВсехКодовМаркировкиПоСтроке()
	// Создаем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкаПродукцииКодыМаркировки.Отсканировано КАК Отсканировано,
	|	УпаковкаПродукцииКодыМаркировки.Тип КАК Тип
	|ИЗ
	|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|ГДЕ
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование = &ДокументОснование
	|	И УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании = &НомерСтрокиВДокументеОсновании";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ПроизводствоСсылка);
	Запрос.УстановитьПараметр("НомерСтрокиВДокументеОсновании", Объект.БИТ_КлючСтроки);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	
	Если ТаблицаЗначений.Количество() < 1 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ТаблицаЗначений[0].Тип = "Набор" ИЛИ ТаблицаЗначений[0].Тип = "ЧастьНабора" Тогда
		//ТаблицаЗначений.Свернуть("Тип");
		ОтсканированныеКоличество = 0;
		Для Каждого строкаТаблицы Из ТаблицаЗначений Цикл
			Если строкаТаблицы.Тип = "Набор" Тогда
				ОтсканированныеКоличество = ОтсканированныеКоличество +1;
			КонецЕсли;
		КонецЦикла;
		Возврат ОтсканированныеКоличество;
	КонецЕсли;
	
	Возврат ТаблицаЗначений.Количество();
КонецФункции

&НаКлиенте
Асинх Процедура ПослеВводаКодаМаркировкиДляКороба(Результат, ПараметрыПослеУдачногоВвода) Экспорт
	/////////////////////////////////////////////////////////
	Если Результат <> Неопределено И Результат <> "" Тогда
		//обновляем РС
		ОбновитьСтатусПоКодуМаркировкиПоКоробам(Результат, ПараметрыПослеУдачногоВвода.ШККороба);
		
		////озвучиваем количество номер сколько уже упаковано в короб
		КоличествоУпакованных = ПолучитьКоличествоУпакованныхВКороб(ПараметрыПослеУдачногоВвода.ШККороба);
		КоличествоВОдномКоробеВКарточкеНоменклатуры = ПолучитьЗначениеДопРеквизитаКороб(Объект.ТекущаяНоменклатура);
		//ОзвучитьТекст(Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВОдномКоробеВКарточкеНоменклатуры) + " собрано в короб");
		СтрокаНумерацииУпакованных = Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВОдномКоробеВКарточкеНоменклатуры) + " собрано в короб";
		//Сообщить(Строка(КоличествоУпакованных) + " из " + Строка(КоличествоВОдномКоробеВКарточкеНоменклатуры) + " собрано в короб");
		
		Если ПараметрыПослеУдачногоВвода.ВыводитьПечатьШККороба Тогда//если выводилась печать ШК короба, то это последний добавленный в короб и короб упакован
			СоздатьЗаписьВРСУпакованныеКороба(ПараметрыПослеУдачногоВвода.ШККороба);
			
			ОзвучитьТекст("Отгрузочный короб собран");
			
			СтрокаВопроса = "Короб с ШТРИХКОДОМ: " +Строка(ПараметрыПослеУдачногоВвода.ШККороба) + " полностью упакован, перейти к следующему?";
			Ответ = Ждать ВопросАсинх(СтрокаВопроса, РежимДиалогаВопрос.ДаНет);
			
			// Этот код выполнится ТОЛЬКО ПОСЛЕ ТОГО, как пользователь ответит на вопрос.
			Если Ответ = КодВозвратаДиалога.Да Тогда
			Сообщить("Начата упаковка следующего короба!");
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		//проверяем на завершение
		Если ВсяУпаковкаВКоробаЗавершена() Тогда
			Элементы.НачатьУпаковку.Заголовок = "Упаковка в короба завершена";
			ОзвучитьТекст("Упаковка строки полностью завершена");
			Сообщить("Упаковка в короба полностью завершена, все КМ отсканированы");
			Возврат;
		КонецЕсли;
		
		
		//получаем следующие коды маркировки
		ПараметрыСтруктура = ПолучитьКодыМаркировкиДляКороба();
		Если ПараметрыСтруктура = Неопределено Тогда
			Сообщить("Ошибка ПриПолученииКодовМаркировки для коробов");
			Возврат;
		КонецЕсли;
		ПараметрыСтруктура.Вставить("ИспользуемыйСклад", Объект.ИспользуемыйСклад);
		ПараметрыСтруктура.Вставить("СтрокаНумерацииУпакованных", СтрокаНумерацииУпакованных);
		
		
		ПараметрыПослеУдачногоВвода = Новый Структура;
		ПараметрыПослеУдачногоВвода.Вставить("ШККороба",ПараметрыСтруктура.ШККороба);
		ПараметрыПослеУдачногоВвода.Вставить("ВыводитьПечатьШККороба", ПараметрыСтруктура.ВыводитьПечатьШККороба);
		//дальше запускаем окно, пока не нажмется отмена или вся упаковка не завершится
		Оповещение = Новый ОписаниеОповещения("ПослеВводаКодаМаркировкиДляКороба", ЭтотОбъект, ПараметрыПослеУдачногоВвода);
		ОткрытьФорму("Обработка.УпаковкаПродукции.Форма.ВводКороба", ПараметрыСтруктура, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		// Пользователь нажал Отмена или закрыл диалог
		Сообщить("Упаковка в короба отменена");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеУпаковкиВопросЗавершен(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		// Пользователь нажал "Да"
		НачатьИлиПродолжитьУпаковкуВКороба();
		Возврат;
	Иначе
		// Пользователь нажал "Нет"
		Сообщить("Упаковка в короба отменена");
		Возврат;//прерываем
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусПоКодуМаркировки(КодМаркировки)
	
	Если КодМаркировки = "" Или КодМаркировки = Неопределено Тогда
		Сообщить("Ошибка: не указан код маркировки");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкаПродукцииКодыМаркировки.ИндексСтроки КАК ИндексСтроки,
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование КАК ДокументОснование,
	|	УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании КАК НомерСтрокиВДокументеОсновании
	|ИЗ
	|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|ГДЕ
	|	УпаковкаПродукцииКодыМаркировки.КодМаркировки = &КодМаркировки";
	
	Запрос.УстановитьПараметр("КодМаркировки", КодМаркировки);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// 2. Обновляем найденные записи через набор записей
	Если Выборка.Следующий() Тогда
		НаборЗаписей = РегистрыСведений.УпаковкаПродукцииКодыМаркировки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИндексСтроки.Установить(Выборка.ИндексСтроки);
		НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
		НаборЗаписей.Отбор.НомерСтрокиВДокументеОсновании.Установить(Выборка.НомерСтрокиВДокументеОсновании);
		НаборЗаписей.Прочитать();
		
		Для каждого Запись Из НаборЗаписей Цикл
			Запись.Отсканировано = Истина;
			Запись.ДатаУпаковки = ТекущаяДата();
			Запись.ЗонаУпаковка = Объект.ОтветственнаяЗона;
			Запись.ОтветственныйЗаУпаковкуСотрудник = Объект.ОтветственныйСотрудник;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		Сообщить("Статус обновлен для кода: " + КодМаркировки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусПоКодуМаркировкиПоКоробам(КодМаркировки, ШККороба)
	
	Если КодМаркировки = "" Или КодМаркировки = Неопределено Тогда
		Сообщить("Ошибка: не указан код маркировки");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкаПродукцииКодыМаркировки.ИндексСтроки КАК ИндексСтроки,
	|	УпаковкаПродукцииКодыМаркировки.ДокументОснование КАК ДокументОснование,
	|	УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании КАК НомерСтрокиВДокументеОсновании,
	|	УпаковкаПродукцииКодыМаркировки.Тип КАК Тип,
	|	УпаковкаПродукцииКодыМаркировки.НомерНабора КАК НомерНабора
	|ИЗ
	|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|ГДЕ
	|	УпаковкаПродукцииКодыМаркировки.КодМаркировки = &КодМаркировки";
	
	Запрос.УстановитьПараметр("КодМаркировки", КодМаркировки);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// 2. Обновляем найденные записи через набор записей
	Если Выборка.Следующий() Тогда
		Если Выборка.Тип = "Набор" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УпаковкаПродукцииКодыМаркировки.ИндексСтроки КАК ИндексСтроки,
			|	УпаковкаПродукцииКодыМаркировки.ДокументОснование КАК ДокументОснование,
			|	УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании КАК НомерСтрокиВДокументеОсновании,
			|	УпаковкаПродукцииКодыМаркировки.Тип КАК Тип,
			|	УпаковкаПродукцииКодыМаркировки.НомерНабора КАК НомерНабора
			|ИЗ
			|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
			|ГДЕ
			|	УпаковкаПродукцииКодыМаркировки.ДокументОснование = &ДокументОснование
			|	И УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании = &НомерСтрокиВДокументеОсновании
			|	И УпаковкаПродукцииКодыМаркировки.НомерНабора = &НомерНабора";
			
			Запрос.УстановитьПараметр("ДокументОснование", Выборка.ДокументОснование);
			Запрос.УстановитьПараметр("НомерСтрокиВДокументеОсновании", Выборка.НомерСтрокиВДокументеОсновании);
			Запрос.УстановитьПараметр("НомерНабора", Выборка.НомерНабора);
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				НаборЗаписей = РегистрыСведений.УпаковкаПродукцииКодыМаркировки.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ИндексСтроки.Установить(Выборка.ИндексСтроки);
				НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
				НаборЗаписей.Отбор.НомерСтрокиВДокументеОсновании.Установить(Выборка.НомерСтрокиВДокументеОсновании);
				НаборЗаписей.Прочитать();
				
				Для каждого Запись Из НаборЗаписей Цикл
					Запись.ШтрихкодКороба = ШККороба;
					Запись.СобраноВКороб = Истина;
					Запись.ДатаКороб = ТекущаяДата();
					Запись.ЗонаКороб = Объект.ОтветственнаяЗона;
					Запись.ОтветственныйЗаКоробСотрудник = Объект.ОтветственныйСотрудник;
				КонецЦикла;
				
				НаборЗаписей.Записать();
			КонецЦикла;
			Сообщить("Статус обновлен для кода: " + КодМаркировки);
		Иначе
			
			НаборЗаписей = РегистрыСведений.УпаковкаПродукцииКодыМаркировки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИндексСтроки.Установить(Выборка.ИндексСтроки);
			НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
			НаборЗаписей.Отбор.НомерСтрокиВДокументеОсновании.Установить(Выборка.НомерСтрокиВДокументеОсновании);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Запись.ШтрихкодКороба = ШККороба;
				Запись.СобраноВКороб = Истина;
				Запись.ДатаКороб = ТекущаяДата();
				Запись.ЗонаКороб = Объект.ОтветственнаяЗона;
				Запись.ОтветственныйЗаКоробСотрудник = Объект.ОтветственныйСотрудник;
			КонецЦикла;
			
			НаборЗаписей.Записать();
			Сообщить("Статус обновлен для кода: " + КодМаркировки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратКДокументу(Команда)
	РазрешеноЗакрытиеФормы = Истина;
	Закрыть(ВсяУпаковкаВКоробаЗавершена());
КонецПроцедуры 

&НаКлиенте
Процедура ОзвучитьТекст(ТекстДляОзвучки)
	
	Попытка
		// 1. Создаем COM-объект голосового движка Windows
		Голос = Новый COMОбъект("SAPI.SpVoice");
		
		// Пример для голоса "Pavel" из Windows 10/11
		Голос.Voice = Голос.GetVoices().Item(0); // Первый доступный голос
		// Или указать конкретный из реестра:
		// Голос.Voice.Category.Default = "HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Speech_OneCore\Voices\Tokens\MSTTS_V110_ruRU_PavelM";
		//Голос.Voice.Category.Default = "HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Speech\Voices\Tokens\TTS_MS_RU-RU_IRINA_11.0";
		
		
		//// берем последний
		//Для Индекс = 0 По Голос.GetVoices().Count - 1 Цикл
		//	Голос.Voice = Голос.GetVoices().Item(Индекс);
		//КонецЦикла;
		
		// 2. Устанавливаем громкость (0 - 100)
		Голос.Volume = 100;
		
		// 3. Выбираем скорость речи (-10 - 10). 0 - средняя
		Голос.Rate = 0;
		
		// 4. Произносим текст
		Голос.Speak(ТекстДляОзвучки);
		
	Исключение
		Сообщить("Не удалось воспроизвести речь: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // Устанавливаем обработчик ожидания, который сработает через 1 секунду
    WSHShell = Новый COMОбъект("WScript.Shell");
    WSHShell.SendKeys("% ");
    WSHShell.SendKeys("{DOWN}{DOWN}{DOWN}{DOWN}{ENTER}");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДеревоЗначений(Команда)
	
	ПараметрыСтруктура = Новый Структура;
	ПараметрыСтруктура.Вставить("ДокументОснование",Объект.ПроизводствоСсылка);
	ПараметрыСтруктура.Вставить("ТекущаяНоменклатура", Объект.ТекущаяНоменклатура);
	
	Оповещение = Новый ОписаниеОповещения("ПослеОткрытияДереваКоробов", ЭтотОбъект, ПараметрыСтруктура);
	ОткрытьФорму("Обработка.УпаковкаПродукции.Форма.ФормаДерева", ПараметрыСтруктура, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытияДереваКоробов(Результат, ПараметрыСтруктура) Экспорт
	//Описание что происходит после закрытия формы дерева
КонецПроцедуры





#Область НеИспользуется



//&НаКлиенте
//Процедура ПослеВводаКодаМаркировкиКМДойпак(Результат, ДополнительныеПараметры) Экспорт
//	КодМаркировкиИзРегистра = ДополнительныеПараметры;
//	
//	Если Результат <> Неопределено И Результат <> "" Тогда
//		
//		Если Результат = КодМаркировкиИзРегистра Тогда
//			Сообщить("КМ верный для дойпака " + КодМаркировкиИзРегистра);
//			ОбновитьСтатусПоКодуМаркировки(Результат);
//			СледующийКодМаркировки = ПолучитьСледующийКодМаркировкиНаСервере(КодМаркировкиИзРегистра);
//			Если СледующийКодМаркировки <> Неопределено И СледующийКодМаркировки <> "" Тогда
//				НачатьУпаковкуДляКода(СледующийКодМаркировки);
//			Иначе
//				Сообщить("Упаковка завершена! Все коды обработаны.");
//			КонецЕсли;
//		Иначе
//			Сообщить("Ошибка: Введен неверный КМ для дойпака " + КодМаркировкиИзРегистра);
//			ВыводСтроки = "Повторно наклейте КМ на сам дойпак и отсканируйте " + КодМаркировкиИзРегистра;
//			ПараметрыФормы = Новый Структура;
//			ПараметрыФормы.Вставить("ТекстПодсказки", ВыводСтроки);
//			ПараметрыФормы.Вставить("ОжидаемыйКод", КодМаркировкиИзРегистра);
//			ПараметрыФормы.Вставить("ТипВвода", "Набор");
//			
//			Оповещение = Новый ОписаниеОповещения("ПослеВводаКодаМаркировкиКМДойпак", ЭтотОбъект, КодМаркировкиИзРегистра);
//			ОткрытьФорму("Обработка.УпаковкаПродукции.Форма.ВводКода", ПараметрыФормы, , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//			
//		КонецЕсли;
//		
//		
//	Иначе
//		// Пользователь нажал Отмена или закрыл диалог
//		Сообщить("Ввод отменен для кода: " + КодМаркировкиИзРегистра);
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура НачатьУпаковкуДляКода(КодМаркировки)
//	
//	ЭтоНабор = КодМаркировкиЭтоНабор(КодМаркировки);
//	
//	Если ЭтоНабор тогда
//		ВыводСтроки = "Наклейте КМ на упаковку и отсканируйте " + КодМаркировки;
//		ТипВвода = "Набор";
//	Иначе 
//		ВыводСтроки = "Считайте ШК дойпака";
//		ТипВвода = "Дойпак";
//	КонецЕсли;
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("ТекстПодсказки", ВыводСтроки);
//	ПараметрыФормы.Вставить("ОжидаемыйКод", КодМаркировки);
//	ПараметрыФормы.Вставить("ТипВвода", ТипВвода);
//	
//	Оповещение = Новый ОписаниеОповещения("ПослеВводаКодаМаркировки", ЭтотОбъект);
//	ОткрытьФорму("Обработка.УпаковкаПродукции.Форма.ВводКода", ПараметрыФормы, , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПослеВводаЗначенияДляДойпака(Результат, ДополнительныеПараметры) Экспорт
//	КодМаркировкиИзРегистра = ДополнительныеПараметры;
//	Если Результат <> Неопределено Тогда
//		
//		Если Результат = КодМаркировкиИзРегистра Тогда
//	            // Код маркировки верный
//	            Сообщить("Код маркировки для дойпака верный");
//				ОбновитьСтатусПоКодуМаркировки(Результат);
//				// Например, получаем следующий код маркировки
//	            СледующийКодМаркировки = ПолучитьСледующийКодМаркировкиНаСервере(КодМаркировкиИзРегистра);
//	            
//	            Если СледующийКодМаркировки <> Неопределено И СледующийКодМаркировки <> "" Тогда
//	                // Вызываем процедуру для следующего кода
//	                НачатьУпаковкуДляКода(СледующийКодМаркировки);
//	            Иначе
//	                Сообщить("Упаковка завершена! Все коды обработаны.");
//	            КонецЕсли;
//		Иначе
//	            // Код маркировки неверный - показываем диалог повторно
//	            Сообщить("Ошибка: Введен неверный код маркировки для дойпака " + КодМаркировкиИзРегистра);
//	            
//	            // Повторно вызываем диалог для того же кода маркировки
//	            Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияДляДойпака", ЭтотОбъект, КодМаркировкиИзРегистра);
//	            ПоказатьВводСтроки(Оповещение, "Считайте код маркировки дойпака: " + КодМаркировкиИзРегистра + " Введите значение (повторно):", "", 100); 
//				//вывод на печать доработать
//			КонецЕсли;
//	Иначе
//		// Пользователь нажал Отмена или закрыл диалог
//		Сообщить("Ввод отменен для кода: " + КодМаркировкиИзРегистра);
//	КонецЕсли;
//Конецпроцедуры

//&НаКлиенте
//Процедура ПослеВводаЗначения(Результат, ДополнительныеПараметры) Экспорт
//    КодМаркировкиИзРегистра = ДополнительныеПараметры;
//    ЭтоНабор = КодМаркировкиЭтоНабор(КодМаркировкиИзРегистра);
//	Если Не ЭтоНабор Тогда
//	    Если Результат <> Неопределено Тогда
//	        // Пользователь ввел значение и нажал ОК
//	        // Проверяем на сервере, совпадает ли введенный штрихкод с кодом маркировки
//	        РезультатПроверки = ПроверитьШтрихкодНаСервере(КодМаркировкиИзРегистра, Результат);
//	        
//	        Если РезультатПроверки Тогда
//	            // Штрихкод верный
//	            Сообщить("Штрихкод верный");
//	            // вызываем диалог для кода маркировки
//	            Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияДляДойпака", ЭтотОбъект, КодМаркировкиИзРегистра);
//	            ПоказатьВводСтроки(Оповещение, "Считайте код маркировки дойпака: " + КодМаркировкиИзРегистра, "", 100); 
//				//вывод на печать доработать
//	        Иначе
//	            // Штрихкод неверный - показываем диалог повторно
//	            Сообщить("Ошибка: Введен неверный штрихкод для кода маркировки " + КодМаркировкиИзРегистра);
//	            
//	            // Повторно вызываем диалог для того же кода маркировки
//	            Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект, КодМаркировкиИзРегистра);
//	            ПоказатьВводСтроки(Оповещение, "Считайте ШК дойпака", "", 100);
//	        КонецЕсли;
//	    Иначе
//	        // Пользователь нажал Отмена или закрыл диалог
//	        Сообщить("Ввод отменен для кода: " + КодМаркировкиИзРегистра);
//		КонецЕсли;
//	Иначе
//		Если Результат <> Неопределено Тогда
//			Если Результат = КодМаркировкиИзРегистра Тогда
//				Сообщить("КМ верный для кода " + КодМаркировкиИзРегистра);
//				ОбновитьСтатусПоКодуМаркировки(Результат);
//				СледующийКодМаркировки = ПолучитьСледующийКодМаркировкиНаСервере(КодМаркировкиИзРегистра);
//				 Если СледующийКодМаркировки <> Неопределено И СледующийКодМаркировки <> "" Тогда
//		         	// Вызываем процедуру для следующего кода
//		         	НачатьУпаковкуДляКода(СледующийКодМаркировки);
//		         Иначе
//		         	Сообщить("Упаковка завершена! Все коды обработаны.");
//		         КонецЕсли;
//			Иначе
//				Сообщить("Ошибка: Введен неверный КМ для кода маркировки " + КодМаркировкиИзРегистра);
//				Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект, КодМаркировкиИзРегистра);
//		        ПоказатьВводСтроки(Оповещение, "Код маркировки: " + КодМаркировкиИзРегистра + " считайте значение (повторно):", "", 100);
//			КонецЕсли
//		Иначе
//			// Пользователь нажал Отмена или закрыл диалог
//	        Сообщить("Ввод отменен для кода: " + КодМаркировкиИзРегистра);
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура НачатьУпаковкуДляКода(КодМаркировки)
//	ЭтоНабор = КодМаркировкиЭтоНабор(КодМаркировки);
//	Если ЭтоНабор тогда
//		ВыводСтроки = "Наклейте КМ на упаковку и отсканируйте " + КодМаркировки;
//	Иначе 
//		ВыводСтроки = "Считайте ШК дойпака"; 
//	КонецЕсли;
//    Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект, КодМаркировки);
//    ПоказатьВводСтроки(Оповещение, ВыводСтроки, "", 100);
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьСледующийКодМаркировкиНаСервере(ТекущийКодМаркировки)
//    // Получаем все коды маркировки из регистра
//    ТаблицаЗначенийУпаковки = ПолучитьИзРегистраУпаковкаПродукцииКодыМаркировки(Объект.ПроизводствоСсылка, Объект.БИТ_КлючСтроки);
//    
//    // Ищем индекс текущего кода и возвращаем следующий
//    Для Индекс = 0 По ТаблицаЗначенийУпаковки.Количество() - 1 Цикл
//        Если ТаблицаЗначенийУпаковки[Индекс].КодМаркировки = ТекущийКодМаркировки Тогда
//            Если Индекс + 1 < ТаблицаЗначенийУпаковки.Количество() Тогда
//                Возврат ТаблицаЗначенийУпаковки[Индекс + 1].КодМаркировки;
//            Иначе
//                Возврат Неопределено; // Это был последний код
//            КонецЕсли;
//        КонецЕсли;
//    КонецЦикла;
//    
//    Возврат Неопределено;
//КонецФункции

//&НаСервере
//Функция КодМаркировкиЭтоНабор(КодМаркировки)
//    ТаблицаЗначенийУпаковки = ПолучитьИзРегистраУпаковкаПродукцииКодыМаркировки(Объект.ПроизводствоСсылка, Объект.БИТ_КлючСтроки);
//	Для каждого СтрокаТаблицы Из ТаблицаЗначенийУпаковки Цикл 
//		Если СтрокаТаблицы.КодМаркировки = КодМаркировки Тогда
//			Если СтрокаТаблицы.Тип = "Набор" Тогда
//				Возврат Истина;
//			Иначе
//				Возврат Ложь;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//КонецФункции

//&НаСервере
//Функция КодМаркировкиЭтоЧастьНабора(КодМаркировки)
//    ТаблицаЗначенийУпаковки = ПолучитьИзРегистраУпаковкаПродукцииКодыМаркировки(Объект.ПроизводствоСсылка, Объект.БИТ_КлючСтроки);
//	Для каждого СтрокаТаблицы Из ТаблицаЗначенийУпаковки Цикл 
//		Если СтрокаТаблицы.КодМаркировки = КодМаркировки Тогда
//			Если СтрокаТаблицы.Тип = "ЧастьНабора" Тогда
//				Возврат Истина;
//			Иначе
//				Возврат Ложь;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//КонецФункции

//&НаСервере
//Функция КодМаркировкиЭтоДойпак(КодМаркировки)
//    ТаблицаЗначенийУпаковки = ПолучитьИзРегистраУпаковкаПродукцииКодыМаркировки(Объект.ПроизводствоСсылка, Объект.БИТ_КлючСтроки);
//	Для каждого СтрокаТаблицы Из ТаблицаЗначенийУпаковки Цикл 
//		Если СтрокаТаблицы.КодМаркировки = КодМаркировки Тогда
//			Если СтрокаТаблицы.Тип = "Дойпак" Тогда
//				Возврат Истина;
//			Иначе
//				Возврат Ложь;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//КонецФункции

//&НаСервере
//Функция ПроверитьШтрихкодНаСервере(КодМаркировки, ВведенныйШтрихкод)
//    // Здесь логика проверки соответствия введенного штрихкода коду маркировки
//    // Например, получаем ожидаемый штрихкод для данного кода маркировки из базы
//    
//    ОжидаемыйШтрихкод = ПолучитьШтрихкодПоКодуМаркировки(КодМаркировки);
//	
//	Если ВведенныйШтрихкод <> ОжидаемыйШтрихкод Тогда
//		Запрос = Новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//		               |	УпаковкаПродукцииКодыМаркировки.GTIN КАК GTIN
//		               |ИЗ
//		               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
//		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
//		               |		ПО ШтрихкодыНоменклатуры.Номенклатура = УпаковкаПродукцииКодыМаркировки.Номенклатура
//		               |ГДЕ
//		               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
//		Запрос.УстановитьПараметр("Штрихкод", ВведенныйШтрихкод); 
//		Результат = Запрос.Выполнить();
//		Если Не Результат.Пустой() Тогда
//			Выборка = Результат.Выбрать();
//			Выборка.Следующий();
//			Если  Выборка.GTIN = ОжидаемыйШтрихкод Тогда
//				Возврат Истина;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//    
//    // Сравниваем введенный штрихкод с ожидаемым
//    Возврат ВведенныйШтрихкод = ОжидаемыйШтрихкод;
//КонецФункции

//&НаСервере
//Функция ПолучитьШтрихкодПоКодуМаркировки(КодМаркировки)
//    // Ищем маркер GTIN (01)
//	ПозицияНачала = Найти(КодМаркировки, "(01)");
//	
//	Если ПозицияНачала > 0 Тогда
//		// Извлекаем 14 цифр после (01)
//		Штрихкод = Сред(КодМаркировки, ПозицияНачала + 4, 14);
//		Возврат Штрихкод;
//	КонецЕсли;
//	
//	// Если не нашли, пробуем другие форматы
//	ПозицияНачала = Найти(КодМаркировки, "01");
//	Если ПозицияНачала > 0 Тогда
//		Штрихкод = Сред(КодМаркировки, ПозицияНачала + 2, 14);
//		Возврат Штрихкод;
//	КонецЕсли;
//	
//	Возврат "";
//КонецФункции
#КонецОбласти








