#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура БИТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//ПродолжитьВызов(Отказ, СтандартнаяОбработка);
	
	// Заполняем срок годности из реквизита Бит_СрокГодности
	Если ПолучитьБИТ_АвтоЗаполнениеПроверкиИПодбораПоСрокамГодности() Тогда
		ЗаполнитьСрокГодностиИзРеквизита();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БИТ_ДоработкаПриОткрытииПосле(Отказ)
	Если ПолучитьБИТ_АвтоЗаполнениеПроверкиИПодбораПоСрокамГодности() Тогда
		АвтоЗавершить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьБИТ_АвтоЗаполнениеПроверкиИПодбораПоСрокамГодности()
	Возврат Константы.БИТ_АвтоЗаполнениеПроверкиИПодбораПоСрокамГодности.Получить();
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеДляУточнения

&НаКлиенте
&После("ДанныеДляУточненияПриОкончанииРедактирования")
Процедура БИТ_ДанныеДляУточненияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	//ПродолжитьВызов(Элемент, НоваяСтрока, ОтменаРедактирования);
	Если ПолучитьБИТ_АвтоЗаполнениеПроверкиИПодбораПоСрокамГодности() Тогда
		Если Не ОтменаРедактирования Тогда
			АвтоЗавершить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&После("ДанныеДляУточненияНоменклатураПриИзменении")
Процедура БИТ_ДанныеДляУточненияНоменклатураПриИзменении(Элемент)
	
	//ПродолжитьВызов(Элемент);
	
	// Заполняем срок годности при выборе номенклатуры
	Если ПолучитьБИТ_АвтоЗаполнениеПроверкиИПодбораПоСрокамГодности() Тогда
		ЗаполнитьСрокГодностиДляТекущейСтроки();
		
		АвтоЗавершить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСрокГодностиИзРеквизита()
	
	Для Каждого Строка Из ДанныеДляУточнения Цикл
		
		// Пропускаем комплектацию
		Если ДаннаяНоменклатураЭтоКомплектация(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		// Если срок не заполнен и есть номенклатура
		Если Не ЗначениеЗаполнено(Строка.СрокГодности) И ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			БитСрокГодности = ПолучитьБитСрокГодности(Строка.Номенклатура);
			Если ЗначениеЗаполнено(БитСрокГодности) Тогда
				Строка.СрокГодности = НачалоДня(ДобавитьМесяц(ТекущаяДата(), БитСрокГодности));
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСрокГодностиДляТекущейСтроки()
	
	ТекущиеДанные = Элементы.ДанныеДляУточнения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДаннаяНоменклатураЭтоКомплектация(ТекущиеДанные.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СрокГодности) И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		БитСрокГодности = ПолучитьБитСрокГодностиНаСервере(ТекущиеДанные.Номенклатура);
		Если ЗначениеЗаполнено(БитСрокГодности) Тогда
			ТекущиеДанные.СрокГодности = ДобавитьМесяц(ТекущаяДата(), БитСрокГодности);;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ДаннаяНоменклатураЭтоКомплектация(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КомплектацииНоменклатуры.Ссылка КАК Комплектация
	|ИЗ
	|	Справочник.КомплектацииНоменклатуры КАК КомплектацииНоменклатуры
	|ГДЕ
	|	КомплектацииНоменклатуры.Владелец = &Номенклатура
	|	И КомплектацииНоменклатуры.ПометкаУдаления = ЛОЖЬ
	|	И КомплектацииНоменклатуры.Недействителен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура АвтоЗавершить()
	
	ПодключитьОбработчикОжидания("ВыполнитьАвтоЗавершить", 0.3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтоЗавершить() Экспорт
	
	// Отключаем обработчик, чтобы не срабатывал повторно
	ОтключитьОбработчикОжидания("ВыполнитьАвтоЗавершить");
	
	ВсеЗаполнено = ПроверитьЗаполненностьНаСервере();
	
	Если ВсеЗаполнено И ДанныеДляУточнения.Количество() > 0 Тогда
		Команда = Команды.Найти("Готово");
		Если Команда <> Неопределено Тогда
			ЗавершитьРедактирование(Команда);
		Иначе
			ЗавершитьРедактирование(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполненностьНаСервере()
	
	Для Каждого Строка Из ДанныеДляУточнения Цикл
		
		Если ДаннаяНоменклатураЭтоКомплектация(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) И 
			Не ПараметрыСканирования.РазрешенаОбработкаКодовСПустойНоменклатурой Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если Строка.ХарактеристикиИспользуются И 
			Не ЗначениеЗаполнено(Строка.Характеристика) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ИнтеграцияИСКлиентСервер.НеобходимоУказатьСерию(Строка.СтатусУказанияСерий) И 
			Не ЗначениеЗаполнено(Строка.Серия) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ПараметрыСканирования.Свойство("ЗаполнятьДанныеВЕТИС") И 
			ПараметрыСканирования.ЗаполнятьДанныеВЕТИС И 
			Не ЗначениеЗаполнено(Строка.ИдентификаторПроисхожденияВЕТИС) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ПараметрыСканирования.Свойство("ЗаполнятьСрокГодности") И 
			ПараметрыСканирования.ЗаполнятьСрокГодности И 
			Не ЗначениеЗаполнено(Строка.СрокГодности) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьБитСрокГодности(Номенклатура)
	
	Попытка
		Возврат Номенклатура.Бит_СрокГодности;
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.БИТ_СрокГодности КАК БитСрокГодности
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	Попытка
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Результат.БитСрокГодности;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьБитСрокГодностиНаСервере(Номенклатура)
	
	Возврат ПолучитьБитСрокГодности(Номенклатура);
	
КонецФункции


#КонецОбласти