&НаКлиенте
Процедура ОткатитьСтроки(Команда)
    ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	//ВыделенныеСтроки = Элементы.Список.ТекущиеДанные;
	
    Если ВыделенныеСтроки.Количество() = 0 Тогда
        Сообщить("Не выбрано ни одной записи");
        Возврат;
    КонецЕсли;
    
    // Просто передаем индексы на сервер
	Для Каждого КлючСтроки Из ВыделенныеСтроки Цикл
		ОбновитьСтатусПоКодуМаркировки(КлючСтроки);
	КонецЦикла;
	ЭтаФорма.ОбновитьОтображениеДанных();
	Сообщить("Обновлено строк "+ВыделенныеСтроки.Количество()); 
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусПоКодуМаркировки(КлючСтроки)
	Запись = регистрыСведений.УпаковкаПродукцииКодыМаркировки.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючСтроки);
	Запись.Прочитать();
	Запись.Отсканировано = Ложь;
	Запись.СобраноВКороб = Ложь;
	Запись.ШтрихкодКороба = "";
	Запись.Записать(Истина);
	
	//Если КодМаркировки = "" Или КодМаркировки = Неопределено Тогда
	//	Сообщить("Ошибка: не указан код маркировки");
	//	Возврат;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	УпаковкаПродукцииКодыМаркировки.ИндексСтроки КАК ИндексСтроки,
	//|	УпаковкаПродукцииКодыМаркировки.ДокументОснование КАК ДокументОснование,
	//|	УпаковкаПродукцииКодыМаркировки.НомерСтрокиВДокументеОсновании КАК НомерСтрокиВДокументеОсновании
	//|ИЗ
	//|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	//|ГДЕ
	//|	УпаковкаПродукцииКодыМаркировки.КодМаркировки = &КодМаркировки";
	//
	//Запрос.УстановитьПараметр("КодМаркировки", КодМаркировки);
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//// 2. Обновляем найденные записи через набор записей
	//Если Выборка.Следующий() Тогда
	//	НаборЗаписей = РегистрыСведений.УпаковкаПродукцииКодыМаркировки.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.ИндексСтроки.Установить(Выборка.ИндексСтроки);
	//	НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
	//	НаборЗаписей.Отбор.НомерСтрокиВДокументеОсновании.Установить(Выборка.НомерСтрокиВДокументеОсновании);
	//	НаборЗаписей.Прочитать();
	//	
	//	Для каждого Запись Из НаборЗаписей Цикл
	//		Запись.Отсканировано = Ложь;

	//	КонецЦикла;
	//	
	//	НаборЗаписей.Записать();
	//	Сообщить("Статус обновлен для кода: " + КодМаркировки);
	//КонецЕсли;
	
КонецПроцедуры