&Вместо("ПечатьЭтикетокИСМП")
Процедура ПечатьЭтикетокИСМПВместо(ТаблицаДляПечати, ТабличныйДокумент, СтруктураНастроек, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ДополнитьТаблицуШтрихкодамиУпаковок(ТаблицаДляПечати);
	Если ЗначениеЗаполнено(ТаблицаДляПечати[0].ЗаказНаЭмиссию) И НЕ ЗначениеЗаполнено(ТаблицаДляПечати[0].СрокГодности) Тогда
		ТаблицаДляПечати[0].СрокГодности = ТаблицаДляПечати[0].ЗаказНаЭмиссию.Дата;
	КонецЕсли;
	ПечатьЭтикеток(ТаблицаДляПечати, ТабличныйДокумент, СтруктураНастроек);
	
КонецПроцедуры