&НаКлиенте
&После("ПослеПриОткрытии")
Процедура ДополнитьПриОткрытии(Отказ)
	
	
	//Теперь кнопку отображаем сразу
	//Если Строка(СтатусПредставление) = "Коды маркировки эмитированы" Тогда
	//	Элементы.БИТ_ВиртуальнаяАгрегация.Видимость = Истина;
	//	Элементы.БИТ_ВиртуальнаяАгрегация.Доступность = Истина;
	//КонецЕсли;
	
	
	
	//для ТЧ редактирование, при константе отключенной не используется
	Если РазрешеноАвтоматическоеПерезаполнение() Тогда
		МассивСтрок = Новый Массив;
		ИндексСтрокВДокументе = 0;
		Для Каждого СтрокаТоваров Из ЭтотОбъект.Объект.Товары Цикл 
			//Если СтрокаТоваров.ИдентификаторСтроки = "" Тогда
			//	ЭтотОбъект.Объект.Товары.Удалить(СтрокаТоваров); 
			//конецЕсли;
		КонецЦикла;
		Для Каждого СтрокаТоваров Из ЭтотОбъект.Объект.Товары Цикл 
			МассивСтрок.Добавить(ИндексСтрокВДокументе);
			ИндексСтрокВДокументе = ИндексСтрокВДокументе + 1;
		КонецЦикла;
		ВыполнитьПерезаполнениеНаборовИГрупповыхУпаковок(МассивСтрок);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РазрешеноАвтоматическоеПерезаполнение()
	Если Константы.БИТ_ИспользоватьАвтосозданиеЭмиссии.Получить() = Истина Тогда
		Если ЭтотОбъект.Объект.Ссылка = Неопределено ИЛИ ЭтотОбъект.Объект.Ссылка = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПустаяСсылка() Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура БИТ_ДоработкаБИТ_ВиртуальнаяАгрегация(Команда)
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Документ", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ВидПродукции", Объект.ВидПродукции);
	ПараметрыОткрытия.Вставить("АвтоматическаяАгрегация", Истина);
	
	ОткрытьФорму(
		"Обработка.ВиртуальнаяАгрегацияУпаковокИСМП.Форма",
		ПараметрыОткрытия,
		ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

